{
  "modId": 89440.0,
  "modName": "True Armor",
  "summary": "Are you sick of swords cutting through Steel Plate like through butter? Every hit being predictable? Every type of armor feeling the same, regardless of material? No more! <br />Greatly increased combat depth and immersion;  a sparkle of realism and balance for your fantasy game!",
  "descriptionHtml": "[size=3]\n<br />[b]Note:[/b] There is a Special Edition version [url=https://www.nexusmods.com/skyrimspecialedition/mods/15921]here[/url]!\n<br />\n<br />\n<br />[font=Georgia][size=5][color=#f6b26b]Why You Need True Armor[/color][/size][/font]\n<br />\n<br />In vanilla Skyrim there are different armor types and a multitude of armor sets, yet all of them fit somewhere into the spectrum of warm butter to cold butter. They all function the same, no differences, no diversity, no strengths and weaknesses to any of them. The armor system is shallow and boring. This also reflects on vanilla combat, which is pathetic at best. And while there are many combat mods around, none of them sufficiently address the role of armor in the equation.\n<br />\n<br />That is where True Armor comes in. This mod completely overhauls the way armor fundamentally works in Skyrim, up to the point where it can practically replace the vanilla armor system completely. You will be hard pressed to find any mod which offers a more immersive, realistic and in-depth experience regarding the mechanics of armor. \n<br />\n<br />\n<br />[font=Georgia][size=5][color=#f6b26b]Features[/color][/size][/font]\n<br />\n<br />[list]\n<br />[*][b]Armors finally feel and play differently[/b]\n<br />Every armor type gets individual and weapon or magic specific protections. Further worn armor will noticeably impact your speed and regeneration.[*][b]Fair[/b]\n<br />Almost all of True Armors effects work on both, the player and those in combat with him or her equally. Light armors make up for their lack of protections with substantially higher speed and regeneration values.[*][b]Creature protections[/b]\n<br />True Armor now lets you assign its armor protections to creatures aswell for a better allround experience.[*][b]Passive Block mechanic[/b]\n<br />Let your shield work for you, even when you are not actively blocking.[*][b]Sound Effect Overlay[/b]\n<br />When your sword glances off their breastplate and your mace crushes their skull beneath, you will be able to tell, just by listening.[*][b]Dynamic Health Limiter[/b]\n<br />No more unrealistic and immersion breaking damage sponge enemies. Bring their health down to reasonable levels as you pass by.[*][b]Fully customizable[/b]\n<br />Tweak hundreds of settings to realize [i]your[/i] vision of how armor should work, or simply load one of the included presets and jump straight into the action.[*][b]Works with all armors, even customs[/b]\n<br />Read here how they get sorted into the 15 armor categories: [url=https://www.nexusmods.com/skyrim/articles/51295]Classification of Armors[/url].[*][b]Compatible with practically everything[/b]\n<br />For a few more details refer to the Compatibility section.[/list]\n<br />\n<br />\n<br />[font=Georgia][size=5][color=#f6b26b]How It Works[/color][/size][/font]\n<br />\n<br />[code][youtube]m60_PlbWiUA[/youtube][/code][code][youtube]AP-N_clkOdM[/youtube][/code]\n<br />\n<br />[b]Armor Protections[/b]\n<br />\n<br />Armor protection comes in two layers, called \"Deflect\" and \"Pierce\". They can be set for each armor category, for each damage type. \n<br />Deflect is analogous to a glancing hit, small dent, superficial cut, or magic dispersing before making it through.\n<br />Pierce is analogous to a shallow weapon penetration, significant dent, or magic that made it barely through.\n<br />\n<br />When you get attacked your protection is calculated like this:\n<br />[list=1][*]The game randomly chooses which area is getting hit, weighted according to the Hit Priorities in the MCM menu.\n<br />[*]The game rolls whether the attack gets deflected, pierces or ignores the armor of that area completely. \n<br />This roll is weighted according to the deflect and pierce chances of the relevant armor in the MCM menu. \n<br />[*]Depending on the result the damage will either be reduced by the deflect protection, the pierce protection, or not at all.\n<br />[/list]\n<br />\n<br />[b]Armor Attributes[/b]\n<br />\n<br />Each piece of armor that you wear will contribute to your attributes. \n<br />Depending on where you wear it the contribution may be smaller or bigger, according to the Attribute Contributions in the MCM menu.\n<br />So the chest piece will likely be more important than the helmet for example, for protection and attributes alike.\n<br />\n<br />\n<br />[b]Passive Block Mechanic[/b]\n<br />\n<br />Pretty simple: You only need to have a shield equipped and use it passively. \n<br />Just hold it in the direction of an enemy attack and with a bit of luck you will get a significant damage reduction.\n<br />Obviously this does not stack with active blocks and won't work in that case. But it does stack with everything else.\n<br />\n<br />\n<br />[b]Spell Protections[/b]\n<br />\n<br />The armor spells of the alteration tree can offer additional protections. \n<br />These are independent of the regular armor protections and reduce damage by a certain percentage based on your alteration skill level.\n<br />Due to the level scaling these protections are especially helpful for dedicated mages.\n<br />\n<br />\n<br />[b]Sound Effect Overlay[/b]\n<br />\n<br />Starting with version 2.3.4, True Armor can give players audible feedback on the effectiveness of their strikes and those of enemies. \n<br />This eliminates the need to closely watch the health bar at all times to judge your protections and those of the enemy.\n<br />Currently only the physical damage sources are supported and the volume can be freely adjusted by preference.\n<br />\n<br />Note that as the name suggests this feature is merely an overlay. It does not and can not eliminate the default sounds of your game.\n<br />Note also that the playback of those sounds can lag behind if you are experiencing script lag (even if it is just a momentary spike).\n<br />This nontheless generally works fairly well.\n<br />\n<br />\n<br />[b]Dynamic Health Limiter[/b]\n<br />\n<br />The health limiter enforces an effective health limit for NPCs by adjusting their resistances (works fine with buffs / debuffs).\n<br />In its simplest form the limit is calculated just by base health and health per level , as set in the MCM menu.\n<br />The endurance factor however can greatly enhance the limiters usefulness as it takes the estimated toughness of an actor into account.\n<br />This factor involves some mathematical magic and is dynamically computed based on size, mass, stamina and magicka of the NPC. \n<br />After the limit was set for the actor, it is then enforced with the specified strength or influence. \n<br />\n<br />Example (ignoring the more complicated endurance factor here): \n<br />MCM settings: Base Health = 80, Health per Level = 8, Limiter Strength = 75%\n<br />Bandit NPC with 600 health at level 10 will have a calculated limit of -&gt; 80 + ((10 - 1) * 8) = 152\n<br />That Limit will be enforced with 75% strength, so the Bandit will have -&gt; (0.25 * 600) + (0.75 * 152) = 264 effective health\n<br />\n<br />\n<br />[font=Georgia][size=5][color=#f6b26b]Setup Recommendations &amp; Advice[/color][/size][/font]\n<br />\n<br />[list][*] I highly recommend to use a balancing mod to increase the damage you deal and take. True Armor, if used as intended, will increase the tankyness of most enemies and yourself, in some cases very substantially. I think combat is already way too slow as is, so get yourself [url=https://www.nexusmods.com/skyrim/mods/89438/?]Simply Balanced[/url] or [url=https://www.nexusmods.com/skyrim/mods/33395]SkyTweak[/url] and bring the damage values up.\n<br />[*] I also recommend to rebalance the weapon types for the best experience. Daggers should deal only slightly less damage than swords, swords should deal the most base damage of all weapons as they are the most specialized and have hard counters, then axes and afterwards maces, which should have the lowest base damage in exchange for being pretty effective against almost everything. This gives the weapons a very distinct risk-reward structure and makes them all more viable.\n<br />[*] If you like the True Armor configuration you are currently using, but feel like some armors are over- or underperforming, or you think the attributes are not pronounced enough etc. use the Baseline Adjustments page! Here you can quickly tweak these things without changing the details.\n<br />[*] If you want to create your own True Armor configuration don't be too shy with pumping out higher protection numbers. 40% protection is almost nothing for example, it wouldn't even let you survive twice as long as without any protection at all. Remember that one percent of protection is worth much more at 90% than it is at 50%.\n<br />[*] For channeled magic the deflect and pierce chances are rolled just once and then apply for the whole duration. This is an unavoidable limitation and for that reason I recommend to set magic up as straight multipliers instead of chance based ones.\n<br />[/list]\n<br />\n<br />[font=Georgia][size=5][color=#f6b26b]Requirements[/color][/size][/font]\n<br />[size=3]Strictly required:\n<br />[list]\n<br />[*]Skyrim 1.9.32.0.8 +\n<br />[*][url=https://www.nexusmods.com/skyrim/mods/3863/?]SkyUI 5.1 +[/url]\n<br />[*][url=http://skse.silverlock.org/]SKSE 1.7.3 +[/url]\n<br />[/list]\n<br />Optional:\n<br />[list]\n<br />[*][url=https://www.nexusmods.com/skyrim/mods/48265/?]FISS 1.21 +[/url] (Required to load the presets and save or load custom settings, you really want that)\n<br />[*][url=https://www.nexusmods.com/skyrim/mods/89438/?]Simply Balanced[/url], [url=https://www.nexusmods.com/skyrim/mods/33395]SkyTweak[/url] or similar (Making fights quicker and more decisive)\n<br />[/list][/size]﻿\n<br />\n<br />[font=Georgia][size=5][color=#f6b26b]Compatibility[/color][/size][/font]\n<br />\n<br />True Armor is compatible with almost every other mod. However minor, reversible, soft incompatibilities can happen:\n<br />[list][*]Weapons swinging way too slow or fast. Happens when using mods that don't take others into account properly.\n<br />[*]Mods overwriting the game settings (speed penalty, stamina penalty, armor rating efficiency). Only one mod can control those at a time.\n<br />[*]Mods that somehow depend on the attributes of actors and have not taken other mods into account may be thrown off by True Armor.\n<br />[/list]\n<br />Usually modded armors can only be fully supported when they use the recognized, \"official\", Skyrim keywords. [url=https://www.nexusmods.com/skyrim/mods/19733]Immersive Armors[/url] is the only exception with built-in support despite not adhering to those, because it is so popular and I happen to use it myself.\n<br />\n<br />[font=Georgia][size=5][color=#f6b26b]Installation &amp; Uninstallation[/color][/size][/font]\n<br />\n<br />For installation I recommend ModOrganizer which is just a great tool. However you should have no trouble installing with NMM or manually if desired.\n<br />\n<br />[b]When Updating from a previous version:[/b]\n<br />\n<br />[list=1][*]Save your settings if you are using customs\n<br />[*]Disable all True Armor options on the General Settings page, or load the default blank state\n<br />[*]Wait a minute so that True Armor can clean up\n<br />[*]Save game, exit game, install new version (overwrite old version)\n<br />[*]Resume game, load your settings, done\n<br />[/list]\n<br />\n<br />[b]When uninstalling:[/b]\n<br />\n<br />Please do not remove True Armor from your game while it is active! \n<br />While that will not break your game, it will leave lingering scripts behind and will cause any attribute changes at the time of removal to become permanent. Instead follow the updating routine (and ideally create a seperate save), then when exiting the game, just remove the files.\n<br />[/size]",
  "categoryId": "77",
  "version": "2.4.6",
  "author": "Anubis22",
  "createdUnix": "1518443275",
  "updatedUnix": "1529017707",
  "containsAdultContent": false,
  "uploadedBy": "Anubis22",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000266161",
      "name": "True Armor",
      "version": "2.2.3",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "97",
      "fileName": "True Armor-89440-2-2-3.zip",
      "uploadedUnix": "1518369526",
      "modVersion": "2.2.3",
      "virusScanUrl": "https://www.virustotal.com/file/f203426fd7da513a8defad64001c39a26d22b51572d423be8ededcd37f7ade13/analysis/1518369799/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor-89440-2-2-3.zip?fid=1000266161&ttl=1535879143&ri=8192&rs=8192&setec=69a3e84339a3a1bcc7a6a14c19290aba"
    },
    {
      "fileId": "1000266258",
      "name": "True Armor",
      "version": "2.2.3",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "97",
      "fileName": "True Armor-89440-2-2-3.zip",
      "uploadedUnix": "1518461348",
      "modVersion": "2.2.3",
      "virusScanUrl": "https://www.virustotal.com/file/f203426fd7da513a8defad64001c39a26d22b51572d423be8ededcd37f7ade13/analysis/1518461403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor-89440-2-2-3.zip?fid=1000266258&ttl=1535879144&ri=8192&rs=8192&setec=03b0544f96f74b9f208301a43e854d44"
    },
    {
      "fileId": "1000266272",
      "name": "True Armor - FISS Setting files",
      "version": "2.2.3",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "9",
      "fileName": "True Armor - FISS Setting files-89440-2-2-3.zip",
      "uploadedUnix": "1518465504",
      "modVersion": "2.2.3",
      "virusScanUrl": "https://www.virustotal.com/file/266fb60c5a54ac5c4eff8fceb2543970bed5dd4ad0594418626e7ec1c3035f98/analysis/1518465722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%20FISS%20Setting%20files-89440-2-2-3.zip?fid=1000266272&ttl=1535879144&ri=8192&rs=8192&setec=3155e26d70e9ac90bb559527f04f4b6d"
    },
    {
      "fileId": "1000266285",
      "name": "True Armor",
      "version": "2.2.4",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "119",
      "fileName": "True Armor-89440-2-2-4.zip",
      "uploadedUnix": "1518472289",
      "modVersion": "2.2.4",
      "virusScanUrl": "https://www.virustotal.com/file/3a8313356139f08620560eaef99bafc92a9599a39e0edd30e855c01b524f90c3/analysis/1518472503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor-89440-2-2-4.zip?fid=1000266285&ttl=1535879144&ri=8192&rs=8192&setec=3f40633c73cb55af8921c0de79ce5da6"
    },
    {
      "fileId": "1000267925",
      "name": "True Armor - 2.2.5",
      "version": "2.2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "121",
      "fileName": "True Armor-89440-2-2-5.zip",
      "uploadedUnix": "1520465428",
      "modVersion": "2.2.5",
      "virusScanUrl": "https://www.virustotal.com/file/ede4b4672a57e276b0e472ef16fc8414ab95db8f018db60a1ee84c3fcccd0527/analysis/1520465703/",
      "changelogHtml": " Fixed the \"Speedy Followers\" bug, which caused followers attributes to escalate.\n<br />Added a logging function to True Armor for future debug purposes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor-89440-2-2-5.zip?fid=1000267925&ttl=1535879145&ri=8192&rs=8192&setec=f8f36c25eca79e4b00e4a2797c962872"
    },
    {
      "fileId": "1000268679",
      "name": "True Armor - 2.3.1",
      "version": "2.3.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2076",
      "fileName": "True Armor - 2.3.1-89440-2-3-1.zip",
      "uploadedUnix": "1521232113",
      "modVersion": "2.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/822adff52b206d218056d3f0c7281bc193a3bad3a7aae9bda538656346971969/analysis/1521549550/",
      "changelogHtml": " Major Update with many improvements, focusing on better usability.\n<br /><br />New features:\n<br />- A spell which shows the players current protections and attribute changes\n<br />- A spell which gives an overview of all the strengths and weaknesses of the different armors\n<br />- Added coverage settings for the different armors that can be set for each area (head, body, ...) individually. This can be used to account for gaps and weakspots in the armors and influences the chances to deflect or pierce hits directly.\n<br />- The MCM menu now comes with images of the affected armors so that users don't have to go online to look them up\n<br />- The armor pages now include indicators for the resulting average protections and to how much more effective health that translates\n<br />- DLC armors are now fully supported by their keywords, which means that custom armors with them will also be supported from now on\n<br />- There's now a toggle option to keep your general settings unchanged when loading a new configuration\n<br /><br />Other changes:\n<br />- Went over all the MCM info texts to make them a lot more helpful and informative\n<br />- Rebalanced the example settings\n<br />- The example settings are now called \"Balanced Settings\" and the default settings are now called \"Blank Settings\" to make way for more potential future presets\n<br />- Deflect and Pierce protections cannot be activated independently anymore, either both are active or none are\n<br />- Moved the activation toggles for the block protections to the general settings page to have it all in one place\n<br />- Changed the name of the custom setting files to make it more obvious and nicer to look at\n<br />- Dropped the official support of the german translation to use the extra time on improving the english version further\n<br /><br />- ! NOTE ! -\n<br />This update will break backwards compatibility of custom settings created with 2.2.5 and previous versions a bit!\n<br />How to fix / what's missing:\n<br /><br />1. You will need to rename the custom files from \"TA_Settings 1\" to \"TA Custom Settings 1\" and so on. The files are located in SKSE/Plugins/FISS of your Skyrim Data folder or of the overwrite folder if you are using ModOrganizer\n<br />2. Now you can load them again in True Armor\n<br />3. It will tell you that some entries are missing, just OK that\n<br />4. Fill in the changed and new settings that it couldn't find (Stagger Protections, Coverages, Apply X Protection to Player / NPCs)\n<br />5. Save the configuration with the filled in settings <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.3.1-89440-2-3-1.zip?fid=1000268679&ttl=1535879146&ri=8192&rs=8192&setec=22fb204350a95066686b53360902116f"
    },
    {
      "fileId": "1000268710",
      "name": "True Armor - 2.3.1",
      "version": "2.3.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2076",
      "fileName": "True Armor - 2.3.1-89440-2-3-1.zip",
      "uploadedUnix": "1521287171",
      "modVersion": "2.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/631954486f39b89176b45dc0cb123b8581afcc4a8ee5afb3d8bdb0687fe7e122/analysis/1521287230/",
      "changelogHtml": " Major Update with many improvements, focusing on better usability.\n<br /><br />New features:\n<br />- A spell which shows the players current protections and attribute changes\n<br />- A spell which gives an overview of all the strengths and weaknesses of the different armors\n<br />- Added coverage settings for the different armors that can be set for each area (head, body, ...) individually. This can be used to account for gaps and weakspots in the armors and influences the chances to deflect or pierce hits directly.\n<br />- The MCM menu now comes with images of the affected armors so that users don't have to go online to look them up\n<br />- The armor pages now include indicators for the resulting average protections and to how much more effective health that translates\n<br />- DLC armors are now fully supported by their keywords, which means that custom armors with them will also be supported from now on\n<br />- There's now a toggle option to keep your general settings unchanged when loading a new configuration\n<br /><br />Other changes:\n<br />- Went over all the MCM info texts to make them a lot more helpful and informative\n<br />- Rebalanced the example settings\n<br />- The example settings are now called \"Balanced Settings\" and the default settings are now called \"Blank Settings\" to make way for more potential future presets\n<br />- Deflect and Pierce protections cannot be activated independently anymore, either both are active or none are\n<br />- Moved the activation toggles for the block protections to the general settings page to have it all in one place\n<br />- Changed the name of the custom setting files to make it more obvious and nicer to look at\n<br />- Dropped the official support of the german translation to use the extra time on improving the english version further\n<br /><br />- ! NOTE ! -\n<br />This update will break backwards compatibility of custom settings created with 2.2.5 and previous versions a bit!\n<br />How to fix / what's missing:\n<br /><br />1. You will need to rename the custom files from \"TA_Settings 1\" to \"TA Custom Settings 1\" and so on. The files are located in SKSE/Plugins/FISS of your Skyrim Data folder or of the overwrite folder if you are using ModOrganizer\n<br />2. Now you can load them again in True Armor\n<br />3. It will tell you that some entries are missing, just OK that\n<br />4. Fill in the changed and new settings that it couldn't find (Stagger Protections, Coverages, Apply X Protection to Player / NPCs)\n<br />5. Save the configuration with the filled in settings <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.3.1-89440-2-3-1.zip?fid=1000268710&ttl=1535879147&ri=8192&rs=8192&setec=fccd950bc50cd68964dcee1bf5497c48"
    },
    {
      "fileId": "1000268723",
      "name": "True Armor 2.3.1",
      "version": "2.3.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2031",
      "fileName": "True Armor 2.3.1-89440-2-3-1.zip",
      "uploadedUnix": "1521306245",
      "modVersion": "2.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/e374ab83cdc365db31cf999904893e90ee0172354032b2289cba195a7bb08760/analysis/1521554480/",
      "changelogHtml": " Major Update with many improvements, focusing on better usability.\n<br /><br />New features:\n<br />- A spell which shows the players current protections and attribute changes\n<br />- A spell which gives an overview of all the strengths and weaknesses of the different armors\n<br />- Added coverage settings for the different armors that can be set for each area (head, body, ...) individually. This can be used to account for gaps and weakspots in the armors and influences the chances to deflect or pierce hits directly.\n<br />- The MCM menu now comes with images of the affected armors so that users don't have to go online to look them up\n<br />- The armor pages now include indicators for the resulting average protections and to how much more effective health that translates\n<br />- DLC armors are now fully supported by their keywords, which means that custom armors with them will also be supported from now on\n<br />- There's now a toggle option to keep your general settings unchanged when loading a new configuration\n<br /><br />Other changes:\n<br />- Went over all the MCM info texts to make them a lot more helpful and informative\n<br />- Rebalanced the example settings\n<br />- The example settings are now called \"Balanced Settings\" and the default settings are now called \"Blank Settings\" to make way for more potential future presets\n<br />- Deflect and Pierce protections cannot be activated independently anymore, either both are active or none are\n<br />- Moved the activation toggles for the block protections to the general settings page to have it all in one place\n<br />- Changed the name of the custom setting files to make it more obvious and nicer to look at\n<br />- Dropped the official support of the german translation to use the extra time on improving the english version further\n<br /><br />- ! NOTE ! -\n<br />This update will break backwards compatibility of custom settings created with 2.2.5 and previous versions a bit!\n<br />How to fix / what's missing:\n<br /><br />1. You will need to rename the custom files from \"TA_Settings 1\" to \"TA Custom Settings 1\" and so on. The files are located in SKSE/Plugins/FISS of your Skyrim Data folder or of the overwrite folder if you are using ModOrganizer\n<br />2. Now you can load them again in True Armor\n<br />3. It will tell you that some entries are missing, just OK that\n<br />4. Fill in the changed and new settings that it couldn't find (Stagger Protections, Coverages, Apply X Protection to Player / NPCs)\n<br />5. Save the configuration with the filled in settings <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%202.3.1-89440-2-3-1.zip?fid=1000268723&ttl=1535879147&ri=8192&rs=8192&setec=18e33aaa7fa64cb1e26d176791244b8c"
    },
    {
      "fileId": "1000268724",
      "name": "True Armor - 2.3.1",
      "version": "2.3.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2076",
      "fileName": "True Armor - 2.3.1-89440-2-3-1.zip",
      "uploadedUnix": "1521307142",
      "modVersion": "2.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/6f30bc7c3a00c80ad2bf22754bf6cc98f4bd66251467a6b688a9bb4c348f53a9/analysis/1521307209/",
      "changelogHtml": " Major Update with many improvements, focusing on better usability.\n<br /><br />New features:\n<br />- A spell which shows the players current protections and attribute changes\n<br />- A spell which gives an overview of all the strengths and weaknesses of the different armors\n<br />- Added coverage settings for the different armors that can be set for each area (head, body, ...) individually. This can be used to account for gaps and weakspots in the armors and influences the chances to deflect or pierce hits directly.\n<br />- The MCM menu now comes with images of the affected armors so that users don't have to go online to look them up\n<br />- The armor pages now include indicators for the resulting average protections and to how much more effective health that translates\n<br />- DLC armors are now fully supported by their keywords, which means that custom armors with them will also be supported from now on\n<br />- There's now a toggle option to keep your general settings unchanged when loading a new configuration\n<br /><br />Other changes:\n<br />- Went over all the MCM info texts to make them a lot more helpful and informative\n<br />- Rebalanced the example settings\n<br />- The example settings are now called \"Balanced Settings\" and the default settings are now called \"Blank Settings\" to make way for more potential future presets\n<br />- Deflect and Pierce protections cannot be activated independently anymore, either both are active or none are\n<br />- Moved the activation toggles for the block protections to the general settings page to have it all in one place\n<br />- Changed the name of the custom setting files to make it more obvious and nicer to look at\n<br />- Dropped the official support of the german translation to use the extra time on improving the english version further\n<br /><br />- ! NOTE ! -\n<br />This update will break backwards compatibility of custom settings created with 2.2.5 and previous versions a bit!\n<br />How to fix / what's missing:\n<br /><br />1. You will need to rename the custom files from \"TA_Settings 1\" to \"TA Custom Settings 1\" and so on. The files are located in SKSE/Plugins/FISS of your Skyrim Data folder or of the overwrite folder if you are using ModOrganizer\n<br />2. Now you can load them again in True Armor\n<br />3. It will tell you that some entries are missing, just OK that\n<br />4. Fill in the changed and new settings that it couldn't find (Stagger Protections, Coverages, Apply X Protection to Player / NPCs)\n<br />5. Save the configuration with the filled in settings <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.3.1-89440-2-3-1.zip?fid=1000268724&ttl=1535879148&ri=8192&rs=8192&setec=6aa1d7dc3ddcdcfad62c36242531e1e7"
    },
    {
      "fileId": "1000268725",
      "name": "True Armor - 2.3.2",
      "version": "2.3.2",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2076",
      "fileName": "True Armor - 2.3.2-89440-2-3-2.zip",
      "uploadedUnix": "1521308846",
      "modVersion": "2.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/afd79deddb1497c887b0190468384d03f11fff3fd8cda2b030efeff9d142eddf/analysis/1521554589/",
      "changelogHtml": " Apparently the nexus won't properly upload a new file unless it comes with it's own version number.\n<br />So here is the fix that makes 2.3.1 work without having to start a new game for it. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.3.2-89440-2-3-2.zip?fid=1000268725&ttl=1535879148&ri=8192&rs=8192&setec=609c7c533a79015207cb0b1026af27b5"
    },
    {
      "fileId": "1000268732",
      "name": "True Armor - 2.3.3",
      "version": "2.3.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2077",
      "fileName": "True Armor - 2.3.3-89440-2-3-3.zip",
      "uploadedUnix": "1521317936",
      "modVersion": "2.3.3",
      "virusScanUrl": "https://www.virustotal.com/file/0b233c572f1dd563fa311a4013c0f479d27edf866fd97a6dca53b0a8d3242cbe/analysis/1521555890/",
      "changelogHtml": " The logging functionality now stops itself when loading a game or exiting the game. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.3.3-89440-2-3-3.zip?fid=1000268732&ttl=1535879149&ri=8192&rs=8192&setec=2c931060877c860260e7874811f3edde"
    },
    {
      "fileId": "1000269602",
      "name": "True Armor - 2.3.4",
      "version": "2.3.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4834",
      "fileName": "True Armor - 2.3.4-89440-2-3-4.zip",
      "uploadedUnix": "1522362341",
      "modVersion": "2.3.4",
      "virusScanUrl": "https://www.virustotal.com/file/98e3b0054e143a74884634a11a6d5fcfe91326a657bc44fdcd3c8ae794dee46d/analysis/1522362440/",
      "changelogHtml": " This updates brings sound effects and a much better Health Limiter, in addition to some improvements behind the scenes.\n<br /><br />New features:\n<br />- Sound effect overlay. Striking an actor under the protection of True Armor will give audible feedback and tell you how effective the hit was. Only physical weapons are supported at the time, all of them bringing distinct sounds for deflects, pierces and full hits to the table.\n<br />- The Health Limiter can now dynamically compute the estimated endurance and toughness of an actor to adjust the limit accordingly. No more compromises needed, no more ridiculously weak bears, giants, mammoths and dragons. And even better: it works with any actor, official or custom.\n<br />- The Health Limiter can now also distinguish between enemy, neutral and allied NPCs, allowing you to set its strength independently for those.\n<br /><br />Other changes:\n<br />- Animals and creatures will not profit from the protections set in the Cloth category anymore\n<br />- Improper uninstalls of True Armor are now handled a bit better than before\n<br /><br />- ! NOTE ! -\n<br />Due to the new options in the MCM menu loading a settings file created with 2.3.3, or earlier versions of the mod, will complain that these options could not be found. This is normal. You will have to fill in the missing values by hand after loading. All of them are on the General Settings page: Audio Volume sliders and Health Limiter sliders. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.3.4-89440-2-3-4.zip?fid=1000269602&ttl=1535879150&ri=8192&rs=8192&setec=165db84621d9ee1f239d75fb08b010ec"
    },
    {
      "fileId": "1000270477",
      "name": "True Armor - 2.3.5",
      "version": "2.3.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4841",
      "fileName": "True Armor - 2.3.5-89440-2-3-5.zip",
      "uploadedUnix": "1523402323",
      "modVersion": "2.3.5",
      "virusScanUrl": "https://www.virustotal.com/file/8398c19c60924e1cc2d16cae0792184652856a21cf5d61baef358bba876f7e88/analysis/1523402480/",
      "changelogHtml": " 2.3.5 includes a fix for some magic based effects which would erroneously trigger sound effects, a much improved and more helpful logging system and some improvements behind the scenes.\n<br /><br />New features:\n<br />- Much improved logging system which delivers much more useful information in general and runs silently alongside normal gameplay. The verbosity and therefore detail of the log can be adjusted in the MCM menu.\n<br /><br />Other changes:\n<br />- Some magic based effects which would erroneously trigger sound effects will not do so anymore. This was simply achieved by disabling sound effects when they were not triggered by an actor. Meaning that actor based magic could potentially still trigger unwanted sound effects, though the vanilla spells seem to work fine as is.\n<br />- Included a second safeguard to ensure that actors will never have two True Armor scripts attached to them at the same time. Two simultaneous scripts on an actor could lead to highly exaggerated attributes and that was the cause of the \"Speedy Followers\" bug that had been fixed for the most part in 2.2.5 already, but seemed to be still possible in very rare cases. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.3.5-89440-2-3-5.zip?fid=1000270477&ttl=1535879151&ri=8192&rs=8192&setec=5f69971d0f761329931df0a8ef6d3632"
    },
    {
      "fileId": "1000274418",
      "name": "True Armor - 2.4.1",
      "version": "2.4.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4920",
      "fileName": "True Armor - 2.4.1-89440-2-4-1.zip",
      "uploadedUnix": "1528039932",
      "modVersion": "2.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/df3fa02b150ff750058bed75ac2f6f4a87507ba8a797f4b9aa588ed46370666c/analysis/1528040120/",
      "changelogHtml": " 2.4.1 is a major update with a wealth of new features and improvements.\n<br /><br />New features:\n<br />- Creatures can now be assigned True Armor protections (available under \"General Settings\")\n<br />- True Armor now supports tempered armors which can be set to be more effective than untempered ones (under \"General Settings\", affects only the player)\n<br />- True Armor now supports the One-Handed, Two-Handed and Archery skills, which can add an additional chance for the player to bypass an enemies armor based on the players skill level (under \"General Settings\", only for the player)\n<br />- Added two new alternative presets: \"Realistic\" and \"Fantasy\" (available under \"Save &amp; Load\")\n<br />- Added an alternative and simplified armor editor to enable much faster customization of armor protections (old editor is still available under \"Preferences\")\n<br />- Changed the MCM menu layout\n<br />- The \"Baseline Adjustments\" page is now much more straightforward to use\n<br />- The alteration armor spells (\"Ironflesh\", \"Oakflesh\" etc.) can now offer additional damage mitigation based on the casters alteration level (under \"Blocking &amp; Spells\")\n<br />- Players can now disable or enable the \"Examine Armor\" and \"Overview\" spells (available under \"Preferences\")\n<br />- The hit probabilities for head, body, arms and feet are now independent from the armor attribute contributions which can be set independently (under \"General Settings\")\n<br />- The \"Examine Armor\" spell now also shows the type of armor which you are wearing\n<br />- The users can now tell True Armor to scan additional armor slots to become compatible with armors in unusual slots (under \"Advanced Settings\")\n<br />- Armors can now nullify poison damage with a certain probability which can be set for each armor individually\n<br /><br />Other changes:\n<br />- The player character will now always be recognized as being of a playable race, regardless of actual race (fixes a bug where the player would not get recognized as such)\n<br />- Slightly increased script performance\n<br />- Sound effects should lag behind a little bit less (their lag cannot be eliminated completely though due to how they work)\n<br />- Sound effects are now a little bit more accurate (dwarven automatons won't play the \"fleshy\" sounds anymore)\n<br />- The armor pages now always contain two info fields at the very top indicating the affected armors and the current baseline efficiency for that armor type\n<br /><br />- ! NOTE ! -\n<br />Due to the new options in the MCM menu loading a settings file created with 2.3.5 or earlier will complain about missing values in the file. All of these missing values will be set to 0 and must be adjusted by hand afterwards. The missing values are mostly on the first few pages (\"General Settings\", \"Advanced Settings\", \"Baseline Adjustments\"), but there is also the new poison protection (for each armor type) and the new spell section (\"Blocking &amp; Spells\"). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.4.1-89440-2-4-1.zip?fid=1000274418&ttl=1535879151&ri=8192&rs=8192&setec=930e694cfae4d1988e14c26e985ba9e8"
    },
    {
      "fileId": "1000274803",
      "name": "True Armor - 2.4.2",
      "version": "2.4.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4920",
      "fileName": "True Armor - 2.4.2-89440-2-4-2.zip",
      "uploadedUnix": "1528492117",
      "modVersion": "2.4.2",
      "virusScanUrl": "https://www.virustotal.com/file/192d150666922d85cae7a500701b78749c9aeac9206a2474c0fda964a0199f79/analysis/1528492268/",
      "changelogHtml": " Very small update which fixes two minor oversights of 2.4.1.\n<br /><br />- Adjusted the fantasy preset so that the daedric armor no longer has 100% axe protection\n<br />- Fixed a bug which caused the displayed weapon damage to be off when looking into the inventory while spell protections are active <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.4.2-89440-2-4-2.zip?fid=1000274803&ttl=1535879152&ri=8192&rs=8192&setec=d001f62f124d3b8aeee119aaa663e80d"
    },
    {
      "fileId": "1000274804",
      "name": "True Armor - 2.4.3",
      "version": "2.4.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4920",
      "fileName": "True Armor . 2.4.3-89440-2-4-3.zip",
      "uploadedUnix": "1528495491",
      "modVersion": "2.4.3",
      "virusScanUrl": "https://www.virustotal.com/file/3ed748bbefa7f285f339c9ca23bdd1487b19edd510a06351ce99b3e9bfbb14aa/analysis/1528495652/",
      "changelogHtml": " Ridiculously small bugfix for 2.4.1\n<br /><br />- On the baseline settings page, the speed attribute options were displayed one row higher than intended. Fixed. :) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20.%202.4.3-89440-2-4-3.zip?fid=1000274804&ttl=1535879153&ri=8192&rs=8192&setec=8d42385e26946955ffa890133f00101a"
    },
    {
      "fileId": "1000275038",
      "name": "True Armor - 2.4.4",
      "version": "2.4.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4920",
      "fileName": "True Armor - 2.4.4-89440-2-4-4.zip",
      "uploadedUnix": "1528808703",
      "modVersion": "2.4.4",
      "virusScanUrl": "https://www.virustotal.com/file/754df3712b985b6861570c2fb4ae8fefbcf66eaa06c2fccb07e2330253467a48/analysis/1528808899/",
      "changelogHtml": " Fixes a bug which was causing frequent papyrus log warnings <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.4.4-89440-2-4-4.zip?fid=1000275038&ttl=1535879153&ri=8192&rs=8192&setec=eb3f4398f63313fc4cb6418196cbdce2"
    },
    {
      "fileId": "1000275258",
      "name": "True Armor - 2.4.5",
      "version": "2.4.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4920",
      "fileName": "True Armor - 2.4.5-89440-2-4-5.zip",
      "uploadedUnix": "1529004872",
      "modVersion": "2.4.5",
      "virusScanUrl": "https://www.virustotal.com/file/126a136b8653390d320edc5fb9197370dd07b0999536885f218ec7794474de42/analysis/1529005099/",
      "changelogHtml": " Fixes a bug which was causing the protections to be either 100% damage reduction or nothing at all.\n<br /><br />Other changes:\n<br />- The realistic preset was changed so that metal armors are not as susceptible to shock magic anymore, due to it acting essentially like a lightning arrester (offering the electric current an easier path than through the body). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.4.5-89440-2-4-5.zip?fid=1000275258&ttl=1535879154&ri=8192&rs=8192&setec=b110a3cc395c8e28af3d516e4268bece"
    },
    {
      "fileId": "1000275273",
      "name": "True Armor - 2.4.6",
      "version": "2.4.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4920",
      "fileName": "True Armor - 2.4.6-89440-2-4-6.zip",
      "uploadedUnix": "1529017707",
      "modVersion": "2.4.6",
      "virusScanUrl": "https://www.virustotal.com/file/bf6a1a6c0266e248da741ec09b258e1c23035d8e77fd34e180e3692fe2244cc8/analysis/1529020461/",
      "changelogHtml": " Fixes a bug which made it necessary to visit the MCM menu twice in order for the protections to update. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True%20Armor%20-%202.4.6-89440-2-4-6.zip?fid=1000275273&ttl=1535879154&ri=8192&rs=8192&setec=50984244e5fd9f21a44b32a7ad5386af"
    }
  ]
}