{
  "modId": 89538.0,
  "modName": "Domna and Rogen and Henrik and More",
  "summary": "More NPCs left unused now re-added....with their own purposes!!",
  "descriptionHtml": "A spiritual successor to my previous mod, College Guards and Saarthaal Miners and Terek, this mod aims to restore more NPCs left unused and also gives each one a purpose to exist. This mod touches NPCs not touched by the Cutting Room Floor, so please. Do not ask about that [size=1]i mean it.\n<br />\n<br />\n<br />[/size]Some NPCs in this mod have been re-purposed from their original purposes, such as Rogen and Thaer. They originally were meant to be carriage drivers, but since went unused and now have been re-purposed for this mod to be immersive.\n<br />\n<br />\n<br />[size=5][u][b]NPCs Re-added[/b][/u]:[/size]\n<br />\n<br />Domna Magia - An Imperial that was placed in the middle of Solitude but left disabled in the vanilla game. She wears strange attire, but seems to lead a pretty normal life within Solitude.... perhaps she is not all she seems...\n<br />   ﻿(Original purpose - Unknown)\n<br />\n<br />Henrik - The poor sacrifice of the Potema Binding Ritual.\n<br />   (Original purpose - To be a sacrifice in the Potem Binding Ritual)﻿\n<br />\n<br />Jolf - An unemployed sailor who now works at the Windhelm Docks, doing odd jobs.\n<br />   ﻿(Original purpose - Unknown)\n<br />\n<br />Drunk Cultist - A cultist in Morvunskar who had too much to drink as of late.... mayhaps she is too drunk to notice the difference between an intruder and one of her friends?\n<br />   ﻿(Original purpose - To be placed in Morvunskar during the quest. Was never enabled, however.)\n<br />\n<br />Castor the Puzzlemaker - An unfortunate dead bandit that can be found somewhere on Solstheim...\n<br />   ﻿(Original purpose - To be found dead somewhere on Solstheim)\n<br />\n<br />Rogen - A strange Nord who pops up in Solitude some time after the Hall of the Vigilants destruction... one would be wise to watch their steps around him.\n<br />   ﻿(Original purpose - To possibly be the Volkihar ferryman or Carriage driver)\n<br />\n<br />Makhel Abbas - An Orcish Hunter in the plains of Whiterun.\n<br />   ﻿(Original purpose - To be hunting animals during a certain Civil War quest that was never implemented)\n<br />\n<br />Athel Newberry - A private investigator that surveys the crashed ships around Skyrim's Northern Coasts.\n<br />   ﻿(Original purpose - A private investigator in service to Rune. I had no idea if he was ever planned on being added in the game, but I did this mainly as an honorable mention)\n<br />\n<br />Watchman - The poor thrall of the vampires who reside in the castle. He guards the main gate to Castle Volkihar.\n<br />   ﻿(Original purpose - To guard the main gate to Castle Volkihar. Bethesda removes him after Serana is brought back to the castle, I added a copy of him back. I don't know why he is disabled afterwards in vanilla but its stupid)\n<br />\n<br />Thaer - A simple Bosmer fisher in Riften, but will run off to become a Dawnguard Agent at the beginning of the Dawnguard DLC.\n<br />   ﻿(Original purpose - To be a replacement for the Nordic carriage driver, Thaer, in Solitude)",
  "categoryId": "33",
  "version": "1.1",
  "author": "kvatchcount",
  "createdUnix": "1522209109",
  "updatedUnix": "1522286134",
  "containsAdultContent": false,
  "uploadedBy": "kvatchcount",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000269477",
      "name": "Domna and Rogen and Henrik and More",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "498",
      "fileName": "Domna and Rogen and Henrik and More-89538-1-0.zip",
      "uploadedUnix": "1522208913",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c7ea92aceac3d36d9e40be719e4c01feca288179296d72756bd0f8b0eaaa8a28/analysis/1522209063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Domna%20and%20Rogen%20and%20Henrik%20and%20More-89538-1-0.zip?fid=1000269477&ttl=1535879317&ri=8192&rs=8192&setec=6797fc4a5af4d35528f9cdb4d0f97bfc"
    },
    {
      "fileId": "1000269551",
      "name": "Domna and Rogen and Henrik and More V1.1 - The Hotfix",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "498",
      "fileName": "Domna and Rogen and Henrik and More-89538-1-1.zip",
      "uploadedUnix": "1522286134",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c95a80a2b633550c0a4056b3fe83109dcabf13a65009ac3c5e1cd8f65cb05699/analysis/1522286224/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Domna%20and%20Rogen%20and%20Henrik%20and%20More-89538-1-1.zip?fid=1000269551&ttl=1535879317&ri=8192&rs=8192&setec=9e3314041c155b878e24af347865a5e9"
    }
  ]
}