{
  "modId": 89545.0,
  "modName": "Evolving Weapons",
  "summary": "This mod adds several weapons that can be evolved into stronger forms at a black smithing station. Find rare items and feed them to your weapons to unlock their true power!",
  "descriptionHtml": "This mod adds 37 weapons and 4 shields in total. 9 of which are the base forms.\n<br />\n<br />(5) Weapons from the list and quick summary\n<br />----------------------------------------------------------------\n<br />\n<br />The Death Axe\n<br />Eerie Ancient Axe/Eerily Cold Axe/Death Axe/Murderous Death Axe/Only Death Remains\n<br />Each stage of this axe has a hidden MURDER DAMAGE value that increases the damage dealt on humanoids. Aside from the bonus damage other effects and powers are added per level.\n<br />\n<br />The Orcish Combat Dagger\n<br />(Worn/Normal/Prime) Orcish Combat Dagger\n<br />This dagger has the chance to disarm your opponent.\n<br />\n<br />The Standard Greatsword\n<br />Odd Rusted Greatsword/Old Greatsword/Unnatural Greatsword/Soul Hungered Greatsword/Greatsword of Sovngarde\n<br />This greatsword increases speed and damage per level up and can be enchanted.\n<br />\n<br />The Time Bow\n<br />Bow of Time (Blink/Skip/Break/Shatter/Ravager)\n<br />As this bow progresses in levels it adds effects such as slow, knock back, and paralysis. A great support/control weapon.\n<br />\n<br />Divine Sword\n<br />Cerimonial Sword/Blessed Cerimonial Sword/Blessed Divine Sword/Divine Knight's Sword/Wrath of Aetherius\n<br />This weapon adds lightning damage as well as large amounts of extra damage to daedra, ghost, familiars, and such.\n<br />\n<br />The Warhammer\n<br />Rare Voidstone Warhammer/The Slayer/The Mighty Slayer/The Brutal Rage Slayer/The God Slayer\n<br />This weapon is arguable the strongest and slowest weapon. As it becomes stronger it affects larger creatures with SLAYER DAMAGE and other effects. Even dragons will crumble upon its final form.\n<br />-------------------\n<br />This mod also includes a Magic Damage Glass Greatsword, an imperial sword of extreme fire damage, a dangerous shield that can unleash a fire storm... but at a cost.\n<br />------------------\n<br />\n<br />WHAT YOU NEED TO LEVEL UP YOUR WEAPONS\n<br />Each weapon is different. You may need to collect human skull. You will need various soul gems perhaps. Whatever it is you need to upgrade your newly found weapon, you will need 3 perks.\n<br />1. Arcane Blacksmithing (This is a must for almost all weapons you wish to level up.)\n<br />2. Enchanter (Various levels of the perk will unlock more recipes available to you at a smithing station)\n<br />3. steel/glass/dwarven/etc. Smithing levels (Most weapons require that you possess the same level of smithing as the item you wish to level up)\n<br />\n<br />If all 3 Perk requirements are met for a weapon, its recipe will show up when crafting at a blacksmithing station.\n<br />\n<br />---------------------------------------------\n<br />IMPORTANT NOTE\n<br />Found within Riverhome near the smithing area you can find a strange hammer called \"The Will of Nirn\" and an Ingot called \"Etherealized Ingot\". 1 of each are required to form a BASE VERSION of any of the evolving weapons. Additionally 2 more hammers and 2 more ingots can be found hidden within the world of Skyrim. (Hints: Wealth and Markarth, Tales of an old wall, the oblivion crisis, and look to the sky.)\n<br />\n<br />All weapon base forms can be found hidden in the world.\n<br />\n<br />--------------------------------------------------- Future Updates In Mind\n<br />All weapon's can/will be Disenchant friendly. (For those of you who wish to transfer the magical effects onto a non vanilla weapon from another mod)\n<br />Craft-able staves possibly in the works. Leveled versions and branching tree of staff types to be created and upgraded.",
  "categoryId": "36",
  "version": "1.0",
  "author": "commandercoldz",
  "createdUnix": "1518306127",
  "updatedUnix": "1518306127",
  "containsAdultContent": false,
  "uploadedBy": "commandercoldz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000266095",
      "name": "Evolving Weapons",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Evolving Weapons-89545-1-0.zip",
      "uploadedUnix": "1518306089",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e799d300751d508ff6a46d47df31cd681c02c17b4f6cf79527c0ebd2410281b4/analysis/1518306423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Evolving%20Weapons-89545-1-0.zip?fid=1000266095&ttl=1535879327&ri=8192&rs=8192&setec=f5423f897ebf150e9a0bf19771da6a00"
    }
  ]
}