{
  "modId": 89541.0,
  "modName": "Almaera The World Awakens",
  "summary": "This is a total conversion mod initially build for my portfolio which was required as an entry for a game development education.<br /><br />This mod is a part of a series and is focused in one province. Though it contains fictional stories and objects, it is based on the ancient Greece.",
  "descriptionHtml": "[b][i]Almaera : A world awakens\n<br />\n<br />[b][i]- Intro -[/i][/b]\n<br />[i]Gods, they are in every culture. Spiritual beings of  incredible power beyond the comprehension of us mortals. Some evil and some righteous. Naturally, these gods are worshipped  by mortals. Gods don't act directly. Instead, they have champions. Heroes. These mortals that contain a pure heart, self-sacrificing and impregnable devotion of good will. These heroes gain power, but with power comes ignorance and that will eventually lead to a corrupted heart tainted by evil. Your story starts here and it's not to destiny what you will become. It is completely up to you..\n<br />[b]- End -[/b][/i]\n<br />\n<br />[/i][/b][i]The aim of this total conversion series is to build a world that entertains the mod user. The 'feel' of series is heavily influenced by the Roman age. This is a fictional mod and is [/i][b]not[/b][i] supposed  to be accurate in history.[/i]\n<br />\n<br />[i]\"Be who you want, and go do what you want\"  - Todd Howard\n<br />\n<br />[/i]These words are the leading thought of the creation. I aim for customization, meaning; You can go almost anywhere you want to go, you can create your own story,  and you can make your character unique by changing for example your equipment parts and colors to define your character.[i]\n<br />\n<br />[/i]This province is based on the Hellenic culture (Ancient Greece). Besides of customization I also try to make it immersive. Including more realistic combat, weather conditions, diseases, primary needs, etc. Your actions have literal consequences as you are capable of annihilating  entire cities. \n<br />\n<br />[b][i]- Main Story -\n<br />[/i][/b]The main story is about an ancient evil that has risen once again and has only one desire; to destroy all of the gods and recreate the world according to it's own will. Your choice is absolute and you can either help the evil for it's desire or help humanity and gods alike. [b][i][No more spoilers].\n<br />\n<br />- Features -\n<br />\n<br />[/i] Overhauled equipment crafting system:[/b] You have three separate equipment crafting skills (blacksmithing, clothing and woodworking) It has been more complicated than it originally was, but it has been recreated to be more immersive and realistic. Each craft has a separate station and equipment can be tempered with materials, dyed and partially changed with a list of additional components to create your unique look.\n<br />\n<br />[b]Alternative crafting skills: [/b]This includes cooking, enchanting and alchemy. Alchemy harvesting is more realistic since you are capable of harvesting more than one thing at a time. You'll need a vial filled with clear water before you are able to mix potions or poisons. Enchanting was primarily done with soul gems, now instead of that I have implemented runic tablets that are required. Learn the definition of the runes, craft the runic tablet and enchant your gear! Cooking can be an undervalued skill, but it primarily keeps you from starving. It also has some neat little bonuses such as boosting attributes.\n<br />\n<br />[i]Slayer skill:[/i]  In this world you will find a lot of uniquely and especially annoying monsters and wildlife. Some of them can't be normally slain unless you gain the necessary knowledge and equipment to do so or you will need it to protect yourself from them.\n<br />\n<br />[i]Combat: [/i][i]Make it as hard as you want, from in depth to hack and slash[/i]. Lock with swords, a duel between two concentration spells (such as flames and sparks locking), smash someone's shield out of the way, kick your opponent to make an opening and use your abilities and knowledge to gain the upper hand if hacking and slashing isn't enough. Grapple on and climb to their weak spots and deal massive damage. Grapple hold someone to use them as a meat shield. With new combat animations it surely will be what it is supposed to be; Amazing every time. \n<br />\n<br />[i]Exploring:  [/i]Exploring is fun. Finding new places on your map and see what they have to offer. Now I've gone into detail and added climbing as well as crawling. You have to be aware of the area since, nature isn't always pleased with your curiosity. Be well prepared - weather conditions can be a cause to your death.\n<br />\n<br />[i]Job system:[/i]\n<br />Define your character through your job. Be who you want to be. Some aren't really jobs, but you joined a certain group which can be considered as getting a job. Available jobs down below. Besides this you also have a billboard in cities that gives random jobs from inhabitants.\n<br />\n<br />[i]Mercenary, Bandit,[/i] [i]Guard[/i], [b][i]Page, artisan, storekeeper, innkeeper, cook, courier, enchanter, writer, farmer, hunter, woodcutter, miner, soldier, builder, sailor, bounty hunter, counselor, thief, assassin, etc\n<br />\n<br />[/i][/b][i]These are some of the more important changes, but they're not the only one. Be prepared for a [b]VERY LARGE[/b] file. Almost all models are new as well as textures etc. \n<br />\n<br />[/i][i]- Disclaimer -\n<br />[/i][b]By downloading this mod you agree that I am not responsible for any corruption and/or possible damage to your files of The Elder Scrolls V : Skyrim. If experiencing any problem whatsoever be sure to [/b][u]DISABLE EVERY OTHER MOD. [/u][b] If, by any chance, the problem still occurs please write in detail what the problem is and where it occurred. I do not work on this modification every time and will result in massive delay. Either be patient or search for something else.[/b]",
  "categoryId": "30",
  "version": "1.0",
  "author": "YJP",
  "createdUnix": "1518297552",
  "updatedUnix": "1518297552",
  "containsAdultContent": true,
  "uploadedBy": "YpjLaPi",
  "primaryFile": null,
  "files": []
}