{
  "modId": 89570.0,
  "modName": "Parry King - Chaos Dagger and Hornet Ring",
  "summary": "This mod adds a Chaos Dagger and Hornet Ring, based on dealing high critical damage in Dark Souls III.",
  "descriptionHtml": "This mod adds a Chaos Dagger and Hornet Ring, based on dealing high critical damage in Dark Souls III.\n<br />\n<br />The items are very simple: The Chaos Dagger is an iron dagger with higher base damage and a fire enchantment (Not the Chaos enchantment added by the Dragonborn DLC, because the Dark Souls III chaos dagger does fire damage, not ice, fire and shock damage), and the Hornet Ring is a ring that doubles critical attacks with one-handed weapons, using the same enchantment as the Dark Brotherhood gloves.\n<br />\n<br />The two items can be found mere meters away from the Treasure Map IV location, on a cliff south of Pelagia Farm, on the corpse of a casul R1 Spammer. The Chaos Dagger is stuck in the poor man's chest, presumably after his dark sword got parried, and the Hornet Ring is in his knapsack next to him. He unfortunately never got the use the hornet ring. He also has a copy of a book which, looking at his situation, he did not get the time to read before his early death.\n<br />\n<br />Grab this dagger and the mighty Hornet Ring, and one-shot casuls until your wrists get tired.\n<br />\n<br />\n<br />This is my first mod I release on the nexus, so please excuse the lack of content, and the absence of an Original model for the dagger.",
  "categoryId": "55",
  "version": "1",
  "author": "Ghostfield13",
  "createdUnix": "1518383878",
  "updatedUnix": "1518383878",
  "containsAdultContent": false,
  "uploadedBy": "ghostfield13",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000266180",
      "name": "Parry King - Chaos Dagger and Hornet Ring",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Parry King - Chaos Dagger and Hornet Ring-89570-1.zip",
      "uploadedUnix": "1518383647",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0530ca778aa5b0c002f3af30beda82260118bd6bca0d76105f82e99c69fdface/analysis/1518384002/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Parry%20King%20-%20Chaos%20Dagger%20and%20Hornet%20Ring-89570-1.zip?fid=1000266180&ttl=1535879370&ri=8192&rs=8192&setec=db6814f0399b18332443e463f9503e87"
    }
  ]
}