{
  "modId": 89611.0,
  "modName": "Legend Class",
  "summary": "Make the player the ability to chose what type of character it will play via Standing Stones or in future updates via Books.Instead of the \"I am a archerwarriormagepriestthief Dragonborn\" you can play and gain the real benefit to be a Warrior, Thief or Mage,.I will update and add more class eventually to the game.",
  "descriptionHtml": "Legend Class first come to changes some game mechanics that i think it will be more fun to add.Eventualy i whas think is better make those changes specific to some Class sistem,  so i decide to create those class sistem requeriment and come with the three basic:\n<br />1-THE WARRIOR: -By utilize the standing stone of the warrior you can obtain avantage of the TwoHanded Skill  (Increase TwoHand Skill growup double fast) and the weapon of all warriors Axes.[b]CANT USE ANY TYPE OF MAGIC.[/b]\n<br />2-THE THIEF: -Hive you the ability to steal more frecuently, increase Pickpocket growup double fast.Hive the player abilities to gain stamina and run a lot easier.[b]CANT USE ANY TYPE OF MAGIC.[/b]\n<br />3-THE MAGE: - Grant doublehand destruction spell usage even if you dont have that perk, destruction spell cost lest and when you increase you Mage Rank you can obtain some usefull and colorfull spells, also the most OP class still for more fun for me, i will nerf it in the next update.[b]CAN ONLY USE DESTRUCTION MAGIC.[/b]\n<br />[i][b]\n<br />----WARNING-----[/b][/i]\n<br />-If you are a Warrior or a Thief, you will [b]NOT allow to use ANY KIND OF MAGIC[/b], and if you are a Mage you can only use [b]DESTRUCTION[/b] MAGIC, these can be a game break instance for someones, but for me, is game dificult increase type of challenge like Revenge of the Enemies mod but effects aply to the player.\n<br />\n<br />Those class increase whit  that specific skill tree in lv30,50,80 and 100, lets make a example here:\n<br />-I have a player that has lv18 TwoHand skill, when i use the Warrior standing stone it will hive me Warrior Class rank that have some pasives skills.\n<br />-I have a player that has lv31 TwoHand skill, when i use the Warrior standing stone it will hive me Berserker Warrior Class rank hive some abilities.\n<br />-﻿I have a player that has lv51 TwoHand skill, when i use the Warrior standing stone it will hive me Brave Warrior Class rank that hivegreat pasive and better skills.\n<br />\n<br />\n<br />Also i introduce some prototipe class\n<br />\n<br />4-The Emperor (Nicromant).Can only use resurrection spell.\n<br />5-The Priest (Healer).Can only use restoration spell.",
  "categoryId": "24",
  "version": "0.5",
  "author": "ekaiser",
  "createdUnix": "1518569051",
  "updatedUnix": "1518569051",
  "containsAdultContent": false,
  "uploadedBy": "ekaiser",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000266375",
      "name": "Legend Class",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "105945",
      "fileName": "Legend Class-89611-0-5.zip",
      "uploadedUnix": "1518568950",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/2932662c38a3a3c09c0b116537a8a1e91f3adbcc19b101a944961ee181029dfd/analysis/1518569233/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legend%20Class-89611-0-5.zip?fid=1000266375&ttl=1535879419&ri=8192&rs=8192&setec=b2e0eb1ff7dc9f1ea9136380b65ee049"
    }
  ]
}