{
  "modId": 89705.0,
  "modName": "Transformation System",
  "summary": "This is a stand alone system of werewolf and vampire lord, and also a powerful system for modders to easily create more transformation which may include dragonman, werecat and so on. This system provide a level system, a limit system that allow werewolf to open menus but limit what it can equip , and a arrangement system to transform your friends.",
  "descriptionHtml": "[size=3]   ﻿I am a Chinese and I think I have to apologize for my poor English. I'd like to make a video but it's hard for me to upload a video to youtube.\n<br />[/size]   ﻿\n<br />[b][u][size=4]Credit: I Used a model of werewolf(The werewolf [b][u][size=4]King[/size][/u][/b]) made by  [url=https://www.nexusmods.com/skyrim/users/3322711]Grohiik[/url]  to make a werewolf armor for I don't know how to make a model. Here I thanks for his wonderful work.\n<br />[/size][/u][/b]\n<br />\n<br />\n<br />   ﻿[size=5]It is hard for me to post gif files here, so I post it in another website:\n<br />   ﻿http://9damao.com/thread-90244-1-1.html\n<br />   ﻿if you want to have a fast review of this mod, you should look at this. It is a Chinese website however, I have write English explain, you will just need to read what is English inside. \n<br />[/size]\n<br />[size=3]   ﻿Do you want to transform you followers into werewolf or vampire lord? Fed with the rough level up of werewolf and vampire lord? Or you just wonder why you can't operate a switch to open a gate, plunder from a corpse, or even equip something like a real werewolf or vampire lord when you transform into a werewolf/vampire lord? Now these problems are all gone!\n<br />\n<br />   Are you a modder? ﻿Do you want to create a interesting race to transform besides werewolf and vampire lord but find it hard to make all this work? Now you can![/size]\n<br />\n<br />[size=4][b]What is this mod [b]exactly[/b]?[/b][/size]\n<br />   ﻿[size=3]This mod is a system, and also attached by a stand alone Werewolf and Vampire lord transform. This system can help you with making a new transformation. And if you are just a player, enjoy the new werewolf and vampire lord.\n<br />[/size]\n<br />   [size=3]﻿This system has these features:\n<br />[/size]\n<br />   [size=3]1.﻿ Accessible: you will just need a few work to make a new transformation. And just load the esp you can add it into the system, no compatibility problems if you load multiple transformation esps. I have make mass of spells for you.You just need to drag it into the list and set up your mod. Of cause it should be the best if you write new exciting spells for it.\n<br />[/size]\n<br />   ﻿[size=3]2. A Level system: You can set 20 types of skills for a transformation race. and every type of skill has up to 10 levels. Werewolf and vampire lord in this mod have only 10 type of that but I feel it is enough. The structure of these skill look like a Tree, So I call the record of the level \"Tree\".(Someone said it should look like a comb, but I think that a tree can be more active, I like it.)\n<br />[/size]\n<br />   [size=3]﻿3. A Limit system: Now werewolves and vampire lords can open all menu, activate furniture and switch. And still more about it. I add a limit system to make sure that werewolf and vampire lord can not equip what they should not. I have kept werewolf from any shout, spell and armor except two spell and two armor exclusive to werewolf. I didn't set a limit of spell for vampire lord but it can't use shout and armor except a ring and a necklace. You can also set a limit like this in your own transformation mods.\n<br />[/size]\n<br />   [size=3]﻿4. A arrangement system: How to arrange all these \"Tree\" and skills for player and follower? In this system you should register the actor to save his information, you have 20 slot to do this. I don't think you need more, if they transform all together, I don't think your game can get rid of CTD. And then I want all the actor can share the transformation but it can serve only one person at the same time. So I found a name \"Totem\" from Skyrim. All the transformation and its skill will go with the Totem. You can have up to 98 Totem and if you assign it to a actor, he can get the power of transformation. You can Transform him by using a very spell, or just use hotkey to transform all actor who have a totem with them. You will randomly find a werewolf or vampire lord when you fight will wolfs or vampire, kill them and claim its totem(In form of scroll, cast it and it will show in MCM Menu). You can also make exclusive armor and spell from Totem(scroll), or just destroy it to get skill points to level up your other totem. Also, if you make a new transformation, you should set a totem for it as well.You can design it just like the werewolf in my system or use other interesting way to get one.[/size]\n<br />\n<br />[size=4][b]Are you a modder?[/b][/size]\n<br />   [size=3]I will give a document about how to make a new Transformation Race and get it into this system. But I have some busy days recently. Maybe a Template esp will come out first.\n<br />[/size]\n<br />[b][size=4]Are you just a player?[/size][/b]\n<br />   [size=3]It's still a wonderful mod if you just play what I offer. Powerful werewolf and vampire lord will give you another adventure and improve your transformation step by step. And here comes a more colorful life as a werewolf or vampire lord. I hop your like it.\n<br />\n<br />[/size][b][size=4]How to play?[/size][/b]\n<br />   [size=3]﻿1.[/size][size=3]You need to find werewolf and vampire lord in wild. They will appear randomly when you fight with wolves and vampire. Kill them and you will get a Totem(Scroll). The more powerful the enemy are the higher level of totem you will get(level 1-4). Then cast it you will find a record in the MCM page \"Totem List\". You can see the race and skills of this Totem, and click the skill will open a level up menu.\n<br />\n<br />   ﻿2.Register the actor you want to transform in page \"Actor Records\", MCM will find 3 actor around you, and also accept crosshair target and console target.\n<br />\n<br />   ﻿3.Assign Totems to the actors. This can be done in page \"Actor Records\" and \"Totem List\". After assigning, the actor who have a totem can be transformed. Cast spell \"Transform NPC\" to transform a actor if he is not player, while \"Transform Player\" will transform yourself. You can save current assignment to a hotkey then just press the key you can assign fast. You will want to transform all actors with totem, set hotkey \"Transform all\" will help you.\n<br />\n<br />   ﻿4.Skill points and exclusive equipment: You will fight more werewolf and vampire lord, then have many totems. The totem in form of scroll can be use as material to craft exclusive spell tomes and equipment. The Totem in MCM records can be destroy in page \"Totem List\" and gain skill points the number you will get will depend on the skill level of the totem, and also some random case, you might get many sometime or get nothing unfortunately.Spell 0-9 call Spell A, while 10-19 call Spell B. They use difference skill points. Skill Points B is hard to get, but skill B can be powerful use it wisely. You can level up skills by click them in  page \"Totem List\" or \"Actor Records\" if the actor have totem with him. The menu opened with all skill you can level up to, click what you want to level up, of cause need skill points.\n<br />   ﻿\n<br />   ﻿5.Overview: You can get transformation even you don't finish the quest, but in return, the transformation will not be strong now. you will fight and slowly grow stronger. When your werewolf develop skill 10 to level 3, you can absorb health from you attack. A high level vampire lord can have a destruction spell power up to 3 times, and the blood ball will be a powerful skill in combat. And you can craft armor for you werewolf and vampire lord. Activate furniture and menu, talk to other,  just everything you can do like when you are a human, except using shout and armor.[/size]\n<br />[size=4][b]\n<br />[/b][/size][size=4][b]Requirement\n<br />[/b][/size][size=3]   ﻿3 DLC and update.esm\n<br />   [url=https://www.nexusmods.com/skyrim/mods/58705]﻿PapyrusUtil.[/url]\n<br />   ﻿[/size]\n<br />[size=4][b]Compatibility[/b]\n<br />   ﻿[/size][size=3]This mod work well with most mods that about werewolf and vampire lord. It stand alone and the appearance of werewolf and vampire lord in this system will be the same as that of your game(beautify mods will also change the appearance in this mod ). However, if you use a vampire lord beautify mod with headgem, you will find it lost its head. You should use file whoes name is end with ﻿\"VLHeadgem\" instead.\n<br />\n<br />[/size][size=4][b]Known issues[/b][/size]\n<br />   [size=3]1.﻿The script have been optimized, and will not result in FPS decrease. However, transform will be applied by change race of the actor, which means loading of the models and textures. If you have a large models and textures for naked female actor, it might be a pause because the system are busy loading models and textures. If you use \"Transform All Hotkey\" to transform many actor at the same time, the game might get in to CTD. How many persons you can transform at the same time is up to your computer, the textures and models engage in and also physic effect on the model. If you want to enlarge the number you can transform at the same time, try to decrease the size of texture. you can also transform the actors one by one in order to avoid CTD of cause.\n<br />\n<br />   ﻿2.Don't register a actor when he is not in his initial race. And what's more, you should register yourself again if you become a vampire or turn back to human. It's because register will record the race the actor are and once he transform back, he will transform into it. If you have any problem with the race, run console and click the actor, then type setrace XXXXXXX(XXXX is the name of race).\n<br />\n<br />   ﻿3.Don't level up, destroy or assign the totem he own when the actor are transformed. Assign the totem back and transform again will help solving this problem.[/size]\n<br />\n<br />[b][size=4]P[/size][/b][b][size=4]ermission\n<br />   ﻿[/size][/b][size=3]I hope ﻿this mod will become a mature system, but for now I have to admit that you need to be careful when operate on totems after you transform, Or you will get into some bugs( Not dangerous and You can fix it in game easily). This problem may be somehow annoying, but I can't solve it in a simple way( I don't want this mod in heavy script).\n<br />\n<br />   ﻿I am pleasure to see someone to use it or have a change in it, no permission needed, just credit me as the original author in your mod. I have post my source code, if you need it.\n<br />\n<br />   ﻿[b]But still a notice: [/b][b]I Used a model of werewolf(The werewolf King) made by  [url=https://www.nexusmods.com/skyrim/users/3322711]Grohiik[/url]﻿  to make a werewolf armor for I don't know how to make a model. You will have to ask for permission from [b][url=https://www.nexusmods.com/skyrim/users/3322711]Grohiik[/url]﻿ for this model if your mod will contain it.[/b][/b][/size]",
  "categoryId": "39",
  "version": "1.0",
  "author": "Indigo Mad",
  "createdUnix": "1519068582",
  "updatedUnix": "1519149852",
  "containsAdultContent": false,
  "uploadedBy": "IndigoMad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000266735",
      "name": "Transformation 1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18745",
      "fileName": "Transformation 1.0-89705-1-0.zip",
      "uploadedUnix": "1519068387",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f431420f68bd5052efe57ae12b1dfe0727989677b0368dda590a6be9004b273f/analysis/1519068801/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Transformation%201.0-89705-1-0.zip?fid=1000266735&ttl=1535879557&ri=8192&rs=8192&setec=013833c609098b936190e2296dbecb57"
    },
    {
      "fileId": "1000266736",
      "name": "Source",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "20",
      "fileName": "Source-89705-1-0.zip",
      "uploadedUnix": "1519068511",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6289b1c00a5fb971baa6682ef7d735a9a5172091f6e2dfcc56d4531f2e5448f3/analysis/1519068782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Source-89705-1-0.zip?fid=1000266736&ttl=1535879557&ri=8192&rs=8192&setec=ec72443a8224104acee921d3ae958a4f"
    },
    {
      "fileId": "1000266767",
      "name": "Transformation-CN",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "18501",
      "fileName": "Transformation-CN-89705-1-0.rar",
      "uploadedUnix": "1519120143",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/75040a4e58cf2f7e5ec3feeb72a3e38fb257672b87cee46637f81858ee1b1f00/analysis/1519120447/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Transformation-CN-89705-1-0.rar?fid=1000266767&ttl=1535879558&ri=8192&rs=8192&setec=69d77b320be4805a965b99bf225eab73"
    },
    {
      "fileId": "1000266788",
      "name": "Transformation-CN",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18502",
      "fileName": "Transformation-CN-89705-1-0.rar",
      "uploadedUnix": "1519141666",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b70d643c279ad93f5630bd0943496a82cab0e54b44891f15c658036b83774c25/analysis/1520077291/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Transformation-CN-89705-1-0.rar?fid=1000266788&ttl=1535879558&ri=8192&rs=8192&setec=c1c264d9b6ab2ba9821827ad75d8c74e"
    },
    {
      "fileId": "1000266796",
      "name": "Transformation  VLHeadgem",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18501",
      "fileName": "Transformation  VLHeadgem-89705-1-0.rar",
      "uploadedUnix": "1519149455",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b38b01fe6f7ef8619360d9c6505350710f4f1fb507f7656ab890278fc1ab7c00/analysis/1519149728/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Transformation%20%20VLHeadgem-89705-1-0.rar?fid=1000266796&ttl=1535879559&ri=8192&rs=8192&setec=77d5e923941e479da3e15e4d8a0a7b7b"
    },
    {
      "fileId": "1000266797",
      "name": "Transformation VLHeadgem-CN",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18502",
      "fileName": "Transformation VLHeadgem-CN-89705-1-0.rar",
      "uploadedUnix": "1519149852",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/773ab9ae52c4065207e80e9c857c141d85c7332b6d9ef14056144e8690df9099/analysis/1519150093/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Transformation%20VLHeadgem-CN-89705-1-0.rar?fid=1000266797&ttl=1535879559&ri=8192&rs=8192&setec=90bf0ae2d78df9778a049b687cf93a06"
    }
  ]
}