{
  "modId": 89717.0,
  "modName": "Scribe Mod",
  "summary": "A mod that adds a custom, portable crafting system for all vanilla scrolls. For artificers and vancian mages of all sorts.",
  "descriptionHtml": "[b][u][img]https://i.imgur.com/WYluPlf.png[/img]\n<br />\n<br />Goals[/u][/b]\n<br />Originally, scrolls were a cheap way to get a few points of extra damage or a few septims here and there. A long time ago, this bothered me and I made a scribe mod. However, the original mod was a mess with cluttered build paths and no real direction. I left the modding scene for a long time but now I'm happy to publish the beta of the first mod I've ever made.\n<br />\n<br />The Scribe Mod is simple, add a custom crafting system to create or inscribe all of the existing vanilla scrolls. I have also buffed the original scrolls so now they are actually useful rather than simply being septim-fodder. \n<br />\n<br />[b][u]How-to-Use[/u][/b]\n<br />In order to create the new tools, you'll need to visit a trader and get an ink well and quills. Parchment can be made the traditional way, stretching leather to a paper-thin consistency. The kits can be crafted at a tanning rack and can be activated from your inventory. Perfect for upgrading a miscellaneous scroll on the go. Ink is created through the Inking Set, scrolls are crafted through the Scribe's Kit. The rest is up to your creativity. There is an ink branch per school of magic, resources should not be too hard to acquire as they are single-use spells.\n<br />\n<br />[u][b]For The Future[/b][/u]\n<br />If possible I would like to add custom scrolls or such either on my own or if other magic-mod-creators would let me utilize their work.\n<br />\n<br />[b][u]Compatibility[/u][/b]\n<br />As this mod only adjusts vanilla scrolls and values it should be compatible with everything, especially works well with other portable/roaming-style mods. \n<br />This mod only requires the base game as there were no new scrolls added to any of the expansions.\n<br />\n<br />[u][b]Special Thanks\n<br />[/b][/u]Special Thanks to [url=https://www.nexusmods.com/skyrim/users/22879244]VolnuttFallout[/url] for the custom logo!",
  "categoryId": "98",
  "version": "0.90",
  "author": "YellowJacketXV",
  "createdUnix": "1519101816",
  "updatedUnix": "1519101816",
  "containsAdultContent": false,
  "uploadedBy": "YellowJacketXV",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000266764",
      "name": "Scribe Mod",
      "version": "v0.90",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "109",
      "fileName": "Scribe Mod-89717-v0-90.zip",
      "uploadedUnix": "1519101733",
      "modVersion": "v0.90",
      "virusScanUrl": "https://www.virustotal.com/file/05e273467ea72a255f51c22912d194be81d261e43a03709f546d3df69a90eadb/analysis/1519102022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scribe%20Mod-89717-v0-90.zip?fid=1000266764&ttl=1535879573&ri=8192&rs=8192&setec=c753dcd54c1d8522b112fd916c73b173"
    }
  ]
}