{
  "modId": 8971.0,
  "modName": "Soul Forge Mystic Arena",
  "summary": "This mod allows you to store souls in a \\'ghost buster\\' like storage facility, then re-use that soul energy in different ways such as magic or summons. It is also possible to fight ghosts of captured enemies in the arena.",
  "descriptionHtml": "THIS IS NO LONGER BEING WORKED ON. Sorry but I just don\\'t have time for Skyrim these days.\r\n\r\nSoul Forge: Mystic Arena\r\n\r\n[color=#00ff00]OVERVIEW[/color]\r\n--------------\r\n\r\nThis mod is comprised of two major components, the [color=#0055ff]Soul Forge[/color] and the [color=#0055ff]Mystic Arena[/color].\r\n\r\n[b][color=#00ffff]NOTE[/color]: Version 3 and above requires Dawnguard.[/b]\r\n[b][color=#ff0000]NOTE[/color]: For existing users, upgrading to version 3.01.06 or above from version 3.01.04 or below requires a clean re-installation of this mod. See the Upgrading section below. Failure to do this as outlined will break the forge and probably your save game.[/b]\r\n\r\n[color=#0055ff]Soul Forge[/color]\r\n--------------\r\n\r\nThis Soul Forge adds a house which contains a \\'Soul Forge\\' : A series of spells & control objects that allows the player to store soul energy in a \\'ghost buster\\' like storage facility, then re-use that soul energy in different ways. This is suitable for use by any class of player, however it is primarily targeted at high level mages.\r\n\r\nIn the latest version the forge has been split up into multiple rooms. Although there are more functions now, the new design is rather bland and boring. But function is still more important than aesthetics so for now it remains as is. If I am inspired at a later date I will improve the visual aspects of the forge.\r\n\r\nThis mod is recommended for use with Master difficulty level or monster mods to increase difficulty. However extra spawns should be disabled when using the Arena, see below.\r\n\r\n[color=#00ff00]FEATURES[/color]\r\n--------------\r\n\r\n-[color=#00ffff][b]Teleport[/b][/color]: Able to teleport self or others to Soul Forge, as well as multi-summon others to yourself directly.\r\n-[color=#00ffff][b]Soul Capture[/b][/color]: Can use Soul Snare or Chain Snare to capture souls directly to the forge without soul gems\r\n-[color=#00ffff][b]Soul Gems[/b][/color]: Can store, extract and resize gems using the forge controls. Can store and extract Soul Energy into or from the forge using gems.\r\n-[color=#00ffff][b]Fortifications[/b][/color]: Can use Soul Energy to fortify or restore Health, Magicka and Stamina\r\n-[color=#00ffff][b]Summons[/b][/color]: Can perform multiple summons with no time limit. Includes Mystic ghosts and Dremora Mimic, a fully fledged Daedric follower.\r\n-[color=#00ffff][b]Resurrect[/b][/color]: Can resurrect corpses to living state permanently, or temporarily raise multiple corpses multiple times.\r\n-[color=#00ffff][b]Crafting[/b][/color]: House contains a full set of Crafting equipment for smelting, smithing and enchanting.\r\n-[color=#00ffff][b]Alchemy[/b][/color]: Includes 10 Alchemy pods containing all standard plant ingredients, as well as scripted potion transfers & upgrades. Pods must be unlocked.\r\n-[color=#00ffff][b]Recharging[/b][/color]: Can recharge/overcharge magical weapons directly from the forge, or using the Distil Corpse spell\r\n-[color=#00ffff][b]Dragon souls[/b][/color]: Can store and extract Dragon Souls into or from the Soul Forge\r\n-[color=#00ffff][b]Mannequins[/b][/color]: Contains 52 Bound Dremora to use as living mannequins.\r\n-[color=#00ffff][b]Spells[/b][/color]: Includes a series of Soul Energy powered spells covering all classes of magic (see below).\r\n-[color=#00ffff][b]Storage[/b][/color]: Includes individualized storage with scripted mass item transfers, including a \\\"store all\\\" button.\r\n-[color=#00ffff][b]Racks[/b][/color]: Contains custom weapon racks that store weapon or shield in a floating upright position. \r\n\r\n[color=#00ff00]INSTALLATION[/color]\r\n-------------------\r\n\r\n-Download and extract Soul Forge into your Skyrim\\\\Data folder, or use Nexus Mod Manager\r\n\r\n-NOTE: Users of Skyrim School of Witchcraft and Wizardry, please download the No Dungeon Exterior version. You will receive a Soul Forge (Dungeon) teleport spell either immediately or when you visit Whiterun. The no dungeon version will not be kept as up to date as the main version as maintaining a branch is time consuming. I will update the no dungeon version periodically after multiple updates to the main version.\r\n\r\n[color=#00ff00]OPTIONAL[/color]\r\n-------------------\r\n\r\nHearthfire users may download the optional \\\"Hearthfire Patch\\\" by Rylasasin. This adds a Hearthfire oven and ingredient sorting to the cooking area. Note I cannot provide support for this as I don\\'t even have Hearthfire.\r\n\r\n[color=#00ff00]UPGRADING[/color]\r\n---------------------------\r\n\r\nWhen upgrading to version 3.01.06 from any prior version, the following process must be observed:\r\n\r\n1) Load save game with old Soul Forge version\r\n2) Sell all Soul Forge items such as Soul Snare enchanted weapons and Soul Forge Spell Tomes. Attempting to keep these in existence will crash the game.\r\n3) Take all items out of the Soul Forge and store in another location.\r\n4) Disable all mannequins and disable all Soul Forge fortifications.\r\n5) Kill all Soul Forge summons. If used Daedra or Dremora Mimics, play the game for at least 30 real-time minutes for mimic script to self cleanup. \r\n6) Save the game and quit to desktop.\r\n7) Delete SoulForge.esp from Data/ and all Soul Forge scripts from Data/Scripts and Data/Scripts/Source, all scripts start with SoulForge_ prefix\r\n8) Load the game, save and exit.\r\n9) Install new version and enable SoulForgeMysticArena.esp\r\n10) Load game. Should now be safe to use the new version. May not be perfectly cleaned, last resort may require starting a new game.\r\n\r\nFailing to do this will result in breakage of the Soul Forge and some of it\\'s associated scripts, particularly to do with summoning.\r\n\r\n[color=#00ff00]GETTING STARTED[/color]\r\n---------------------------\r\n\r\n-To access the forge, fast travel to Hag Rock Redoubt. Immediately turn right and head up the hill. Follow the walkway.\r\n-Complete the very short, level 25-35 dungeon to access the Soul Forge. Once there, buy the Soul Forge (Teleport) spell from the Magic Merchant\r\n\r\n-No Dungeon Exterior version users can cast the Soul Forge (Dungeon) spell to access the dungeon.\r\n\r\n-Alterantively, just \\\"coc SoulForge\\\" and buy the Teleport spell immediately\r\n\r\n[color=#00ff00]SUMMONS[/color]\r\n--------------\r\n\r\nSummoned creatures gain levels, stats, skills and selected spells together with the player. All can be commanded to Follow, Wait or Guard. \r\n\r\n-[color=#00ffff][b]Undead [/b][/color]: Custom versions of Death Hound, Boneman, Keeper and Reaper. Attacks deal poison and disease effects. 10% stronger than player.\r\n-[color=#00ffff][b]Daedra [/b][/color]: Flame, Frost, Storm Thrall and Dremora Lord. Only has basic spells. Cannot heal self, but can be resurrected. 25% stronger than player.\r\n-[color=#00ffff][b]Mystic Warrior [/b][/color]: Flame, Frost and Shock melee ghosts. Uses a sword. Can heal self, but cannot be resurrected. 50% stronger than player.\r\n-[color=#00ffff][b]Mystic Marksman [/b][/color]: Flame, Frost and Shock ranged ghosts. Uses a bow. Can heal self, but cannot be resurrected. 50% stronger than player.\r\n-[color=#00ffff][b]Mystic Mage [/b][/color]: Flame, Frost and Shock magic ghosts. Learns elemental spells. Can heal self, but cannot be resurrected. 50% stronger than player.\r\n-[color=#00ffff][b]Mimics [/b][/color]: Melee Mimic and Magic Mimic. Learns Flame, Frost, Shock and Conjuration spells. Can heal self and can be resurrected. 100% stronger than player.\r\n\r\nMystics and Mimics are spell-mimicking, meaning they won\\'t use any spells you don\\'t know yourself. If you are a warrior and want mage support, you will need to learn Flames/Frostbite/Sparks (which have Novice skill level) in order for the mages to be capable of magic.\r\n\r\n[color=#00ff00]SPELLS[/color]\r\n---------\r\n\r\nBelow is a list of all Soul Forge spells and a brief description. For details see SoulForgeReadme.txt\r\n\r\n-[color=#00ffff][b]Soul Forge (Teleport) [/b][/color]: Player teleport access to the Soul Forge. Vanilla & Marked follower transported automatically.\r\n-[color=#00ffff][b]Soul Link (Location 1/2)[/b][/color] : Establish up to 2 permanent two-way links from Soul Forge to Tamriel\r\n-[color=#00ffff][b]Soul Mark [/b][/color]: Mark a single target for summoning\r\n-[color=#00ffff][b]Soul Summon [/b][/color]: Summon a Marked target\r\n-[color=#00ffff][b]Multi-Mark [/b][/color]: Mark multiple targets for summoning. Separate from Soul Mark\r\n-[color=#00ffff][b]Multi-Summon [/b][/color]: Summon all multi-mark targets to self. Summons in front of player, in line of sight.\r\n-[color=#00ffff][b]Soul Cast [/b][/color]: Send targets directly to or from the Soul Forge.\r\n-[color=#00ffff][b]Soul Resurrect [/b][/color]: Resurrect any corpse to a permanent living state\r\n-[color=#00ffff][b]Soul Snare [/b][/color]: Snare souls directly into the forge without using gems\r\n-[color=#00ffff][b]Conjure Soul Eater [/b][/color]: Summon a magic wisp that automatically casts Soul Snare on enemies\r\n-[color=#00ffff][b]Chain Snare [/b][/color]: Chain casting version of Soul Snare\r\n-[color=#00ffff][b]Soul Rip 20/30/40/50 [/b][/color]: From 20 to 50% chance to insta-kill all currently Soul Trapped or Soul Snared enemies\r\n-[color=#00ffff][b]Forge Health/Magicka/Stamina (Remote) [/b][/color]: Remotely toggle the fortification beacons in Soul Forge. Manage fortifications in the field.\r\n-[color=#00ffff][b]Full Restore Health/Magicka/Stamina[/b][/color] : Fully restore Health, Magicka or Stamina\r\n-[color=#00ffff][b]Renerate Health/Magicka/Stamina[/b][/color] : Fortify Health, Magicka or Stamina regeneration rate by 100% for 5 minutes\r\n-[color=#00ffff][b]Sap Spirit 15/30/45 [/b][/color]: Weaken targets max Health, Magicka or Stamina and all skill stats by 15, 30 or 45% for 60 seconds\r\n-[color=#00ffff][b]Dragon Soul[/b][/color] : Instantly recharge Shout bar\r\n-[color=#00ffff][b]Immortal Soul [/b][/color]: Become immortal for 33 seconds\r\n-[color=#00ffff][b]Devils Charm [/b][/color]: Fortifies Speechcraft by 99 and allows selling any item to any vendor, including stolen goods.\r\n-[color=#00ffff][b]Divine Strike [/b][/color]: Greatly increase Critical Strike chance for 16 seconds. \r\n-[color=#00ffff][b]Spirit Bomb 1/2/3[/b][/color] : Deals non-elemental explosive damage. Type 2 and 3 include knockdown chance.\r\n-[color=#00ffff][b]Devour Corpse [/b][/color]: Devour a target corpse to heal self for 15% Health, Magicka and Stamina\r\n-[color=#00ffff][b]Distil Corpse[/b][/color] : Distil a corpse to recharge/overcharge equipped weapons. Charge amount dependent on target level.\r\n-[color=#00ffff][b]Transmute Corpse[/b][/color] : Transmute a corpse into an empty Soul Gem. The gem size is dependent on target level.\r\n-[color=#00ffff][b]Alchemize Corpse [/b][/color]: Alchemize a corpse to receive Gold and/or loot rewards. Reward dependent on target level.\r\n-[color=#00ffff][b]Imbibe Corpse [/b][/color]: Imbibe a target corpse to permanently raise HMS by a tiny amount each time (less than 1 point).\r\n-[color=#00ffff][b]Magic Arrow [/b][/color]: Infinite arrows for 15 minutes. Can use enhanced Steel, Dwarven, Glass, Ebony or Daedric arrows. Deals more damage than standard arrows.\r\n-[color=#00ffff][b]Third Eye[/b][/color] : Night eye and long range Detect Life for 30 minutes.\r\n-[color=#00ffff][b]Enslave Mind[/b][/color] : Between 10 to 50% chance to permanently alter living targets faction alliegance to player ally faction.\r\n-[color=#00ffff][b]Voodoo [/b][/color]: Resurrect multiple corpses multiple times. Resurrected targets are also mind enslaved.\r\n-[color=#00ffff][b]Vooodoo Hex[/b][/color] : Deal variable damage to living target. On death strike, automatically casts Voodoo on target. Target must be near death for this to succeed.\r\n-[color=#00ffff][b]Intervention [/b][/color]: Cast on living target for a single auto-resurrect if death occurs within 60 minutes.\r\n-[color=#00ffff][b]God Step 33/66/99[/b][/color] : Fortify speed by 33, 66 or 99% for 30 minutes.\r\n-[color=#00ffff][b]Holy Diver [/b][/color]: Water breathing for 30 minutes.\r\n-[color=#00ffff][b]Sentinel Flame/Frost/Shock/Target [/b][/color]: Summon from 1 to 3 elemental sentinels for 10 minutes. Cast Target and sentinels will attack using elemental magic.\r\n-[color=#00ffff][b]Doom [/b][/color]: Guaranteed insta-kill on any target if the target still lives 66 seconds after spell impact. Extremely expensive spell with long charge time.\r\n-[color=#00ffff][b]Soul Light [/b][/color] : Creates a floating white light with wide radius for 30 minutes.\r\n-[color=#00ffff][b]Resist Flame/Frost/Shock/Magic [/b][/color]: Resist elemental or all magic by 33/66/99 % for 15 minutes.\r\n-[color=#00ffff][b]Spirit Barrier 111/222/333[/b][/color] : Increase armor rating by 111/222/333 points for 15 minutes.\r\n-[color=#00ffff][b]Remote Bomb 1/2/3/Detonate[/b][/color] : Remote detonation bombs. Causes same explosive damage as Spirit Bomb 1/2/3.\r\n-[color=#00ffff][b]Snare Bomb 1[/b][/color] : Deals same damage as Spirit Bomb 1, but snares all enemies in range of the explosion.\r\n-[color=#00ffff][b]Snare Bomb 0[/b][/color] : Deals no damage but Soul Snare for 48 seconds in large radius\r\n-[color=#00ffff][b]Magic Chest[/b][/color] : Access the Deposited Items chest at any time from anywhere\r\n-[color=#00ffff][b]Unlock Apprentice/Adept/Expert/Master[/b][/color] : Doors and containers at or below spell level unlock automatically.\r\n\r\n[color=#0055ff]Mystic Arena[/color]\r\n--------------\r\n\r\nThe Mystic Arena allows fighting against spirits of enemies captured via Soul Snare. This is not a classic pit arena, but rather set on an island with a Soul Cairn theme. This is primarily intended for end-game players wanting a difficult combat challenge. The arena has an unlimited number of matches, with each consecutive match increasing enemy strength via scripting.\r\n\r\nThe concept to this arena is that the player farms Skyrim for creatures/NPCs and Soul Energy, then uses them to compete in the arena. In each round the player faces 50 in the arena, although due to the size of the arena usually combat involves about a dozen at once.\r\n\r\nMatches are made up of 3 rounds:\r\n-Creature round\r\n-NPC round\r\n-Boss round\r\n\r\nBoss rounds can be of 4 possible types:\r\n-Undead \r\n-Daedric\r\n-Mystic\r\n-Dragon\r\n\r\nBosses are all custom types with enhanced stats and abilities. Champions have powerful weapons, damage resistances, magic resistances and spells depending on type. Dragon bosses do not grant dragon souls.\r\n\r\nCompleting matches provides loot rewards. The more matches played consecutively, the more rewards are given.\r\n\r\nThe arena is available in 2 modes - Softcore and Hardcore. In softcore, followers and Soul Forge summons are permitted. There is a summoning pedestal in the arena that can be used after selecting round start. In hardcore mode, no followers and no Soul Forge summons are possible. Additionally, only vanilla Skyrim summons are possible - anything else will automatically eject the player for cheating. Hardcore comes with triple loot rewards and a small Soul Energy reward. Some extra powerful spells or items are available as arena rewards in any mode, in addition to unenchanted versions of various unique items, such as dragon masks or archmage robe.\r\n\r\nFor more details, see the arena manual available from the Magic Merchant.\r\n\r\nIf using Nightmare spawning mod, please set difficulty to Normal before playing in arena. If using other spawning mods please take necessary steps to disable spawning. Otherwise additional enemies will spawn that are not ghosts and not arena contestants. In Hardcore this will result in being ejected by anti-cheat function.\r\n\r\nThis version is current in beta test phase. Will not be available for No Dungeon Exterior version will be released until bug fixing is complete.\r\n\r\nThere are still some bugs with the arena.\r\n\r\n[color=#00ff00]UNIQUE REWARDS[/color]\r\n--------------\r\n\r\nIn the arena boss level randomized loot rewards are the following items that are only available in this manner:\r\n\r\n-[color=#00ffff][b]Doomed amulet[/b][/color]: Reduces Doom soul energy cost from 666 to 66 but damages wearer 11 points per second while equipped.\r\n-[color=#00ffff][b]Staff of Strong Absorb Magicka[/b][/color]: Concentration lightning attack that deals no damage but absorbs 33 Magicka/second\r\n-[color=#00ffff][b]Staff of Intense Lightning[/b][/color]: Concentration lightning attack that deals 64 Health and Magicka damage per second\r\n-[color=#00ffff][b]Snare Bomb 2/3[/b][/color]: Snare bomb versions equivalent to Spirit Bomb 2/3\r\n-[color=#00ffff][b]Supreme Barrier[/b][/color]: Erects an indestructible stationary magic barrier for 30 seconds\r\n-[color=#00ffff][b]Regenerate Health/Magicka/Stamina[/b][/color]: 200% fortification versions of Regenerate, and a 300% version fortification of Magicka\r\n-[color=#00ffff][b]Fortify Health/Magicka/Stamina[/b][/color]: Fortify Health/Magicka/Stamina by 333/666/999 points. 1333 point version also available for Magicka. Intended for use in high level matches in the arena.\r\n\r\n[color=#ff0000][b]BUGS[/b][/color]\r\n-------\r\n\r\nMost of these bugs are due to limitations in Skyrim and cannot be fixed.\r\n\r\n-Not compatible with Azura Star\r\n-Mismatched Soul Gems & Souls cannot be stored into the Forge\r\n-Using Resurrect on any non-mimic target causes the inventory to reset. So additional items will be reset. Grab items from Vanilla follower before casting.\r\n-Taking a Mimic into a place followers can\\'t go can cause the game to delete the Mimic\r\n-Sometimes Spirit Bomb direct hits do not detonate, and only cause direct impact damage but no splash damage.\r\n-Sometimes Chain Snare hits but does not take effect, or no chain recast is launched.\r\n-Weapon charge bar max does not change when recharged, however over-charge still occurs.\r\n-For Magic Arrow, the count in the bottom right appears to count down. However, inventory always contains 999 arrows for spell duration\r\n-Voodoo will have strange effects on some NPCs in town. Guards will still attempt to arrest you for crimes.\r\n-Graphics for sentinels are glitchy. This was a last-ditch attempt for moving sentinels so this is as good as it gets\r\n-Some staves sit a bit high above the weapon beacons. Wood axe also sits too low and clips into the pillar. Other weapons seem fine.\r\n-Although corpse devouring spells can be cast on dragons in the moment between death and dragon soul absorption (but not after), do NOT cast on Durnevhiir or he will never be able to be summoned afterward.\r\n-Devouring Skjor\\'s corpse before Aela gets a chance to look at it will crash the game to desktop.\r\n-When completing the quest Purity of Revenge, return to Whitrun on foot through the front gate with Vilkas. Teleporting into Whiterun will permanently break the Companions questline.\r\n-Imbibe corpse is not compatible with the mod AutoPSL when using auto-stats\r\n-Stolen item cleanser may still charge you for items you don\\'t own but aren\\'t stolen.\r\n-Putting stolen then user enchanted items into the cleanser may remove the enchantment.\r\n",
  "categoryId": "75",
  "version": "3.01.16",
  "author": "DefiniteIntegral",
  "createdUnix": "1328987228",
  "updatedUnix": "1361002196",
  "containsAdultContent": false,
  "uploadedBy": "DefiniteIntegral",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34672",
      "name": "Soul Forge 2_2e",
      "version": "2.2e",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83",
      "fileName": "Soul Forge 2_2e-8971-2-2e.rar",
      "uploadedUnix": "1329811745",
      "modVersion": "2.2e",
      "virusScanUrl": "https://www.virustotal.com/file/c4dbb04693fcb9b5ed3777966ded65908ec27519aa6bebc42f5607bfdc0c159e/analysis/1406700843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_2e-8971-2-2e.rar?fid=34672&ttl=1535768130&ri=8192&rs=8192&setec=a9d1c1f12bc09d3fc8ffb7a8048ba28d"
    },
    {
      "fileId": "34798",
      "name": "Soul Forge 2_3a",
      "version": "2.3a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "82",
      "fileName": "Soul Forge 2_3a-8971-2-3a.rar",
      "uploadedUnix": "1329835548",
      "modVersion": "2.3a",
      "virusScanUrl": "https://www.virustotal.com/file/cbb3f12d77837298be653bce63702f4c72d1cbb3adfb7e02086ca98d785817f5/analysis/1406701642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_3a-8971-2-3a.rar?fid=34798&ttl=1535768130&ri=8192&rs=8192&setec=0f376ed25af7fa815430dedfee504d75"
    },
    {
      "fileId": "35241",
      "name": "Soul Forge 2_4",
      "version": "2.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "93",
      "fileName": "Soul Forge 2_4-8971-2-4.rar",
      "uploadedUnix": "1329916780",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/26f01fad8f68d67456db80832f20890f7c7536265c477254f6a7dac6e7a42287/analysis/1406704807/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_4-8971-2-4.rar?fid=35241&ttl=1535768130&ri=8192&rs=8192&setec=8de2727023e0ad8e7b19fbc1a46a564a"
    },
    {
      "fileId": "35392",
      "name": "Soul Forge 2_5",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "98",
      "fileName": "Soul Forge 2_5-8971-2-5.rar",
      "uploadedUnix": "1329939753",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/85eb1030e58a809789ae3e51b92c42c590c2a5248f0e02ee9f9cdef04308f7b9/analysis/1406705714/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_5-8971-2-5.rar?fid=35392&ttl=1535768131&ri=8192&rs=8192&setec=5e85639036d1a05e6400e7bd7b5eea45"
    },
    {
      "fileId": "37138",
      "name": "Soul Forge 2_6e",
      "version": "2.6e",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "133",
      "fileName": "Soul Forge 2_6e-8971-2-6e.rar",
      "uploadedUnix": "1330273900",
      "modVersion": "2.6e",
      "virusScanUrl": "https://www.virustotal.com/file/d07adb0e950d6c4b6467db678093580995beedcd54d7d0d51b4b6b52a7e80733/analysis/1406714882/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_6e-8971-2-6e.rar?fid=37138&ttl=1535768131&ri=8192&rs=8192&setec=2ffbb54e70d138d6898507120c363e20"
    },
    {
      "fileId": "40790",
      "name": "Soul Forge 2_7a",
      "version": "2.7a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "361",
      "fileName": "Soul Forge 2_7a-8971-2-7a.rar",
      "uploadedUnix": "1331055015",
      "modVersion": "2.7a",
      "virusScanUrl": "https://www.virustotal.com/file/deb2933d155a19fb051d8280a2a3c421ac1d041b8aa3ab55a93f816e766188e2/analysis/1406734870/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_7a-8971-2-7a.rar?fid=40790&ttl=1535768132&ri=8192&rs=8192&setec=7d355b6365e9b509ac0ce5a0e1a45598"
    },
    {
      "fileId": "47604",
      "name": "Soul Forge 2_8f",
      "version": "2.8f",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "407",
      "fileName": "Soul Forge 2_8f-8971-2-8f.rar",
      "uploadedUnix": "1332921364",
      "modVersion": "2.8f",
      "virusScanUrl": "https://www.virustotal.com/file/265815a77e9380f9a374581c91cbadb127841b36065575d57f749912ec1d749d/analysis/1406783888/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_8f-8971-2-8f.rar?fid=47604&ttl=1535768132&ri=8192&rs=8192&setec=07d2d3aa1826912b0f8c676b7597fe5e"
    },
    {
      "fileId": "86406",
      "name": "Soul Forge 2_9g",
      "version": "2.9g",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "516",
      "fileName": "Soul Forge 2_9g-8971-2-9g.rar",
      "uploadedUnix": "1346772316",
      "modVersion": "2.9g",
      "virusScanUrl": "https://www.virustotal.com/file/b0e15007bb8312fa6e174f0c9334efa99e8623d5e5b935e69f03f7f15b453aea/analysis/1407145521/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_9g-8971-2-9g.rar?fid=86406&ttl=1535768133&ri=8192&rs=8192&setec=4bea49832832f7b8fdd68b139db1f84e"
    },
    {
      "fileId": "86775",
      "name": "Soul Forge 2_10b",
      "version": "2.10b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "536",
      "fileName": "Soul Forge 2_10b-8971-2-10b.rar",
      "uploadedUnix": "1346936722",
      "modVersion": "2.10b",
      "virusScanUrl": "https://www.virustotal.com/file/a3f4c52fdeb0ef75f9697a2ac2aad5089d075cbda1ef8b9beeaa2986ff3c8427/analysis/1407148989/",
      "changelogHtml": " -Added spell: Devour Corpse - destroys & absorbs a corpse, healing the caster 15% Health/Magicka/Stamina <br/> \n -Added spell: Transmute Corpse - destroys & transmutes a corpse, giving an empty Soul Gem of varying size <br/> \n -Changed Sap Spirit from 10/20/30 to 15/30/45 % weakening effect <br/> \n -Changed Sap Spirit from 4/8/12 to 6/10/14 Soul Energy <br/> \n -Changed Sap Spirit from Master/Master/Master to Adept/Expert/Master  <br/> \n -Fixed bug with Sap Spirit causing enemies to actually become stronger if lacking sufficient Soul Energy <br/> \n -Minor price changes to some spells <br/> \n -Fixed missing inventory art for some spells <br/> \n -Other misc scripting & other bug fixes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_10b-8971-2-10b.rar?fid=86775&ttl=1535768133&ri=8192&rs=8192&setec=3e12ed631f341bd7599906863a039546"
    },
    {
      "fileId": "87661",
      "name": "Soul Forge 2_11b",
      "version": "2.11b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "577",
      "fileName": "Soul Forge 2_11b-8971-2-11b.rar",
      "uploadedUnix": "1347292573",
      "modVersion": "2.11b",
      "virusScanUrl": "https://www.virustotal.com/file/d8348b144f84449bbbfd342efdb9b41ef1772ee4470ea0ed859d58221fa548ae/analysis/1407158105/",
      "changelogHtml": " -Re-wrote weapon recharge orb script. Now increases both CHARGE and MAX CHARGE by 1500 energy. Costs soul 12 Energy. Charge bar max may not visibly change. <br/> \n -Recharge orb now automatically recharges Player, Vanilla Follower and Marked Follower equipped weapons regardless of who activates the orb <br/> \n -Fixed bug with Soul Snare lanching chain recasts towards untrappable actors repeatedly (Essentials, Dwarven centurions, NoSoulTrap keyword types) <br/> \n -Changed Divine Strike to be a Destruction spell <br/> \n -Added spell: Distil Corpse - destroys & distils a corpse, boosting weapon CHARGE and MAX CHARGE by 66 energy. Charges player, vanilla & marked follower weapons. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_11b-8971-2-11b.rar?fid=87661&ttl=1535768134&ri=8192&rs=8192&setec=b8f35ca095b1e6667b8dbaeae8a9bad7"
    },
    {
      "fileId": "87997",
      "name": "Soul Forge 2_12j",
      "version": "2.12j",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "676",
      "fileName": "Soul Forge 2_12j-8971-2-12j.rar",
      "uploadedUnix": "1347436604",
      "modVersion": "2.12j",
      "virusScanUrl": "https://www.virustotal.com/file/739a3779052f2a81bece2fc0ee1d3fbd54df4235ffb3c2fd7888844439382d23/analysis/1407161225/",
      "changelogHtml": " -Added spell: Flash Step 50/100/150. Increases speed by 50/100/150 % for 30 minutes. Costs 5/10/15 Soul Energy. 50/10/150 is stackable for 300% total boost. <br/> \n -Added spell: Holy Diver. Provides Water Breathing for 30 minutes. Costs 6 Soul Energy. <br/> \n -Changed Sap Spirit duration from 30 seconds to 60 seconds <br/> \n -Changed Sap Spirit Weak/Medium/Strong from 6/10/14 to 6/12/18 Soul Energy cost to offset the increased effect strength <br/> \n -Renamed Sap Spirit Weak/Medium/Strong to Sap Spirit 15/30/45 to match other spells which used numbered system reflecting spell strength <br/> \n -Increased Devils Charm spellbook price from 1666 to 2777 Gold due to the power of this spell (fortifies Speechcraft by 99) <br/> \n -Decreased Spirit Bomb damage range from 1600/1800/2000 to 1000/1200/1400. Should reflect the explosive graphic radius a bit better now. <br/> \n -Reduced Hex Immunity from 1 day to 1 minute duration.  <br/> \n -Added visual effect to Hex Immunity so player can determine when the immunity expires. <br/> \n -Renamed Devour/Distil/Transmute to get rid of (Spell) and (Power). Just kept the suffixes for the spell books. <br/> \n -Added conditional to Soul Resurrect to prevent casting it on a corpse that is currently being devoured. <br/> \n -Added conditional to Soul Resurrect to prevent casting it on Dragons and Dwarven centurions. <br/> \n -Modified Teleport to re-create the teleport exit beacon each cast, instead of just moving the existing one. Teleport exit location has been reset. <br/> \n -Modified Teleport, Soul Mark, Soul Cast and Soul Summon in preparation for Soul Forge 3.x planned features. <br/> \n -WARNING Teleport location reset, SAVE GAME OUTSIDE SOULFORGE BEFORE UPDATING <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_12j-8971-2-12j.rar?fid=87997&ttl=1535768134&ri=8192&rs=8192&setec=e46d2da6be9ac3eacf8712f09435b84c"
    },
    {
      "fileId": "89149",
      "name": "Soul Forge 2_13e",
      "version": "2.13e",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1397",
      "fileName": "Soul Forge 2_13e-8971-2-13e.rar",
      "uploadedUnix": "1347948022",
      "modVersion": "2.13e",
      "virusScanUrl": "https://www.virustotal.com/file/2246073975ba2a79c4b4b0b9aaf3b09dcb720858dd9f6bac98811bbc3555d55b/analysis/1407172504/",
      "changelogHtml": " -Fixed incorrectly named activator for summong mannequins <br/> \n -Modified Magic and Melee mimics combat styles to better reflect their intended roles.  <br/> \n -Fixed script bug with teleport causing vanilla followers TP summon effect to play in the wrong location. <br/> \n -Script fixes to Full Restore HMS so energy cost based on actual max stat including fortifications. Increased cost to 3% of max stat. <br/> \n -Increased Holy Diver Soul Energy cost from 6 to 16 Soul Energy <br/> \n -Increased Fortify HMS Rate from 7 Soul Energy to 11 cost <br/> \n -Added a \\\"Clear Loot\\\" button to the loot container. This will erase the contents of the container. <br/> \n -Changed Distil Corpse to give scaling charge based on target level. Ranges from 20 charge for level 1, to 500 charge for level 81 target corpse. Receive 50% extra for NPC targets. <br/> \n -Increased Immortal Soul spellbook cost from 5000 to 33333 Gold due to spell power <br/> \n -Changed Soul Mark from 1 to 6 Soul Energy cost <br/> \n -Changed Soul Summon from 3 to 12 Soul Energy cost <br/> \n -Changed Soul Cast from 6 to 24 Soul Energy cost <br/> \n -Added spells: Forge Health/Magicka/Stamina (Remote). Cast to remotely toggle the Forge HMS beacons. Used to manage fortifications in the field. Costs 5 Soul Energy. <br/> \n -Added spell + power : Alchemize Corpse. Can transform a corpse into a random gold and/or item reward. Drop chance based on target corpse level. Costs 4 Soul Energy <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_13e-8971-2-13e.rar?fid=89149&ttl=1535768135&ri=8192&rs=8192&setec=12f9fd880e849652bd88fe93fc421180"
    },
    {
      "fileId": "89502",
      "name": "Soul Forge 2_14b_ND No Dungeon Exterior",
      "version": "2.14b.ND",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1326",
      "fileName": "Soul Forge 2_14b NO DUNGEON EXTERIOR-8971-2-14b-ND.rar",
      "uploadedUnix": "1348135425",
      "modVersion": "2.14b.ND",
      "virusScanUrl": "https://www.virustotal.com/file/caa47d784f1ba73af90ece913f6bcec5838aeee637ce1734be25e05e92f3886e/analysis/1407176717/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_14b%20NO%20DUNGEON%20EXTERIOR-8971-2-14b-ND.rar?fid=89502&ttl=1535768135&ri=8192&rs=8192&setec=424ea5e4eb725486219d5de6bdc67b39"
    },
    {
      "fileId": "89503",
      "name": "Soul Forge 2_14b Standard",
      "version": "2.14b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1459",
      "fileName": "Soul Forge 2_14b-8971-2-14b.rar",
      "uploadedUnix": "1348135477",
      "modVersion": "2.14b",
      "virusScanUrl": "https://www.virustotal.com/file/99becc2369ae161cf3f69092ad7ab3626120deeadc7707077ec72a6e9902b79a/analysis/1407176720/",
      "changelogHtml": " -Added +111 physical damage resistance to all Mystic summons <br/> \n -Added 25% weakness to frost/flame/magic to flame/frost/storm Mystic summons <br/> \n -Reduced bash + power move multipliers for all summon combat styles as Melee Mystics were using too much shield bash and Melee Mimics too many power moves <br/> \n -Reduced Soul Mark range from 60 feet to 35 feet <br/> \n -Modified Soul Mark to allow un-marking (no cost) <br/> \n -Added spells: Multi-mark and Multi-summon. Allows marking & summoning multiple targets at once. Costs 13 Soul Energy per summon. Will not auto-teleport or summon single-mark target. <br/> \n -Multi-summon performs Line of Sight check, so only summons in front of player. Can be used to drop people off a cliff if you so desire. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_14b-8971-2-14b.rar?fid=89503&ttl=1535768135&ri=8192&rs=8192&setec=cc222433c95e15e59dbeb668f2af989b"
    },
    {
      "fileId": "89662",
      "name": "Soul Forge 2_14c",
      "version": "2.14c",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1472",
      "fileName": "Soul Forge 2_14c-8971-2-14c.rar",
      "uploadedUnix": "1348220430",
      "modVersion": "2.14c",
      "virusScanUrl": "https://www.virustotal.com/file/4ad51f04a0fcea80cb85acefa4a5fd4b27d170c4cde021b1b332899fd380343b/analysis/1407178993/",
      "changelogHtml": " -Modified Lost Ruin ghosts to have no voices during combat. <br/> \n -Fixed Soul Summon so dead mystics are automatically deleted from Marked actor form list. <br/> \n -Fixed spelling error for Alchemize Corpse (Spell) <br/> \n -Increased the spell book price for Soul Link 1/2 <br/> \n -Minor FX fixes with devour/distil/transmute corpse <br/> \n -Added spells: Imbibe Corpse Health/Magicka/Stamina. Permanently grows HMS by a tiny amount for each corpe imbibed (between 0.01 and 0.4). Costs 5 Soul Energy. <br/> \n -Added spell: Soul Light. Creates a white hovering light with a radius around 4x CandleLight. Costs 13 Soul Energy, duration 30 minutes. <br/> \n -Added spells: Resist Flame/Frost/Shock/Magic 33/66/99 % for 15 minutes. Flame/Frost 33/66/99 comes with 11/22/33 % weakness to Frost/Flame.  <br/> \n -Added spell: Magic Barrier 111/222/333. Fortifies armor rating by 111/222/333 for 15 minutes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_14c-8971-2-14c.rar?fid=89662&ttl=1535768136&ri=8192&rs=8192&setec=5a342893b99946939719da1272d888fd"
    },
    {
      "fileId": "89746",
      "name": "Soul Forge 2_14d Standard",
      "version": "2.14d",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1479",
      "fileName": "Soul Forge 2_14d-8971-2-14d.rar",
      "uploadedUnix": "1348255855",
      "modVersion": "2.14d",
      "virusScanUrl": "https://www.virustotal.com/file/f956ac13c6e5753c82023accc9e438835143fe06eb74fae3ed5b08b3d0a5b290/analysis/1407180004/",
      "changelogHtml": " -Replaced all the Eye of Magnus graphics in the Soul Forge control system with magic effect graphics <br/> \n -Fixed Restore HMS controls in Soul Forge to correctly take max stat into account including fortifications <br/> \n -Reduced in-forge HMS restore energy cost to 1.5% of max stat <br/> \n -Fixed bug with Full Restore HMS calculating restore amount incorrectly <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_14d-8971-2-14d.rar?fid=89746&ttl=1535768136&ri=8192&rs=8192&setec=394e3a1cb6c6f20de368db580c02b186"
    },
    {
      "fileId": "89815",
      "name": "Soul Forge 2_14e Standard",
      "version": "2.14e",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1479",
      "fileName": "Soul Forge 2_14e-8971-2-14e.rar",
      "uploadedUnix": "1348296538",
      "modVersion": "2.14e",
      "virusScanUrl": "https://www.virustotal.com/file/ab68ff63112446729ab6f089e16336971fb6a5a524a331122d9b3e0bcb57f266/analysis/1407180543/",
      "changelogHtml": " -Fixed Soul Forge control activator clipping/bounding issues by repositioning Gem and Restore orbs <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_14e-8971-2-14e.rar?fid=89815&ttl=1535768137&ri=8192&rs=8192&setec=2ed48e90729ffe5bf68b2741e16a3baa"
    },
    {
      "fileId": "89831",
      "name": "Soul Forge 2_14f Standard",
      "version": "2.14f",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1479",
      "fileName": "Soul Forge 2_14f Standard-8971-2-14f.rar",
      "uploadedUnix": "1348316839",
      "modVersion": "2.14f",
      "virusScanUrl": "https://www.virustotal.com/file/ed03fe7df141de745294358c4e1cc478cd2850f97daaea89f05b62fa4dcd20e9/analysis/1407180892/",
      "changelogHtml": " -Fixed recent spell additions with spelling errors or incorrect energy cost displayed. <br/> \n -Fixed bug with summon activators not displaying energy count or updating fortifications correctly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%202_14f%20Standard-8971-2-14f.rar?fid=89831&ttl=1535768137&ri=8192&rs=8192&setec=98949a83041c8696f96ec2dcf98fd61d"
    },
    {
      "fileId": "90396",
      "name": "Soul Forge 3_00_00 Standard",
      "version": "3.00.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5836",
      "fileName": "Soul Forge 3_00_00 Standard-8971-3-00-00.rar",
      "uploadedUnix": "1348586628",
      "modVersion": "3.00.00",
      "virusScanUrl": "https://www.virustotal.com/file/9d689d2dcd3091663279e6c62d0c67da652b8a5afc42de2d4878216f20f0cc13/analysis/1407186308/",
      "changelogHtml": " -Added Dawnguard dependency. All future versions now rely on Dawnguard.esm <br/> \n -Fixed Resist Frost 66 actually causing Resist Frost 33 <br/> \n -Fixed Hostile summons not affecting stealth meter <br/> \n -Changed Hostile summons from follower to sandbox AI package (will no longer follow player, but rather move & attack randomly) <br/> \n -Added Spell: Chain Snare (Power). Spell book very expensive to offset no-hands casting convenience. <br/> \n -Added Undead summons: Death Hound, Boneman, Keeper, Reaper. These are customized versions. Also includes stats mimic and control menus. Cannot be healed or revived. <br/> \n -Death Hound Infection deals: Physical damage, Frost damage, Poison damage over time and 25% chance per-hit to inflict with a random disease affecting stats (HMS) or skills (one-handed/two-handed). <br/> \n -Boneman Curse deals: Physical damage, Poison damage over time and 25% chance per-hit to inflict with a random disease affecting skills (archery/light-armor/heavy-armor/block). <br/> \n -Keeper Dread deals: Physical damage, damages max Health, Magicka and Stamina and nullifies Health, Magicka and Stamina regeneration for 10 seconds. <br/> \n -Reaper Drain deals: Damage Magicka and Stamina over time and 50% chance per-hit to inflict diseases that damage magic skill by 15 points and reduce elemental magic resistances by 50% <br/> \n -Added Black Dragonbone crafting recipes. Must have both Dragonbone and Ebony perks to craft. Requires Ebony Ingots and filled Black Soul Gems. Can only be created at Soul Forge or SkyForge. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%203_00_00%20Standard-8971-3-00-00.rar?fid=90396&ttl=1535768138&ri=8192&rs=8192&setec=c83f0f3686dcb1690e950bdf57c21bab"
    },
    {
      "fileId": "90511",
      "name": "Soul Forge 3_00_01 Standard",
      "version": "3.00.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5853",
      "fileName": "Soul Forge 3_00_01 Standard-8971-3-00-01.rar",
      "uploadedUnix": "1348653684",
      "modVersion": "3.00.01",
      "virusScanUrl": "https://www.virustotal.com/file/d51568073d0055dad689ca93f99f791207df87b92f6fcd84361e3c22c2fc7c2f/analysis/1407187790/",
      "changelogHtml": " -Added 33% weakness to Flame/Frost/Shock to Keeper as offset for increased Health and physical damage resistance <br/> \n -Added 100% poison resistance to all Undead summons <br/> \n -Gave Black Dragonbone swords to Boneman and Reaper as backup for bows <br/> \n -Added Spirit Bomb 1/2/3 enchantment to the explosion forms to deal additional health damage, as splash damage was too low compared to direct hit damage. <br/> \n -Removed guaranteed knockdown for Spirit Bomb 3 and replaced with by-formula knockdown as was overpowered before. <br/> \n -Reduced God Step effectiveness from 50/100/150 to 33/66/99 <br/> \n -Updated Resist Magic 99 visual effect with custom visual instead of Call of Valor visual <br/> \n -Added spells: Remote Bomb 1/2/3/Detonate. Costs 5/10/15 energy to place, 3 to detonate. Can place multiple bomb points, then detonate them in a chained sequence remotely. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%203_00_01%20Standard-8971-3-00-01.rar?fid=90511&ttl=1535768138&ri=8192&rs=8192&setec=fa3f32f578f1093d6b4cb6b63ad94a57"
    },
    {
      "fileId": "90512",
      "name": "Soul Forge 3_00_01 No Dungeon Exterior",
      "version": "3.00.01ND",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5724",
      "fileName": "Soul Forge 3_00_01 No Dungeon Exterior-8971-3-00-01ND.rar",
      "uploadedUnix": "1348653799",
      "modVersion": "3.00.01ND",
      "virusScanUrl": "https://www.virustotal.com/file/95d8293a7e029653663941bd1e87f33f53de1b697e7466455e6f0ea9493fd0e0/analysis/1407187801/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%203_00_01%20No%20Dungeon%20Exterior-8971-3-00-01ND.rar?fid=90512&ttl=1535768139&ri=8192&rs=8192&setec=359479cbf46bbaf53277a67ecc436e7f"
    },
    {
      "fileId": "90659",
      "name": "Soul Forge 3_00_02 Standard",
      "version": "3.00.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5851",
      "fileName": "Soul Forge 3_00_02 Standard-8971-3-00-02.rar",
      "uploadedUnix": "1348729672",
      "modVersion": "3.00.02",
      "virusScanUrl": "https://www.virustotal.com/file/131b99bc4c736c43f2fc1747ea5115babe38d087cc2d0a396d28b424398728f8/analysis/1407189393/",
      "changelogHtml": " -Added Shouts, Alteration and Illusion spells to Mimics <br/> \n -Altered Summons so when in Wait/Guard mode, they will attempt to stay within 512 game units (about 25 feet) of the wait/guard location specified. This is to prevent location drift post-combat. <br/> \n -Fixed bug with ongoing sound effects when using Regenerate HMS spells <br/> \n -Fixed bug with Chain Snare (Power) requiring 0 Magicka to cast <br/> \n -Increased Chain Snare (Power) base Magicka cost from 999 to 1333 to offset no-hands casting convenience. <br/> \n -Reduced Remote Bomb Detonate/1/2/3 cost from 3/5/10/15 to 2/4/8/12 as it generally requires multiple bombs to kill enemies. <br/> \n -Modified all corpse devour spells so cannot devour Essentials, NoSoulTrap keyword, ActorTypeDragon or SoulForgeNoResurrect keyword types to prevent quest breakage. <br/> \n -Increased physical damage of mystic elemental daggers from 8 back to original value 11 <br/> \n -Changed Soul Mark and Multi-Mark from Alteration to Conjuration <br/> \n -Fixed Soul Forge (Teleport) so will not attempt auto-TP on no-resurrect types that have already deleted themselves (mystics/undead) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%203_00_02%20Standard-8971-3-00-02.rar?fid=90659&ttl=1535768139&ri=8192&rs=8192&setec=fc6db09dbfe59ce92af503e3b314169d"
    },
    {
      "fileId": "90882",
      "name": "Soul Forge 3_00_03 Standard",
      "version": "3.00.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5859",
      "fileName": "Soul Forge 3_00_03 Standard-8971-3-00-03.rar",
      "uploadedUnix": "1348846443",
      "modVersion": "3.00.03",
      "virusScanUrl": "https://www.virustotal.com/file/ae342ade5f8902d827987623063a62cae3e6cf5f5f30ae37a2aa809330da6688/analysis/1407191649/",
      "changelogHtml": " -Added Coffin to Soul Forge for Vampire Lords to sleep (for the 10% resist magic bonus) <br/> \n -Added Cure Ailments orb to Soul Forge. Cures all diseases and poison effects for player, vanilla follower and marked follower. Costs 6 Soul Energy. <br/> \n -Added Stolen Item Cleanser to remove stolen item status. Costs 66 energy per item cleansed. Only inteded for items you plan to use - high price as to not make fences redundant. <br/> \n -Changed Devils Charm cost from 33 to 66 so as to somewhat limit use for purpose of not making in-game fences redundant. <br/> \n -Removed Shouts learning capability from Mimics as weren\\'t working anyway. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%203_00_03%20Standard-8971-3-00-03.rar?fid=90882&ttl=1535768140&ri=8192&rs=8192&setec=8069bef6369c49d3bc45c1185b4742f0"
    },
    {
      "fileId": "94183",
      "name": "Soul Forge Mystic Arena 3_01_06",
      "version": "3.01.06",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12686",
      "fileName": "Soul Forge Mystic Arena 3_01_06-8971-3-01-06.rar",
      "uploadedUnix": "1350401521",
      "modVersion": "3.01.06",
      "virusScanUrl": "https://www.virustotal.com/file/4eac89f891ea043aa303f6af18238514be433efd82697f583138c131442dd431/analysis/1407225208/",
      "changelogHtml": " -Re-designed Soul Forge into multiple rooms to overcome crash bug caused by having too many scripted objects in one room <br/> \n -Modified Weapon racks so any rack can hold weapons or shields <br/> \n -Modified various scripts to use linked refs instead of persistent references to reduce RAM use and CPU load <br/> \n -Modified Forge HMS (Remote) Spells to enable remotely managing fortification balancing <br/> \n -Added many more mannequins and weapon racks <br/> \n -Added individualized general storage with scripted item transfer. <br/> \n -Added individualized potion storage with scripted item transfer and potion upgraders. Only works on purchased or found potions. <br/> \n -Added individualized smithing item storage with scripted item transfers. <br/> \n -Added Token of Wealth to Magic Merchant: If player has this in inventory, merchant always has 3333 gold (infinite supply). Base item cost is 333,333 Gold. <br/> \n -Added Doomed, an amulet which while reduces the Soul Energy cost of the spell Doom from 666 to 66, but deals 11 DPS to Health, Magicka and Stamina while equipped. Available as Arena boss level random loot. <br/> \n -----THIS VERSION REQUIRES CLEAN REINSTALL----- <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%20Mystic%20Arena%203_01_06-8971-3-01-06.rar?fid=94183&ttl=1535768140&ri=8192&rs=8192&setec=4c23ffbce414c3295b5d93938eff677c"
    },
    {
      "fileId": "94274",
      "name": "Soul Forge Mystic Arena 3_01_08",
      "version": "3.01.08",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12687",
      "fileName": "Soul Forge Mystic Arena 3_01_08-8971-3-01-08.rar",
      "uploadedUnix": "1350461862",
      "modVersion": "3.01.08",
      "virusScanUrl": "https://www.virustotal.com/file/0fa3182941280f2d4093ad73c50d2e066996373cef463e4ca34a7e65c6bc6ad5/analysis/1407226215/",
      "changelogHtml": " -Fixed but with Soul Cast not working <br/> \n -Fixed bug with Teleport not transferring followers automatically <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%20Mystic%20Arena%203_01_08-8971-3-01-08.rar?fid=94274&ttl=1535768140&ri=8192&rs=8192&setec=d5a33b840d4e3225ff6dbda24fbfd92c"
    },
    {
      "fileId": "95792",
      "name": "Hearthfire Patch for Soul Forge 3_01_08",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Hearthfire Patch for Soul Forge 3_01_08-8971-1.rar",
      "uploadedUnix": "1351212713",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6fe0a9ea63c88b7c4caa315e66ce71a210dd07d0d4416d293cfa6b3e818bdb5e/analysis/1407236162/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfire%20Patch%20for%20Soul%20Forge%203_01_08-8971-1.rar?fid=95792&ttl=1535768141&ri=8192&rs=8192&setec=edeef0d0b49116593d4c104f35f96d85"
    },
    {
      "fileId": "98448",
      "name": "Soul Forge Mystic Arena 3_01_09",
      "version": "3.01.09",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13547",
      "fileName": "Soul Forge Mystic Arena 3_01_09-8971-3-01-09.rar",
      "uploadedUnix": "1352537500",
      "modVersion": "3.01.09",
      "virusScanUrl": "https://www.virustotal.com/file/9547496d1224de38beee0c828424df35e334537f241ef24e514da65e54b20cfd/analysis/1407256461/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%20Mystic%20Arena%203_01_09-8971-3-01-09.rar?fid=98448&ttl=1535768141&ri=8192&rs=8192&setec=61043de31e24642f1b7134d1b8ca1457"
    },
    {
      "fileId": "98520",
      "name": "Soul Forge Mystic Arena 3_01_10",
      "version": "3.01.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13547",
      "fileName": "Soul Forge Mystic Arena 3_01_10-8971-3-01-10.rar",
      "uploadedUnix": "1352559490",
      "modVersion": "3.01.10",
      "virusScanUrl": "https://www.virustotal.com/file/e5fc50e006f1c00afa164199e759f7ff686dcdaa58e5af9360ca7a97424554a5/analysis/1407256817/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%20Mystic%20Arena%203_01_10-8971-3-01-10.rar?fid=98520&ttl=1535768142&ri=8192&rs=8192&setec=fba0385299dde2163022fc6f5002b404"
    },
    {
      "fileId": "105075",
      "name": "Soul Forge Mystic Arena 3_01_11",
      "version": "3.01.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13548",
      "fileName": "Soul Forge Mystic Arena 3_01_11-8971-3-01-11.rar",
      "uploadedUnix": "1355457097",
      "modVersion": "3.01.11",
      "virusScanUrl": "https://www.virustotal.com/file/5aded6653cf4d1fb28f1a5f5d668ff21a11efb6241bc790008377f406c38d1ef/analysis/1407303632/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%20Mystic%20Arena%203_01_11-8971-3-01-11.rar?fid=105075&ttl=1535768142&ri=8192&rs=8192&setec=0f30f5adde308f62fb720d67011329ec"
    },
    {
      "fileId": "105680",
      "name": "Soul Forge Mystic Arena 3_01_12",
      "version": "3.01.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13551",
      "fileName": "Soul Forge Mystic Arena 3_01_12-8971-3-01-12.rar",
      "uploadedUnix": "1355714386",
      "modVersion": "3.01.12",
      "virusScanUrl": "https://www.virustotal.com/file/b8b70048cccb24351cd8d1f545cf25376bfefdae2f00ced1ec872301e006c20e/analysis/1407308290/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%20Mystic%20Arena%203_01_12-8971-3-01-12.rar?fid=105680&ttl=1535768143&ri=8192&rs=8192&setec=8181a90d221d08798429eb07bdb77af9"
    },
    {
      "fileId": "106764",
      "name": "Soul Forge Mystic Arena 3_01_13",
      "version": "3.01.13",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13561",
      "fileName": "Soul Forge Mystic Arena 3_01_13-8971-3-01-13.rar",
      "uploadedUnix": "1356160704",
      "modVersion": "3.01.13",
      "virusScanUrl": "https://www.virustotal.com/file/328e46356a6506d5de4058642da6afb63b0de516220baf07667277eba5f55344/analysis/1407316715/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%20Mystic%20Arena%203_01_13-8971-3-01-13.rar?fid=106764&ttl=1535768143&ri=8192&rs=8192&setec=080e59d5cf2c4b1d673e36213241a2fb"
    },
    {
      "fileId": "106793",
      "name": "Soul Forge Mystic Arena 3_01_14",
      "version": "3.01.14",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13562",
      "fileName": "Soul Forge Mystic Arena 3_01_14-8971-3-01-14.rar",
      "uploadedUnix": "1356174983",
      "modVersion": "3.01.14",
      "virusScanUrl": "https://www.virustotal.com/file/b2e95530ce50d142b67f55873bc2b5a3b9e0ba0d7c6847ca21d74a1061f9b090/analysis/1407316998/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%20Mystic%20Arena%203_01_14-8971-3-01-14.rar?fid=106793&ttl=1535768144&ri=8192&rs=8192&setec=1dca1b5d789d9f3fb6ef35cb86cc8b7e"
    },
    {
      "fileId": "1000000359",
      "name": "Soul Forge Mystic Arena 3_01_15 Standard",
      "version": "3.01.15",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13577",
      "fileName": "Soul Forge Mystic Arena 3_01_15 Standard-8971-3-01-15.rar",
      "uploadedUnix": "1357449606",
      "modVersion": "3.01.15",
      "virusScanUrl": "https://www.virustotal.com/file/62ba4e3f2e2f3c407bd38093170cc29b00a5e5c3acb160b47549400689078e68/analysis/1407339613/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%20Mystic%20Arena%203_01_15%20Standard-8971-3-01-15.rar?fid=1000000359&ttl=1535768144&ri=8192&rs=8192&setec=b05b0989bf03b104c562d00da7033ac9"
    },
    {
      "fileId": "1000010247",
      "name": "Soul Forge Mystic Arena 3_01_16 Standard",
      "version": "3.01.16",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13579",
      "fileName": "Soul Forge Mystic Arena 3_01_16 Standard-8971-3-01-16.rar",
      "uploadedUnix": "1361002196",
      "modVersion": "3.01.16",
      "virusScanUrl": "https://www.virustotal.com/file/b0cd9b2a7e27f60c76ae38d77e1606b8214e6840dadc974905035765c83f07a4/analysis/1407420242/",
      "changelogHtml": " -Removed Soul Snare effect from Soul Tear 3 <br/> \n -Added custom crafting bench. 7 recipes available presently. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soul%20Forge%20Mystic%20Arena%203_01_16%20Standard-8971-3-01-16.rar?fid=1000010247&ttl=1535768144&ri=8192&rs=8192&setec=66ae27ffe5acc0767cb3c1ff3a81be4a"
    }
  ]
}