{
  "modId": 89724.0,
  "modName": "Requiem - Behind the Curtain - Naturopathy - DELETED",
  "summary": "This small mod extends the idea of “Herbalism” mod of the “Behind the Curtain” overhaul – to help characters, who wish to abstain from using any kind of magic, including Alchemy, get a worthy ways of healing.",
  "descriptionHtml": "First of all, I removed the “Herbalism” perk, since it didn’t fit the content even in the original version. You do nothing about herbs directly, you just “get the knowledge about herbs” and this makes healing poultices three times more effective, even those you buy or loot. That, in my opinion, is not quite logical – you know more about the herbs the poultice is made of, and this makes it more effective… this shouldn’t work like this, so I changed it. And added more…\n<br />\n<br />[u]Name[/u]: Bandaging\n<br />[u]\n<br />Requirements[/u]: Base health 100\n<br />[u]\n<br />Description[/u]: You've learned to create and apply bandages, making healing poultices three times more effective. Moreover, using bandages along with poultices allows healing when sprinting or even swimming.\n<br />[u]\n<br />Effect[/u]: \n<br />You can create “Bandage Billet” from“Linen Wrap” and most of the common clothes at the Tanning rack.\n<br />You can create “Bandage: Clean” atthe Cooking pot (only Bandage Billet is needed, the idea is that you just boil it).\n<br />Using “Bandage: Clean” along with“Healing Poultice” will increase its effectiveness three times. Healing works while sprinting and swimming.\n<br />\n<br /> \n<br />[u]Name[/u]: Naturopathy\n<br />\n<br />[u]Requirements[/u]: Base health 150 &amp; Naturopathy\n<br />\n<br />[u]Description[/u]: You've learned to benefit from Nature's best in terms of healing and remedy. Bandages soaked in Troll fat or Spriggan Sap, make healing poultices six times more effective. If also infused with traditional disease fighting ingredients can cure diseases.\n<br />[u]\n<br />Effect[/u]: \n<br />You can create “Bandage: Intensified Healing” at the Cooking pot, using “Bandage: Clean” and “Troll Fat” or “Spriggan Sap”. Using bandage with “Intensified Healing” along with “Healing Poultice” will increase its effectiveness six times.\n<br />You can create “Bandage: Remedy” at the Cooking pot, using “Bandage: Clean” and 1-5 traditional disease fighting ingredients. The ingredients are: Garlic, Frost Mirriam, Elves Ear, Lavender and Juniper Berries.\n<br />Depending on how many kinds of ingredients you use you will create:\n<br />Deficient – any one ingredient\n<br />Faint – any two ingredients\n<br />Fair – any three ingredients\n<br />Good – any four ingredients\n<br />Remarkable – all five ingredients.\n<br />Using bandage with “Remedy” along with “Healing Poultice” will give you a chance to cure disease every second of usage. The chance depends on the quality of remedy.\n<br />You also can create “Bandage: Intensified Healing and Remedy” – this works like two in one.\n<br />\n<br />[u]\n<br />Name[/u]: Natural Regeneration (3 tiers)\n<br />[u]\n<br />Requirements[/u]: Base health 200/250/300 &amp; Naturopathy\n<br />[u]\n<br />Description[/u]:\n<br />T1: Strong health and constantpractice of natural methods of healing arouse latent regenerative capacities of your body.\n<br />T2: Your body has grown strongerpushing your regeneration rate to even higher level.\n<br />T3: Yourbody has grown so strong and healthy that you've learned to use your natural regenerative capacities to the full extent.\n<br />\n<br />[u]Effect[/u]: \n<br />T1: You obtain the “Natural Regeneration Lesser Boost” ability – increases Heal Rate 0.2 – constant effect.\n<br />T2: You obtain the “Natural Regeneration Greater Boost” ability – increases Heal Rate 0.4 – constant effect.\n<br />T3: You obtain the “Natural Regeneration Great Boost” ability – increases Heal Rate 0.6 – constant effect.\n<br />Each tier effect disables the previous one. (FYI: Base Heal Rate in Requiem is 0.2).\n<br />\n<br />\n<br />[u]Name[/u]: Battle-hardened Regeneration\n<br />[u]\n<br />Requirements[/u]: Base health 200 &amp; NaturalRegeneration T1 &amp; Enemies killed – any of the following\n<br />(People–100/ Animals – 100 / Creatures–100 / Undead–100/ Daedra–20 / Automatons–50)\n<br />[u]\n<br />Description[/u]: As hundreds foes fell by your handno longer battle stresses you that much, allowing you to heal during combat, though not so effectively. As you kill hundreds of enemies of different kinds, you get used to the types of wounds they inflict, increasing your health regeneration rate slightly.\n<br />[u]\n<br />Effect[/u]:\n<br />Healing Poultices and Bandages now heal you even when in combat.\n<br />You get you Heal Rate increased by 0.05 after killing enough enemies of each kind (same numbers as in requirements), up to 0.3.\n<br /> \n<br />\n<br />Finally, after investing all theperks and killing all the enemies needed, you will get about 3.3% health regeneration per second under “Requiem Skills Menu” (when using poultice with intensified healing bandage).",
  "categoryId": "24",
  "version": "1.0",
  "author": "fizeg",
  "createdUnix": "1519133574",
  "updatedUnix": "1519133574",
  "containsAdultContent": false,
  "uploadedBy": "fizeg",
  "primaryFile": null,
  "files": []
}