{
  "modId": 89826.0,
  "modName": "Lynn Ningheim Racemenu Preset - DELETED",
  "summary": "preset files of my ningheim based character lynn with a focus on natural appearance. this preset is a suggestion and hopefully a good basis for you to easily create your own handsome female character.",
  "descriptionHtml": "an additional preset of mine. not really planned for public but i think it's a good opportunity to say \"thank you\" to all the diligent and helpful modders and friends here on nexus and all others who like my presets.\n<br />\n<br />a race menu preset file of my ningheim race character lynn. but it is more than that if you try my cute finges package.\n<br />if you want her as on the screenshots i recommend to install the cute \n<br />fingers ningheim option.\n<br />\n<br />if you want the body, eyes and teeth in the screenshots use my uploaded body, eye and teeth replacers.\n<br />\n<br />the focus was laid on natural appearance, high detail. so the easy \n<br />customizable and out of the box cute ningheim race was the best choice \n<br />for me to create close up capable detailed female character with some \n<br />eye candy addons.\n<br />\n<br />some mods must or at least should be installed to get the correct results. \n<br />the preset file has to be placed at the right place. put it just in the folder where your other loadable presets are located! \n<br />\n<br />[u][b]YOU NEED THE FOLLOWING MODS and addons for full details and correct appearance[/b] (and of course [b]credits to all modders providing the basis for my presets[/b]):[/u]\n<br />[url=http://www.nexusmods.com/skyrim/mods/35474/?]the ningheim race[/url] (including some of its options to prevent crashes with some of the racemenu sliders!)\n<br />current race menu version\n<br />skse for hdt options (most good stuff probably does not run without it)\n<br />[url=http://www.nexusmods.com/skyrim/mods/68311/?]ks hairdo's renewal[/url] for the hair, additionally hdt if you use the hdt hair options\n<br />stoja's warpaints (for correct face paint)\n<br />eyes of beauty\n<br />my ningheim cute fingers fitness body option in my [url=https://www.nexusmods.com/skyrim/mods/82568/?]cute fingers seamless body mod[/url] is strictly recommended for a full detailed unp based character (just don't use it on low end rigs)\n<br />\n<br />\n<br />for some ningheim addons have a look in my file options here or in my \n<br />katarina ningheim preset mod files folder first. you may not find some \n<br />of them in the nexus mod list anymore.\n<br />if one of the listed mods is not available anywhere just let me know!\n<br />\n<br />be shure that no parts of the above mods are unintentionally overwritten by other mods! \n<br />\n<br />\n<br />[u]recommended options if preset does not appear as expected:\n<br />[/u]i use unp skinny body as my body base. if you encounter problems try this\n<br /> as your body base. you may also enhance your npc and other races with \n<br />my high res cute fingers seamless body options.  \n<br />i recommend my teeth replacer for ningheim and other races ([url=http://www.nexusmods.com/skyrim/mods/73328/?]better teeth for human races[/url]) or my first and slightly different version (see file folder)\n<br />if you do not use ks hairdos hdt option you may have to change the hdt hair to a non hdt one in the racemenu.\n<br />same if you use other warpaint than stojas warpaint, eye or eyebrow options.\n<br />\n<br />if something still does not show as indended check your modlist first. you\n<br /> may correct some errors in your loaded preset if you change eye and  hair in racemenu. \n<br />in all other cases you may pm me or just leave a post with a description of your problem.\n<br />\n<br />[u]installation of the preset:[/u]\n<br />- unpack and put the preset file in the folder data&#92;skse&#92;plugins&#92;chargen&#92;presets (if you use mo it also can be the \n<br />overwrite folder depending on your installation settings).\n<br />- open console ingame an type showracemenu\n<br />- select ningheim race female if not already set\n<br />- chose \"preset\" button in the menu and then the preset load button and load the desired preset.\n<br />- you may change and optimize the preset now. don't forget to save it in a new preset and to save the game.\n<br />\n<br />you see parts of sylva dragon jewels in some of my screenshots.\n<br />\n<br />if you use the unp mature skin texture mod (cute fingers skin mod is recommended) be shure to use my\n<br /> patched face skin texture uploaded as optional file. otherwise my \n<br />face presets doesn't match the sceenshots. i patched the skin around the \n<br />eyes to preserve as much detail as possible. all credits for this texture go to the original author.**\n<br />\n<br />for your standard npc and female characters you may try in additionally my other [url=http://www.nexusmods.com/skyrim/mods/82568/?]cute fingers unp mod options[/url]\n<br />\n<br />[b]you may watch [url=https://www.nexusmods.com/skyrim/search/?gsearch=xrayy&amp;gsearchtype=authors&amp;tab=mods]my other skyrim mods[/url][url=http://www.nexusmods.com/skyrim/mods/searchresults/?quicksrc_name=File+name&amp;quicksrc_auth=xrayy&amp;quicksrc_game=110] here[/url]﻿[/b].\n<br />\n<br />* you are welcome to post your preset screenshot in the user image section * \n<br />thank you for trying my presets and have fun playing skyrim!\n<br />\n<br />[u]credits[/u]\n<br />thanks  to all the modders of the listed mods above for making this preset possible\n<br /> and\n<br /> thank you  to all for trying it and especially to the obviously rapidly decreasing number of downloaders still taking their time to leave an endorsment!",
  "categoryId": "34",
  "version": "1.1",
  "author": "xrayy",
  "createdUnix": "1519594099",
  "updatedUnix": "1519745506",
  "containsAdultContent": false,
  "uploadedBy": "xrayy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000267218",
      "name": "lynn ningheim preset",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2",
      "fileName": "lynn ningheim preset-89826-1-0.7z",
      "uploadedUnix": "1519593964",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/425caab38ef6f0f63d40805be9cc8d79490d79cf39e20277d24b73d2298e19e3/analysis/1519594024/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/lynn%20ningheim%20preset-89826-1-0.7z?fid=1000267218&ttl=1535879735&ri=8192&rs=8192&setec=b0c478f20a69784edc1b734a8749bf2d"
    },
    {
      "fileId": "1000267313",
      "name": "lynn ningheim preset",
      "version": "1.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "3",
      "fileName": "lynn ningheim preset-89826-1-1.7z",
      "uploadedUnix": "1519687875",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/97978ea95dc50524b8fa7d19fbad1a3f27328dbf8bce62a95677fb03b7643a37/analysis/1519688161/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/lynn%20ningheim%20preset-89826-1-1.7z?fid=1000267313&ttl=1535879736&ri=8192&rs=8192&setec=ddad68170927a8643eb53a8b99dcd7c4"
    },
    {
      "fileId": "1000267347",
      "name": "lynn ningheim preset",
      "version": "1.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "3",
      "fileName": "lynn ningheim preset-89826-1-1.7z",
      "uploadedUnix": "1519745506",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/97978ea95dc50524b8fa7d19fbad1a3f27328dbf8bce62a95677fb03b7643a37/analysis/1519745522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/lynn%20ningheim%20preset-89826-1-1.7z?fid=1000267347&ttl=1535879736&ri=8192&rs=8192&setec=2d314bba539e0d7e9ea24fa457eacd99"
    }
  ]
}