{
  "modId": 89832.0,
  "modName": "MONSTERaider's Masculine Beast Races - EBDR Texture Pack",
  "summary": "A set of textures made by MONSTERaider compiled and sorted for use with MongoMonk's mod, Everybody's Different Redone, which allows NPCs to use textures from any EBD Texture Pack you've installed at random.",
  "descriptionHtml": "[size=3][color=#ffff00]=Description=[/color]\n<br />[/size]This mod contains various sets of textures from two of MONSTERaider's mods, Masculine Argonians and Masculine Khajiits, set up for use with MongoMonk's mod, Everybody's Different Redone. If you do not know what those mods are, I would suggest going over and checking them out, as they are very unique and interesting!\n<br />\n<br />Contains three different texture variants for each race (Furry, Abs, and Humanoid for Khajiit. More Scales, Less Scales, and No Scales for Argonian.).\n<br />Available in 1k, 2k, and 4k (Khajiit Only) resolutions.\n<br />Supports Vanilla, SOS (2k only), and SOS Lite.\n<br />\n<br />[color=#ff0000]SOS version requires Schlongs of Skyrim.\n<br />SOS Lite version requires Schlongs of Skyrim Lite.[/color]\n<br />Vanilla version does not require anything!\n<br />\n<br />I did not create these textures, merely compiled them, so please direct any questions/compliments pertaining to the textures themselves over to MONSTERaider! If you have a question or bug report for the FOMOD installer or any missing textures, drop a post for me to look at with as much information of the bug that you have on posts section of this mod's page.\n<br />\n<br />[color=#ffff00][size=3]=Installation=[/size][/color]\n<br />Mod Organizer (Recommended):\n<br />1) Download the file via Mod Organizer and install! (Make sure to follow the FOMOD installation instructions.)\n<br />2) Next, use EBD's SkyProc patcher to enable to mod for use.\n<br />3) After the SkyProc patcher is completed, make sure to move all files created by the patcher out of your Overwrite folder and into your EBD Temp folder. (Or whatever you named your EBD SkyProc files folder.)\n<br />4) Done!\n<br />\n<br />I genuinely do not know how to use EBD's SkyProc patcher manually, so there will not be any manual installation support, sadly.\n<br />[size=3]\n<br />[color=#ffff00]=Update Logs=[/color]\n<br />[/size]u1.0 2/25/18: Released\n<br />\n<br />[color=#ffff00][size=3]=Credits=\n<br />[/size][/color]MONSTERaider - Masculine Khajiits and Masculine Argonians\n<br />MongoMonk - Everybody's Different Redone",
  "categoryId": "29",
  "version": "1.0",
  "author": "TheDarkInfinity",
  "createdUnix": "1519609464",
  "updatedUnix": "1519609464",
  "containsAdultContent": false,
  "uploadedBy": "TheDarkInfinity",
  "primaryFile": null,
  "files": []
}