{
  "modId": 8985.0,
  "modName": "Dragonboon",
  "summary": "Aside from being well-crafted, Dragonboon is designed to compliment Voice-wielding fighters: Equipped shouts manifest on strike (if there is enough charge). The sword takes a short while between strikes to Manifest again but most effects it produces last for the cooldown duration.",
  "descriptionHtml": "Replaces the Akaviri Katana laying on the table in Sky Haven Temple with Dragonboon and the one-handed skill book next to it with Part one of Hylgrym (which also grants one-handed skill), the sword and former owner\\'s origin story.\r\n\r\nAside from being well-crafted, Dragonboon is designed to compliment Voice-wielding fighters: Equipped shouts manifest in some capacity on strike (if there is enough charge). The sword takes a short while between strikes to Manifest again but most effects it produces last for the cooldown duration.\r\n\r\nPlease note that the manifestations are expensive; each manifestation costs 2000 currently and the sword can retain up to 20,000 in charge.\r\n\r\nNote: At this time not *all* Shouts are supported. Dragonrend and a few scattered others do not produce effects. They will in the next update but the effects will be entirely custom.\r\n\r\nNext update: Magicka will slowly trickle into the weapon and recharge it. You may also absorb/convert a Dragon Soul to fully charge the weapon.\r\n\r\n(Currently planned) For the future: A side-quest related to making the sword more stable and boost its effects against Dragons; unique characters; additional parts to Hylgrym; effects to note when the sword is ready/charging/spent; a new dungeon to enhance the Dragonboon\\'s general power; new custom effects, and new art for the sword itself.\r\n\r\nSome examples:\r\n\r\nSlow Time will produce a Time Slowing effect while also enhancing your speed to 150%.\r\nDragonBreath (Fire) will produce an inferno centered on you.\r\nElemental Storm will grant a powerful Stamina restoration effect.\r\nUnrelenting Force will stagger those around you.\r\nThrow Voice will turn you Invisible and cast a Detect Life variant that functions outdoors.",
  "categoryId": "55",
  "version": "1",
  "author": "Firgof",
  "createdUnix": "1328990613",
  "updatedUnix": "1328990952",
  "containsAdultContent": false,
  "uploadedBy": "Firgof",
  "primaryFile": null,
  "files": [
    {
      "fileId": "29112",
      "name": "Base",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Base-8985-1.zip",
      "uploadedUnix": "1328990952",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/cbac9e15ee4033feb400af90f0444c257a2d604645865d23b966719da4061744/analysis/1406670963/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Base-8985-1.zip?fid=29112&ttl=1535768161&ri=8192&rs=8192&setec=a928c8578ee6c10cac726f0d7eae4207"
    }
  ]
}