{
  "modId": 89949.0,
  "modName": "Leifr Thalmorcrusher - A Lorefriendly Stubborn Nord Follower",
  "summary": "This mod adds a standalone Male Nord Follower to the Game, who can probably be found in Jorrvaskr, Whiterun. The follower uses his own custom AI Packages (currently only for Whiterun) and may or may not survive in Whiterun even without the Player Character. See mod description for more information.",
  "descriptionHtml": "[center][img]http://blackwhitedesign.de/00LEThalmorcrusher/lethalmorcrusher---logo---nexus_40567966882_o.png[/img]\n<br />\n<br />[img]http://blackwhitedesign.de/00LEThalmorcrusher/forever-free-by-aluckymuse-and-the-creation-kids_40628612401_o.png[/img]\n<br />\n<br />[img]http://blackwhitedesign.de/00LEThalmorcrusher/lethalmorcrusher---tripletmodpage---01_39918249384_o.png[/img][/center]\n<br />\n<br />[img]http://blackwhitedesign.de/00LEThalmorcrusher/modpage-whyangwhat_38818455890_o.png[/img]\n<br />[size=2][b]WHY ANOTHER FOLLOWER FOR SKYRIM?[/b] The big question - simple answer. Skyrim has a fairly huge lack of [b]lore-friendly male followers[/b] as many of you might know. But there is a bit more to it. During the time I played this ole' stubborn Nord hunk, I received a lot of requests for his Face Preset or a Follower Version and of course, the answer was always [b]no[/b]. At some point in February 2017, I finally crash his playthrough successfully and never get back to it or found the mood to fix all the problems with his mod setup. And after nearly a year of thinking about it, I decide to make him a standalone follower for your games, that he may or may not see the rest of Skyrim and Solstheim too.\n<br />\n<br />[b]AND WHAT DOES THIS MOD DO?[/b] It adds a Black Cat in a Sack, full of flees. More specifically - [b]It adds a complete standalone male follower with some nice added features to your game.[/b] That means, NO other mods are needed to make him look like in the screenshots. He comes with his own personalized class, inspired by his playthrough, and will use One-Handed-Weapons only when needed. Very well-known as an excellent archer, there are rumors that his [b]old wooden bow[/b] can drain health from his enemies as his [b]old rusty sword[/b] will do either. After his long-term vacation in Valenwood he has returned to Skyrim and was last seen with nothing more than some [b]old rugged trousers[/b] and [b]handcuffs[/b] on, so he will be thankful for everything you hand over to him.[/size]\n<br />\n<br />[img]http://blackwhitedesign.de/00LEThalmorcrusher/modpage-thalmorcrusher_39918249024_o.png[/img]\n<br />[size=2]A fully roleplay based background will be added soon (probably within this week). I'm sorry for this, but I need to translate some things first.\n<br />\n<br />[img]http://blackwhitedesign.de/00LEThalmorcrusher/modpage-overviewfacts_40629242451_o.png[/img]\n<br />[size=2]# [b]Name:[/b] Leifr EinvarrThalmorcrusher\n<br /># [b]Estimated Age:[/b] 38 Years of crushing Thalmor Heads for some cookies\n<br /># [b]Marital Status:[/b] Divorced, two times\n<br /># [b]Ranks:[/b] Well-known Thane of Whiterun, convened by the Highpriestess Saarh as Harbinger of the Companions, honorable member of the [b]Evil Company[/b]\n<br /># [b]He likes:[/b] Crushing Thalmor Heads all over Skyrim and back again. Baking cookies out of their remains. Have a good supper full of meat and a lot of ale.\n<br /># [b]He absolutely dislikes:[/b] Thalmor, Altmers of all kind, [b]MAGIC IN EVERY FORM. He does not only don't like it - he HATES it! Superstitiousness included[/b].\n<br />\n<br /># [b]Where can I find him?[/b]\n<br />Fair question. I can't tell, would be the right answer, but that depends on your specific InGame Time and Day. \n<br />[b]Probably [/b]the ole' stubborn hunk can be found in [b]Jorrvaskr, Whiterun[/b]. If not, you should have a look at the [b]Features and AI Package[/b] Section of this mod page.\n<br />\n<br /># [b]Is there anything else important I need to know?[/b]\n<br />There are probably many things you should know about this Elder Nord, but I will stick with some technical features and CK related things for now.\n<br />\n<br />• [b]Race:[/b] Nord (unedited pure Nord Bastard)\n<br />• [b]Body Height:[/b] 1.1 / [b]Body Weight:[/b] 0.66 and you should keep him that way, otherwise, you will have an ugly neck seam and no warpaints and tattoos\n<br />• [b]Used Vanilla Voice[/b]: NordMaleBrute (you may remember the deep baritone of Farkas or Stenvarr, right?)\n<br />• Albeit his two divorces, Leifr Thalmorcrusher [b]is marriageable[/b]\n<br />• [b]Leveling added:[/b] Yes. He will level with the player from 1 - 100. \n<br />• [b]Combat Style:[/b] He comes with his own Class which prefers Stamina and Health to chose over Magicka for some obvious reasons. He absolutely prefers the Bow!\n<br />• [b]Perks:[/b] Inspired by his playthrough I tried to find a good balance between his perks (Archery, Light Armor, One-Handed, Sneak)\n<br />• [b]Factions &amp; Relations:[/b] As a citizen of Whiterun he has to fulfill his duties and has some added Factions. (Companions and Whiterun City Factions).\n<br />[/size]\n<br />[img]http://blackwhitedesign.de/00LEThalmorcrusher/modpage-featuresandaipackages_38818455970_o.png[/img]\n<br />[size=2][b]This Follower was heavily inspired by the awesome [url=https://www.nexusmods.com/skyrim/mods/65013]Immersive Citizens - AI Overhaul[/url] by Shurah,[/b] because there is one thing I can't stand for longer than a minute. Stucked NPC's with no individual behavior. Let's just take Jenassa as a perfect example of how it should NOT be. She's sitting in the Drunken Huntsman for 24 hours a day, eating some food, is apparently not sleeping (you can hire her at Day and Night Time) and yes - that's all. Hurray Bethesda, well done. I start using this mod when Shurah released it here and never stop doing it. I can't recommend it highly enough. To see what is possible was the basis for Leifr Thalmorcrusher as a follower because this ole' Nord would never sit anywhere for longer than an hour (exceptions are the drinking parties every evening at the Bannered Mare). So I start searching the Creation Kit Pages, watched some rare tutorials and start trying to give him a personal schedule for 7 Days a week.\n<br />\n<br />[b]But ... what are AI Packages and how do they affect NPCs?[/b]\n<br />[quote]The Package system consists of a number of components:\n<br /># All Actors have a Package Stack, an ordered list of potential behaviors.\n<br /># These stacks are composed of Packages, individual behaviors that the Actor can perform.\n<br /># Periodically, the game will reevaluate each Actor's Package Stack. The topmost package in the stack whose conditions are satisfied will be run.\n<br /># ... Source: [url=https://www.creationkit.com/index.php?title=Category:Packages]Here![/url][/quote]\n<br />[b]I wish you good luck hunting the ole' stubborn hunk:[/b]\n<br />No spoilers attached, no ReadMe included. Good luck hunting the ole' Nord.\n<br />The likelihood of accidentally running into him is much bigger than finding him on an attempt. Here are just a few clues where you should start looking. [b]IF NOT ON SATURDAY OR SUNDAY[/b] InGame date, you should be able to find him SOMEWHERE in Jorrvaskr or The City of Whiterun. Don't forget to check the Inns, the Shops, and the market. If everything went right it should be [b]nearly impossible to catch him up on the weekend[/b] where he patrols several routes in the wilds.\n<br />\n<br />[b]Do the AI Packages affect the use of Mods like AFT, EFF and/or UFO?:[/b]\n<br />The simple answer is no. In some more details - Additionally to his personal AI Packages, he uses some \"Default Packages\" for things like eating, drinks, and sleep, which will run when he travels with you. After several tests with the Vanilla Follower System whose I've done by myself, I hand over the mod file for some testing to [b]TGSTYLE24[/b] and [b]BLACKMAID[/b] [/size] who have tested him with EFF and AFT intensively. He will continue fulfilling his schedule when you release him as your follower back in Whiterun (for more cities see Future Plans and Updates). You can easily use him with mods like AFT, EFF, UFO and/or the Vanilla Follower System. [/size]\n<br />\n<br />\n<br />[center][img]http://blackwhitedesign.de/00LEThalmorcrusher/lethalmorcrusher---tripletmodpage---02_38818456050_o.png[/img][/center]\n<br />\n<br />[img]http://blackwhitedesign.de/00LEThalmorcrusher/modpage-requirementsinstallation_40586812062_o.png[/img]\n<br />[size=2][b]Requirements - Name it a bad habit:[/b]\n<br />Skyrim.esm - Update.esm - Dawnguard.esm - HearthFires.esm - Dragonborn.esm\n<br />\n<br />[b]Installation &amp; Uninstallation:[/b]\n<br />Use NMM or any other Modmanager to download and install the files - OR - the simple manual installation. Extract the 7z-archive and copy the content into your Skyrim Data Folder.\n<br />\n<br />If he dont please you and you decide to uninstall him do it via NMM, MO... or manually and delete the following folders and files:\n<br />\n<br /># data/meshes/actors/character/00LEThalmorcrusher/\n<br /># data/meshes/actors/character/FaceGenData/Facegeom/00LEThalmorcrusher.esp/\n<br /># data/textures/actors/character/00LEThalmorcrusher/\n<br /># data/textures/actors/character/FacegenData/Facetint/00LEThalmorcrusher.esp/\n<br /># data/Leifr Einvar Thalmorcrusher.esp[/size]\n<br />\n<br />[img]http://blackwhitedesign.de/00LEThalmorcrusher/modpage-updates_39918324024_o.png[/img]\n<br />[size=2]# Add a NO DLC Version\n<br /># Polish his current AI Packages\n<br /># Add AI Packages for the other Major Cities\n<br /># Add a Werewolve Patch (well, if I can figure out how to do it that he will not be invisible)[/size]\n<br />\n<br />[img]http://blackwhitedesign.de/00LEThalmorcrusher/modpage-translationsconverting_39918326124_o.png[/img]\n<br />[size=2]Although I'm not an English native speaker, I run all my games in English. If you want to translate this mod for the Nexus Pages simply throw a PM on me, but [b]I will never give permissions to translate this file for other sites[/b]. If you want to, you don't need to ask. The answer is NO. Same goes for a conversion of the mod to SSE. I didn't even have SSE installed and I can't and won't give permission to convert him over to the Skyrim Special Edition. I take this stuff very seriously as everyone should. So please respect my decisions. [/size]\n<br />\n<br />[img]http://blackwhitedesign.de/00LEThalmorcrusher/modpage-creditspermission_39918249144_o.png[/img]\n<br />[size=2]His assets and appearance are a result of the great work from the following mods and authors. Many thanks to all of you for your hard work and making many things a lot more beautiful!\n<br />[b]PLEASE CHECK AND READ THE PERMISSIONS TAB CAREFULLY !![/b]\n<br />\n<br /># [url=https://www.nexusmods.com/skyrim/mods/2488]Better Males - Favored Soul Meshes - Flaccid Version[/url] by Chris57 and FavoredSoul\n<br /># [url=https://www.nexusmods.com/skyrim/mods/4141]High Res Face Maps for Men[/url] by Geonox\n<br /># [url=https://www.nexusmods.com/skyrim/mods/13722]The Eyes of Beauty[/url] by Gabriel Mailhot as LogRaam \n<br /># [url=https://www.nexusmods.com/skyrim/mods/30411]Brows[/url] &amp; [url=https://www.nexusmods.com/skyrim/mods/28363]Beards[/url] by Hvergelmir aka [url=https://www.nexusmods.com/skyrim/users/30027]lthot[/url]\n<br /># [url=https://www.nexusmods.com/skyrim/mods/73605]Ixum's Tattoos for Males[/url] by ixum - Thank you so much for the permission to use your wonderful assets.\n<br />\n<br /># [b]My dear TGSTYLE24[/b] for testing and Screenshots\n<br /># [b]BlackMaid[/b] aka Heike for testing\n<br /># My husband and my beloved daughter for their love and patience\n<br />\n<br /># Bethesda for creating the most beautiful Game ever\n<br /># Creation Kit, The NifSkope Team, The NifMerge Team, GIMP[/size]\n<br />\n<br />[img]http://blackwhitedesign.de/00LEThalmorcrusher/modpage-recommendations_40586671092_o.png[/img]\n<br />[size=2]# [url=https://www.nexusmods.com/skyrim/mods/13457]Face Light[/url] by tktk1\n<br /># [url=https://www.nexusmods.com/skyrim/mods/65013]Immersive Citizens - AI Overhaul[/url] by Shurah\n<br /># [url=https://www.nexusmods.com/skyrim/mods/20900]Bandanas of Skyrim[/url] by volvaga0 (also check brokefoot's retexture)\n<br /># [url=https://www.nexusmods.com/skyrim/mods/13551]Blindfolds of Skyrim[/url] by volvaga0 (also check brokefoot's retexture)\n<br /># [url=https://www.nexusmods.com/skyrim/mods/58626]Northguard Ranger Armor[/url] by Elianora - HIS FAVORITE PIECE OF ARMOR !!\n<br /># [url=https://www.nexusmods.com/skyrim/mods/81073]Apachii Divine Elegance Store[/url] by Apachii and Urshi\n<br /># [url=https://www.nexusmods.com/skyrim/mods/60788]Redguard Shields - Hammerfell Armoury[/url] by farinelli \n<br />\n<br /># [b]ENBs used in the Screenshots:[/b] Rampage ENB, Version 1.7, ENBinary 308, Tweaked.[/size]",
  "categoryId": "66",
  "version": "1.0",
  "author": "Miss Isleen",
  "createdUnix": "1520181004",
  "updatedUnix": "1520181004",
  "containsAdultContent": false,
  "uploadedBy": "Isleen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000267712",
      "name": "Leifr Einvarr Thalmorcrusher - Loose Files",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28793",
      "fileName": "Leifr Einvarr Thalmorcrusher - Loose Files-89949-1-0.7z",
      "uploadedUnix": "1520180971",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e682dea6fb8102bf9906888f7d9f5942c9712e6bb9204193946502db72162bcf/analysis/1520181224/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Leifr%20Einvarr%20Thalmorcrusher%20-%20Loose%20Files-89949-1-0.7z?fid=1000267712&ttl=1535879922&ri=8192&rs=8192&setec=f8dd4870414b620ec3da55fc13caf86c"
    }
  ]
}