{
  "modId": 89940.0,
  "modName": "The Royal Castle",
  "summary": "Castle Volkihar with style, dungeon, trainingroom and much much more... Bonus: \"Armor/Weapons set\" and \"InstaCast Spell Ring\"",
  "descriptionHtml": "***********************************\n<br />This mod gives the player their own Castle Volkihar, only with a little more flare. The main goal is to have a home with both function and style. So not only can you get all your crafting and storing out of the way, you can also take a second and enjoy the fruits of your hard labor.\n<br />\n<br />A lot of work went into this Mod so any donations would be well received. Thanks\n<br />***********************************\n<br />\n<br />********** Warning ********\n<br />\n<br />This Mod Requires all DLCs and the latest version of SKSE. CBBE and FNIS animations is optional but highly suggested.\n<br />\n<br />****** Update ******\n<br />\n<br />I added a tes5edit cleaned version of the .esp file. This should fix the issue with the destruction perk tree that was brought up in the forum. If anyone is still having this or any other problems please post a comment so I can address the issue.  Thanks\n<br />\n<br />****** The Royal Castle *******\n<br />\n<br />Castle Royal includes but is not excluded to...\n<br />\n<br />All crafting stations except staff enchanter (I like Neloth having the only one).\n<br />Five staff members (all women, sorry I'm a guy), one for every trade.\n<br />A library, kitchen, master bedroom, workshop, rooms for the staff, kids and much more...\n<br />\n<br />As seen in other mods, all NPC's (except kids) will undress when sleeping and showering.\n<br />\n<br />****** The Royal Courtyard *******\n<br />\n<br />Has pool and fish-hatchery.\n<br />All staff members wear bathing-suits while here.\n<br />You can play games with your kids here as well.\n<br />Can fast-travel to.\n<br />\n<br />****** The Royal Armory *******\n<br />\n<br />Has a bunch of weapon racks and displays.\n<br />\n<br />Mannequins are custom coded to prevent vanilla bugs. This eliminates the duplication exploit however.\n<br />\n<br />****** The Royal Training Room *******\n<br />\n<br />Has three training exercises, Combat&#92;Magic&#92;Archery. Completing the Magic or Archery challanges grants a skill increase.  \n<br />\n<br />****** The Royal Bunk House *******\n<br />\n<br />You can have up to six followers stay in the bunk house. They will be given a schedule and thus sleep, eat and so on.\n<br />\n<br />Just bring them to either the bunk house or docks then ask them to stay.\n<br />\n<br />You can also dismiss them if you want to replace them with someone else. Again, they must be at the bunk house or docks to do so.\n<br />\n<br />Warning: Dismissing a Blade follower will cause them to just stand there. So, unless you absolutly want them to stay perminently, I wouldn't recruit them.\n<br />\n<br />****** The Royal Docks *******\n<br />\n<br />This is where your recruited follower will hangout during the day. They will practice combat, work and eat.\n<br />Has door that leads to bunk house.\n<br />Can fast-travel to.\n<br />\n<br />****** The Royal Dungeon *******\n<br />\n<br />Has eight holding cells. If a prisoner is in one, you can select various ways to torture them.\n<br />Using the controls next to the throne allows you execute a prisoner in one of three ways, death by batterng-ram, disentergration or beheading.\n<br />Use the Royal Banish spell, found in the Royal Chest, to send almost anyone to the dungeon. Their loot gets stored in the chest next to the executioners coffin.\n<br />\n<br />***** The Royal Armor *****\n<br />\n<br />The set is equivalent to ebony armor and require ebony-smithing to improve.\n<br />\n<br />Light and Heavy versions.\n<br />\n<br />Works with all Light&#92;Heavy Armor perks.\n<br />\n<br />Two sets of both can be found inside the Royal Chest in the workshop.\n<br />\n<br />***** The Royal Weapons *****\n<br />\n<br />All weapons are the equivalent to Ebony and require ebony-smithing to improve.\n<br />These weapons cannot be sold or disenchanted.\n<br />Two sets of both can be found inside the Royal Chest in the workshop.\n<br />\n<br />***** The Royal Jewelry *****\n<br />\n<br />The rings equip to the middle finger on both hands (slots 58 and 59) so if anything is equipped there it will be unequipped.\n<br />\n<br />Royal Blood Ring:\n<br />\n<br />Allows for Royal Weapons to cast Bloodskal blade effect.\n<br />\n<br />Any aimed spell (fire, ice, summon etc) cast in left-hand will fire instantly (doesn't work with right-hand, don't know why, just doesn't). Also works with staffs.\n<br />\n<br />Royal Ability Ring:\n<br />\n<br />Adds a small boosts to various stats.\n<br />\n<br />***** Wife and Kids ******\n<br />\n<br />You can adopt up to two children as normal. When adopting, you will be given the option for Castle Royal, choose it, done and done.\n<br />There is a ready made spouse (Princess) who hangs out in the masterbedroom and sells clothes. If you choose to marry her and select Castle Royal, she will then start a routine.\n<br />You can also move everyone back and forth between houses if you like.\n<br />\n<br />***** Home Invasions ******\n<br />\n<br />Every three to four weeks Castle Royal will be attacked by everything form Skeevers to Bandits. A notification will pop up letting you know which one and where to look.\n<br />The first time you enter bandits will have taken over. If your staff is around, they will help but be ready, there're a lot of them. (might slow your pc as well)\n<br />\n<br />***** Extras ******\n<br />\n<br />Royal Banish Spell, sends almost any NPC to the Royal Dungeon. Excludes creatures, dwarvens, children and essiential NPCs. Use causiously as some NPCs will consider using the spell on them a crime. Also, once the dungeon is full(8 max), the spell won't work.\n<br />Royal Death Root, basically a grow-able Jarrin Root.\n<br />Royal Eyes, white vampire eyes.\n<br />Royal Weapons and Royal Blood-Strike casts a custom white-fire effect on targets.\n<br />\n<br />***** Bugs&#92;Fixes *****\n<br />\n<br />Bug 1: Lightning spell stops firing.\n<br />\n<br />Fix: This happens sometimes when you fire them too rapidly (all other spells are fine). Just save and reload or\n<br />travel, this seems to work for me.\n<br />\n<br />Bug 2: DO NOT WEAR THE BLOOD RING WHEN RIDING DRAGONS, especially before fighting Mirrak, you will die for some reason. Also unequip it before fist-fights or the poison cloak will anger your opponent.\n<br />\n<br />*******************************************************************\n<br />\n<br />Well, that is all. I hope you enjoy this mod. !SKYRIM FOR EVER!\n<br /> \n<br />If you just want the InstaCast ring, go [url=http://www.nexusmods.com/skyrim/mods/83985/?]here[/url].\n<br />\n<br />If you just want the InstaCast ring and Weapon/Armor set, go [url=https://www.nexusmods.com/skyrim/mods/88656/?]here[/url].",
  "categoryId": "68",
  "version": "1.0",
  "author": "Dwon410",
  "createdUnix": "1520147801",
  "updatedUnix": "1520641467",
  "containsAdultContent": false,
  "uploadedBy": "Dwon410",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000267673",
      "name": "Castle Royal",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "390317",
      "fileName": "Castle Royal-89940-1-0.7z",
      "uploadedUnix": "1520147196",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Castle%20Royal-89940-1-0.7z?fid=1000267673&ttl=1535879909&ri=8192&rs=8192&setec=00d890a9557b3e108cb4d5e7cee8e0d5"
    },
    {
      "fileId": "1000268071",
      "name": "Fix",
      "version": "1.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "494",
      "fileName": "Fix-89940-1-0.7z",
      "uploadedUnix": "1520641467",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5c102850bb440ad48ad04eecd3e06709b3ee5d4fce07df84c7a31839d8757480/analysis/1520641750/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fix-89940-1-0.7z?fid=1000268071&ttl=1535879909&ri=8192&rs=8192&setec=ed7d53c1af67f2bc5cf5a3b8eda3b57b"
    }
  ]
}