{
  "modId": 89996.0,
  "modName": "ENDERAL main menu music and wallpaper replacer",
  "summary": "This mod raplace vanila ENDERAL main menu music and background wallpaper",
  "descriptionHtml": "Sorry for my poor English first of all!! So!! This mod raplace vanila ENDERAL main menu music and background wallpaper. To more depressive, sadly sad track and background. The wallpaper and music that, I think, are more in keeping with the mood and entourage of this wonderful game. I mean ENDERAL. Because I do not have the conscience to call this a modification. This is a full, huge game.\n<br />   The music used in the menu is also taken from ENDERAL. A track called Enderal - fleischlos (1st version) I'm just delighted with this melody. For a long time I have not heard anything more sad and touching. Thanks to the composer.\n<br />\n<br />  Installation: Copy the contents of the archive to the Date folder. Confirm the replacement of files if required. If you want to replace only music. And do not want to replace the wallpaper in the menu. Move only the MUSIC folder to the Data folder.\n<br />  I hope you enjoy this modification! All of you, have a nice day and good mood, guys !!",
  "categoryId": "106",
  "version": "1.0",
  "author": "Nathan1380",
  "createdUnix": "1520428607",
  "updatedUnix": "1520428607",
  "containsAdultContent": false,
  "uploadedBy": "nathan1380",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000267897",
      "name": "ENDERAL main menu music and background replacer",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1616",
      "fileName": "ENDERAL main menu music and background replacer-89996-1-0.zip",
      "uploadedUnix": "1520427620",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/17ad3c19b329f82220b6dce88944f78547cee3e0fdb3ef715dd8f69b1df43966/analysis/1520427908/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENDERAL%20main%20menu%20music%20and%20background%20replacer-89996-1-0.zip?fid=1000267897&ttl=1535879981&ri=8192&rs=8192&setec=2df73ec5ba2b568c47500ebcb6e9ba3a"
    }
  ]
}