{
  "modId": 9000.0,
  "modName": "Breezehome Basement by Ekkii",
  "summary": "This mod adds a new area, the basement, to the player house in Whiterun, staying true to the look and feel of the place and without immersion-breaking elements.",
  "descriptionHtml": "[center][img]http://i.imgur.com/IDw1k.png[/img][/center]\n<br />\n<br />One day in Last Seed, 4E 201, a stranger wandered into Whiterun carrying the most unbelievable news. Jarl Baalgruf the Greater himself listened to the stranger, a survivor of the first dragon sighting in centuries. After aiding the Jarl and keeping the people of Whiterun safe, the stranger was accepted into the town and allowed to buy a house.\n<br />\n<br />The stranger, key in hand, went to inspect the abode the locals called Breezehome. His new home. It was rather small, but it could be a nice place with the right furniture and decorations. There was enough place in the first floor for a fire pit and living room, a dining room and an extra room, which could be used as some sort of studio, working area, or even a child's bedroom if he ever met the right someone. Upstairs there was a small room, a short hallway and a decent-sized main bedroom. On his way down, the stranger noticed a trapdoor beneath the stairs. It was locked, but the key to the house was a perfect fit. Unlocking it, he went downstair, into the basement...\n<br />\n<br />\n<br />[center][img]http://i.imgur.com/d7eAS.png[/img][/center]\n<br />\n<br />This mod adds a new area, the basement, to the player house in Whiterun. The Breezehome Basement is rather modest: it doesn't include saunas, an army of mannequins, a personal merchant and fence, nude girls and a pet dragon. This mod was developed by Ekkii to be used in our own games, and is intended to be as lore-friendly as possible. The goal is to expand Breezehome in a believable way, adding functionality to the house while keeping it balanced.\n<br />\n<br />Everyone has a different playing style, so if you're looking for a more spacious house for your character but feel that any of the mansion or castle mods available is too much, feel free to give this basement a try.\n<br />\n<br />\n<br />[center][img]http://i.imgur.com/KXpRF.png[/img][/center]\n<br />\n<br />After installing this mod you'll find a locked trapdoor underneath the stairs of Breezehome. Unlocking the trapdoor with the Breezehome Key will lead you to the Basement, a new spouse-and-follower-friendly area roughly the same size of Breezehome's first floor. The first time you enter it will be abandoned and empty, just like the house upstair, and you'll be able to buy furnishings for it by talking to the Jarl's Steward.\n<br />\n<br />The furnishing packages, as described in the [i]Whiterun Home Decoration Guide[/i], are the following:\n<br />\n<br />[b]Armory furnishings[/b] - 1000 septims\n<br />\n<br />The Armory is the first area of the basement. Buying the [i]Armory furnishings[/i] package will provide two mannequins for armor display, racks to display four weapons, a chest and two weapon display cases as well as a modest smithing area consisting of an anvil, workbench, grindstone, tanning rack and miscellaneous containers for crafting supplies.\n<br />\n<br />[b]Basement Living Room furnishings[/b] - 550 septims\n<br />\n<br />The Living Room is the biggest area of the basement. The [i]Basement living room furnishings[/i] package adds a fire pit to the center of the room with two chairs and a small table in front of it, a table with a mead keg and some tankards for an evening drink, a small dining area consisting of a table and two chairs, and a screen that serves as a division between the two spaces.\n<br />\n<br />[b]Library furnishings[/b] - 450 septims\n<br />\n<br />This option adds a library section to your living room, consisting of a desk and chair, a strongbox, three standard bookshelves and a special novelty shelf over the desk. In total, you can store up to 96 books.\n<br />\n<br />\n<br />[center][img]http://i.imgur.com/fpxRi.png[/img]\n<br />[b]OPTIONAL FILE[/b]\n<br />[url=http://www.skyrimgems.com][img]http://www.skyrimgems.com/images/badge_featured_sm.png[/img][/url][/center]\n<br />\n<br />Has your Dovahkiin found that special someone yet? If the answer is yes, you might have noticed that they don't ever leave the house, even if they \"open a store\" and without ever going out they somehow manage to make some money each day. If that sounds kind of immersion-breaking, you might find Ekkii's [url=http://skyrim.nexusmods.com/mods/10319]Spouse Life[/url] interesting. In short, it gives your spouse a new life, a market stall for their shop and some new activities to keep them busy throughout the day. Sounds nice, doesn't it? If you want to give it a try, it's available together with Breezehome Basement in the Files Tab.\n<br />\n<br />\n<br />[center][img]http://i.imgur.com/WpT2Q.png[/img][/center]\n<br />\n<br />This mod has been rebuilt and tested with the latest version of Skyrim. We don't know if it'll work with older patches (and why would you be using an old patch anyway?).\n<br />\n<br />[b]INSTALLATION[/b]\n<br />\n<br />The installation is simple:\n<br />\n<br />[b]Nexus Mod Manager users:[/b]\n<br />Select one version (Basement plus Spouse Life, or Standalone Basement) and click 'Download with Manager'. Once it's downloaded simply activate it in NMM.\n<br />\n<br />[b]Manual installation:[/b]\n<br />Download one version (Basement plus Spouse Life, or Standalone Basement) and unzip the contents of the file to your Data folder. Activate the plug-in with your mod-manager of choice or in the Data Files section of the Skyrim Launcher.\n<br />\n<br />[b]UNINSTALLATION[/b]\n<br />\n<br />If for some strange reason you wish to uninstall this mod (and I can't think of a reason why you'd want to do that), first remove any items you might have stored in the basement and save your game in another cell, preferably outside of Breezehome.\n<br />\n<br />[b]Nexus Mod Manager users:[/b]\n<br />Deactivate the mod in NMM. That's it.\n<br />\n<br />[b]Manual installation:[/b]\n<br />De-activate the plug-in with your mod-manager of choice or in the Data Files section of the Skyrim Launcher, then remove \"Ekkii Breezehome Basement.esp\" and Ekkii Breezehome Basement.bsa\" from your Data folder.\n<br />\n<br />[color=#ff0000][b]UPDATING[/b][/color]\n<br />\n<br />If you're coming back to update from an older version you'll need to take special precautions while upgrading. It's nothing serious, don't worry. The mod has been pretty much rebuild from scratch and simply replacing the files won't work. Following this steps will ensure a hassle-free upgrade:\n<br />\n<br />1. Go to your basement and get all your items. Yes, you'll have to redecorate, sorry.\n<br />2. Save your game outside of the basement and outside of Breezehome. Any other cell will do.\n<br />3. Close the game and uninstall, deactivating and removing the plug-in EkkiiBreeze.esp from your Data folder.\n<br />4. Download and activate your desired version of the mod as per the instructions above.\n<br />\n<br />It might be necessary for you to also tell your spouse to move elswhere (if they're currently living in Breezehome) and immediately after to move back to Breezehome for them to pick up the right sandbox packages.\n<br />\n<br />[b]CONFLICTS AND KNOWN ISSUES[/b]\n<br />\n<br />This mod has been carefully crafted to avoid conflicts. In fact, we use it with several other mods without any issue. The only possible conflict is with other mods that affect the [i]WhiterunBreezehome[/i] cell, the [i]RelationshipMarriageFIN[/i] or [i]HousePurchase[/i] quests, the [i]MarriageSpouseWhiterun24x6SandboxSleepPlayerHouse[/i] package or the [i]DecorateWhiterunView[/i] dialog view. In other words, any mod that affects the sandbox behaviour of spouses, modifies Breezehome or adds/removes buyable furnishing for it is bound to cause conflicts. Anything else should play nicely with Breezehome Basement.\n<br />\n<br />There is a known issue where the dialogue option to tell your spouse to move somewhere else once they're settled in a house will not appear. This seems to be an issue with Hearthfire itself, and not with this mod. We were able to reproduce the issue in different saves, with and without our mod but weren't able to pinpoint the cause. The best workaround we found was to buy Breezehome before starting the marriage quest, but even then the dialogue option disappeared for one of our test characters without using this mod.\n<br />\n<br />[b]CREDITS AND PERSMISSIONS[/b]\n<br />\n<br />Author: Ekkii\n<br />Contact: Message elgatoenlaluna on the Nexus Sites.\n<br />\n<br />Do not modify this file whitout asking first. We've allowed other authors to tweak our mods in the past, so if you have something interesting in mind chances are we're going to say yes. Also, do not, for any reason whatsoever, upload this mod to the Steam Workshop. Neither Ekkii nor I use it or have any interest in using it, and we will not provide any updates or help over there. Thanks!",
  "categoryId": "67",
  "version": "0.99",
  "author": "Ekkii",
  "createdUnix": "1328994718",
  "updatedUnix": "1358051651",
  "containsAdultContent": false,
  "uploadedBy": "elgatoenlaluna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000001990",
      "name": "Breezehome Basement by Ekkii - Spouse Life Bundle",
      "version": "0.99",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30",
      "fileName": "Breezehome Basement by Ekkii - Spouse Life Bundle-9000-0-99.7z",
      "uploadedUnix": "1358051612",
      "modVersion": "0.99",
      "virusScanUrl": "https://www.virustotal.com/file/53f397d0d83873bc1c44284f6dd7000ef47a24d44e2feb0a8ee8b7eea39ed95f/analysis/1407350825/",
      "changelogHtml": " Mod has been remade from scratch. <br/> \n Hearthfire compatibility revised. Hearthfire DLC is required. <br/> \n Updated the Basement + Spouse Life bundle to work correctly with Hearthfire. <br/> \n The basement now starts empty and furnishings can be bought from the Jarl&#39;s Steward. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20Basement%20by%20Ekkii%20-%20Spouse%20Life%20Bundle-9000-0-99.7z?fid=1000001990&ttl=1535768192&ri=8192&rs=8192&setec=a6e02c32c6ef2a3a99e5110b40fa1c51"
    },
    {
      "fileId": "1000001991",
      "name": "Ekkii Breezehome Basement - Standalone",
      "version": "0.99",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "Ekkii Breezehome Basement - Standalone-9000-0-99.7z",
      "uploadedUnix": "1358051651",
      "modVersion": "0.99",
      "virusScanUrl": "https://www.virustotal.com/file/048d71d7f16a5f973d7e3e9d6a09bb1d4816b10a4cb968e4560e0c107a70035d/analysis/1407350825/",
      "changelogHtml": " Mod has been remade from scratch. <br/> \n Hearthfire compatibility revised. Hearthfire DLC is required. <br/> \n Updated the Basement + Spouse Life bundle to work correctly with Hearthfire. <br/> \n The basement now starts empty and furnishings can be bought from the Jarl&#39;s Steward. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ekkii%20Breezehome%20Basement%20-%20Standalone-9000-0-99.7z?fid=1000001991&ttl=1535768193&ri=8192&rs=8192&setec=c242a07046f10b1ea15260737c53c4b6"
    }
  ]
}