{
  "modId": 90026.0,
  "modName": "Stronger Magic",
  "summary": "Modifies the magic system to make magic stronger.",
  "descriptionHtml": "[b]Overview\n<br />\n<br />[/b]Have you ever felt weak while playing as a magic-oriented character? Running out of magicka without making serious damage to your opponent? Forced to heavily exploit the Enchant skill, and similar stuff? Do you want to change that?\n<br />\n<br />Well, look no further. This mod makes magic stronger but (IMHO) not overpowered, so that your mage will be decently effective in combat without being omnipotent. \n<br />\n<br />[b]\n<br />Detailed description\n<br />\n<br />[/b]Precisely, this mod does the following simple things.\n<br />\n<br />[list=1]\n<br />[*]Removes the penalization to the magicka regeneration rate due to combat. This means, during combat your character's magicka will regenerate as fast as outside combat. \n<br />\n<br />\n<br />[*]Modifies the perks labeled \"Novice\", \"Apprentice\", \"Adept\", \"Expert\", \"Master\" in each of the magic schools Alteration, Conjuration, Destruction, Illusion, Restoration as follows:\n<br />\n<br />[list]\n<br />[*]for the schools of Alteration, Destruction, Illusion, Restoration: each perk decreases the casting cost by 50% AND increases the spell [u]magnitude[/u] by 50% for every spell matching the perk level;\n<br />[*]for the school of Conjuration: each perk decreases the casting cost by 50% AND increases the spell [u]duration[/u] by 50% for every spell matching the perk level.\n<br />[/list]\n<br />[*]The cost of dual casting a spell is reduced to 2 x (SPELL COST) from 2.8 x (SPELL COST) and magnitude is increased to 2.5 x (SPELL MAGNITUDE) from 2.2 x (SPELL MAGNITUDE).\n<br />\n<br />\n<br />[/list]\n<br />That's all, folks. ﻿\n<br />\n<br />\n<br />[b]Requirements\n<br />\n<br />[/b]Skyrim version 1.9.32.\n<br />\n<br />\n<br />[b]Installation\n<br />\n<br />[/b]Just drop the .esp file in your Data directory and activate it in the Launcher.\n<br />\n<br />\n<br />[b]Uninstallation\n<br />\n<br />[/b]Deactivate the .esp file in the Launcher and remove it from your Data directory.\n<br />\n<br />\n<br />Enjoy!",
  "categoryId": "93",
  "version": "1",
  "author": "sgrunt137",
  "createdUnix": "1520531590",
  "updatedUnix": "1520531590",
  "containsAdultContent": false,
  "uploadedBy": "sgrunt137",
  "primaryFile": null,
  "files": []
}