{
  "modId": 9005.0,
  "modName": "Better Honeyside old page",
  "summary": "Many changes to Honeyside, the player home in Riften.",
  "descriptionHtml": "Moving this file to a new page since I think I messed up commenting when uploading it the first time. This is the first file I\\'ve ever released so I didn\\'t know what I was doing when I up loadeded it. This will be removed once I\\'ve finished the new page for it.\r\n\r\n\r\nWhen playing my thief in Skyrim I fell in love with the player home in Riften, Honeyside. There were a few things that bothered me about the home though. The biggest being that outside the home in Riften there is open space below the door, yet inside below the entrance there is the enchanting area that couldn\\'t fit there. (See the screenshots if you\\'re curious.)\r\n\r\nSo the mod started out as a fix for that and a way for me to get a feel for the new CK. As I made it I thought of more things I would like to change so it became a mod that alters nearly everything in Honeyside.\r\n\r\nThe location of every room has changed, but the upgrades function as normal and you will still need to buy them. The decorating guide in game hasn\\'t been altered.\r\n\r\nAlchemy Lab is now the Enchanting and new additional Smithing room.\r\nKitchen is now the Alchemy Lab.\r\nMaster bedroom is now the Kitchen.\r\nGuest bedroom is now the Master bedroom.\r\nEnchanting room is now the Bathroom. (Upgraded with bed room.)\r\nThe Guest bedroom is in a new location. (Upgrades when you become Thane of Riften.)\r\n\r\nI\\'ve tested the mod as best I can if you find any bugs please let me know. I replaced the Navmesh by hand to fit the new rooms so NPC\\'s should be able to navigate the house. I did run into one problem while modding, no lights with shadows will work. So none of the lights in the home will cast shadows. I hope to fix this later when I find out why the bug is happening.\r\n\r\nAll the containers in the home are \\\"safe\\\" and won\\'t respawn. Since many weapon racks and containers have been replaced, moved or deleted I HIGHLY suggest you remove any items from Honeyside and back up your save game before using this mod. To making moving easier you can use the console command player.setav carryweight followed by a number. Before doing that you should check your carry weight and write down the value so you can be sure you\\'ve restored it to normal later. To add 1000 carry weight would look like \\\"player.setav carryweight 1000\\\" without quotation marks, to remove it would look like \\\"player.setav carryweight -1000\\\" again without quotations.\r\n\r\nAgain many weapon racks and containers have been replaced, moved or deleted I HIGHLY suggest you remove any items from Honeyside. As with any mod, backing up your save game before use is a good idea.\r\n\r\n\r\n ",
  "categoryId": "67",
  "version": "1.0",
  "author": "Mercami",
  "createdUnix": "1328995815",
  "updatedUnix": "1329173082",
  "containsAdultContent": false,
  "uploadedBy": "Mercami",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30643",
      "name": "Better Honeyside v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "Better Honeyside v1-9005-1-0.zip",
      "uploadedUnix": "1329173082",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a4e9f59fd8a4f07559a2d5ffc395b203fe0a60903c2037fca7073001d5b33272/analysis/1406679742/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Honeyside%20v1-9005-1-0.zip?fid=30643&ttl=1535768202&ri=8192&rs=8192&setec=3a7651f0632dc65bf62a9bb4071137dc"
    }
  ]
}