{
  "modId": 90067.0,
  "modName": "Rydis - Character Preset - DELETED",
  "summary": "Rydis is a character preset made for RaceMenu. This is my first mod I've ever made. You will need the mods listed in the description if you want your character to look the same.",
  "descriptionHtml": "[center][font=Arial][color=#c27ba0][size=6][i]Meet Rydis[/i][/size]\n<br />[/color][/font][font=Arial]\n<br />[size=3][color=#ead1dc]Rydis is my first character preset for RaceMenu. She is a Nord. The mod will not work if you do not have the same mods, all of which I've provided below. Of course, you may use your own body shape, skins, hairstyles, etc. But I recommend using the same mods to achieve a similar look, to avoid conflicts, and ensure everything runs smoothly. If you decide to ignore this, Rydis will inevitably fail to work. [/color]\n<br />\n<br />[/size][size=6][i]Required[/i][/size]\n<br />\n<br />[/font](SKSE is always required, so please ensure you have it installed before downloading RaceMenu)[font=Arial][size=3]\n<br />\n<br />RaceMenu [/size]\n<br />[size=3]Caliente's Beautiful Bodies Edition - CBBE[/size]\n<br />[size=3]SG Female Textures Renewal (CBBE)[/size]\n<br />[size=3]Natural Eyes (or) Improved Eyes Skyrim[/size]\n<br />[size=3]Freckle Mania 2[/size]\n<br />[size=3]KS Hairdos -  Renewal[/size]\n<br />[size=3]Brows [/size]\n<br />\n<br />[color=#c27ba0][size=6][i]Installation[/i][/size][/color]\n<br />\n<br />[color=#ead1dc][size=3]Rydis is packed into a 7zip file. The actual file is a simple .jslot file, which is how RaceMenu presets are saved. If everything goes accordingly to plan (cross your fingers) downloading the mod should simply add the .jslot file to your presets file in your SKSE folder. This is the path you can follow to make sure it's there:[/size]\n<br />\n<br />[size=3](Most people leave it on the C: drive or even an external hard drive. It is where your Skyrim files go... which is usually along the lines of the following:)[/size]\n<br />\n<br />[size=3]steamapps &gt; common &gt; Skyrim &gt; Data &gt; SKSE &gt; Plugins &gt; CharGen &gt; Presets[/size]\n<br />\n<br />[/color][/font][font=Arial][color=#ead1dc][size=3]You may rename her if you wish, but I would recommend leaving her file name the same if you ever need to delete the preset! [/size][/color]\n<br />\n<br />[size=6][i]MOD AUTHOR'S REQUEST[/i][/size]\n<br />\n<br />[color=#ead1dc][size=3]I recommend dressing Rydis in any outfits compatible with a CBBE body. However, I am not an avid fan of slutty armors or clothing, and I do not tolerate nude images of my characters. If you want to add images of Rydis to the photo gallery, I insist you respect my wishes and at least have her genitalia covered. Anything I deem disrespectful will be pulled from the gallery at once. Thank you. [/size]\n<br />\n<br />[size=3]Please remember to endorse the mod if you happen to like it. I welcome constructive criticism and feedback. Rydis will not be altered in any way unless I choose to update her and add new files. I am very new to modding - I've only just gotten into screenarching - and I have no idea at the time if this will become a hobby or not.  [/size][/color]\n<br />\n<br />[size=6][i]Permissions &amp; Credits[/i][/size]\n<br />\n<br />[color=#ead1dc][size=3]All mods used to create Rydis belong to their respective authors. I claim nothing as my own.[/size]\n<br />[size=3]The Elder Scrolls V: Skyrim belongs to Bethesda, who I must thank for such a customizable and great game, even after nearly seven years![/size]\n<br />[size=3]Rydis cannot be used, uploaded, recreated, or shared in any way or form.[/size]\n<br />[/color][/font][font=Arial][color=#ead1dc]\n<br />And lastly... thank you for taking the time to check out my first mod. Cheers![/color][/font]\n<br />\n<br />[/center]",
  "categoryId": "29",
  "version": "1.1",
  "author": "User_20662789",
  "createdUnix": "1520695325",
  "updatedUnix": "1520695325",
  "containsAdultContent": false,
  "uploadedBy": "User_20662789",
  "primaryFile": null,
  "files": []
}