{
  "modId": 90086.0,
  "modName": "Sirin Gassil - Follower",
  "summary": "Adds a half Nord/half Dark Elf follower to the game.",
  "descriptionHtml": "[font=Arial][size=3][i][color=#ff7700][center]Sirin Gassil - Follower[/center][/color][i][b] [center][i][i][color=#1e84cc](Just a small follower mod)[/color][/i][/i][/center][/b][/i][/i][i][center]﻿[/center][/i][/size][/font][font=Arial][size=3][color=#fff2cc]   ﻿BACKSTORY: Sirin Gassil [i](pronounced sereen gah-seel)[/i] is a half-Nord/half-Dark Elf from the hamlet of Creshoal in Skyrim's Western Reach. Because of the harsh environment, this wilderness north of The Divide has never been mapped, and consequently, few people know that it exists, and no one really knows just exactly where it is located, which suits it's residents as most of them have tainted histories. Sirin's father, Tomar Sonat, was a blacksmith and metal shaper hailing from Markarth, who served for a time in the employ of the Jarl until it was rumored that he was revealing overheard state secrets to certain suspected leaders of the Forsworn revolution conspiracy faction. Fleeing the city under cover of night, he barely escaped the Jarl's executioner and fled northward into the western borderlands. Whether or not he was guilty, would have been irrelevant. Leaving the Reach was his only option. Upon stumbling across Creshoal, a small town buried in the mountains, and finding it's inhabitants to be unbiased about his situation, he settled there and changed his surname to Gassil (his mother's maiden name). Here he met and married a good looking Dumner woman named Ayasa Gulbani, whose parents were traded to a wealthy local as slaves by a greedy merchant from Morrowind for the price of six horses and 1000 gold. Sirin inherited her mother's good looks and her father's Nord skintones, although she sports a full head of black hair. She has her mother's Dunmer eyes, but slightly pink instead of red, and her mother's pointed ears. But she has her father's very human face, fair skin, and\n<br />slightly aggravated disposition.           \n<br />\n<br />   ﻿ Taught to defend herself at an early age, Sirin is proficient with a bow and can wield twin katanas like child's play. Her mother taught her the art of alchemy and magic, so she is self sufficient and very deadly. But when her parents died from a sudden sub-zero storm that produced an inescapable avalanche, Sirin at the age of twenty-three, went forth on her own. Alas, she quickly found that Skyrim as a whole was mostly prejudiced against anyone with Dunmer features, dark or light. Even the Dunmer themselves avoided associating with 'lightskins' or 'half-breed Dunmer'. Sirin developed a keen sense of  awareness and managed to avoid trouble while looking for her niche. She eventually ended up in Windhelm, where there was a large Dunmer population, and temporarily settled there. They accept her for what she is, but show her no privilege or special consideration. She goes outside the gates to hunt for food, and makes enough selling pelts to buy a little mead to keep the chill out of her bones. Having no defined direction in life, she heard a story while sipping a mead at an inn. It told of a legend called the Dragonborn, and it is beleived that a new Dragonborn has arisen. She somehow knows she is destined to meet and serve the Dragonborn with her unique skills. But how does she find this legend of Skyrim? Is the Dragonborn real? It is rumored this dragon slayer stops over now and again in Windhelm whilst traveling to Solsteim. Now she patiently waits at Candlehearth Hall, contemplating what she must do to find this new age hero. Should she wander aimlessly looking for this godlike idol? Perhaps the Dragonborn might enter Candlehearth Hall and take note of her. She wonders how long she will have to wait.[/color]\n<br />\n<br />  ___________________________________________________________________ [i] [/i][i] [/i][i] \n<br />\n<br />[/i][color=#00ffff][i]NOTE: The fancy armor Sirin is wearing is called [b]Raven Witch[/b]. If you want Sirin to look like the screenshots, you will have to download the armor mod [b](Raven Witch Armor and Apex Werewolf -Raven Witch)[/b] by Zerofrost on the Nexus. I personally think this armor mod is appropriate and gives Sirin a boatload of class. The armor is practical and functional, looks amazing and comes with accessories such as a cape and a mask. One of the best light armors I have seen. Full endorsement by me. You can get the earrings by downloading HN66's mod on the Nexus [b](HN66s Earrings_1_5)[/b]. I think they are a great asset to her looks.There are silver as well as gold earrings.[/i] [/color][b][color=#ffff00]I [u]do not[/u] provide these armors in my mod. You will have to download them from their authors.[/color]\n<br />[/b]\n<br />[color=#ff7700]EQUIPMENT:Sirin has default basic leather light armor; cuirass and boots only, and she uses vanilla body textures. But, you will need ApachiiHair.esm, ApachiiHairFemales.esm, and ApachiiHairStyles.esp, otherwise she will be bald.  \n<br />\n<br />She has an Ebony bow, two katanas, and some mage skills including sustained ward and lightning shock. When in sneak mode she will become invisible to enemies. She will level with the player and is also a healer. She has no other weapons by default, so you have to give them to her. \n<br />\n<br />She is compatible with EFF and Convenient Horses. I have not tested her with any other follower control mods. Her default behavior is aggressive, although she will not jump in front of you and steal your glory. Nor does she start fights, but she certainly will finish them. She is warrior class by default. \n<br />\n<br />Sirin is not a yakker. She will not blather on about trivial or meaningless topics. She uses vanilla even-toned voice dialogs, so you won't be talking a lot. She is available for marriage. She can be found hanging out at Candlehearth Hall in Windhelm.  [/color]\n<br />\n<br />[i][color=#00ffff]NOTE: This is my very first follower mod,and I'm sure there are mistakes somewhere, so take it easy on me, ok? I don't\n<br />mind constructive criticism, but, if I see a \"WTF\" post, just know right now you'll get no response from me. [b]I make no guarantees![/b] If she doesn't work for you, I'll see what I can do,but I am limited by my inexperience. She is not an uber follower so don't expect miracles from her. Otherwise, play with her, amuse yourself. She is loyal and resilient. She is essential so you can't kill her. You could disable her though, if you like.[/color][/i][i][color=#00ffff] [/color]\n<br />\n<br />[/i][i][color=#ffff00]English only. Not compatible with SkyrimSE. All DLCs should be installed. SKSE is not required, but recommended. Unzip this file into your Skyrim data folder. You can also use Nexus Mod Manager. I don't have Mod Organizer, but I'm sure it will do just as well. Also, I have not uploaded this to Steam because of reported problems with their servers. [/color][/i][/size][/font]",
  "categoryId": "96",
  "version": "1.0",
  "author": "Varkonas_Norse",
  "createdUnix": "1520781768",
  "updatedUnix": "1520806981",
  "containsAdultContent": false,
  "uploadedBy": "varkonasnorse",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000268190",
      "name": "Sirin Gassil - Follower",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1969",
      "fileName": "Sirin Gassil - Follower-90086-1-0.zip",
      "uploadedUnix": "1520776029",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9809d9ae4697b00390ed22b8ac4f7f41c2c4650c7d8890dffcf019f28209f951/analysis/1520776397/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sirin%20Gassil%20-%20Follower-90086-1-0.zip?fid=1000268190&ttl=1535880077&ri=8192&rs=8192&setec=a4de87c4ec12a7af34e1037efd4c3ed9"
    },
    {
      "fileId": "1000268253",
      "name": "SirinGassilFix-1.1",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "2016",
      "fileName": "SirinGassilFix-1.1-90086-1-1.zip",
      "uploadedUnix": "1520806981",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3fce44ba3a05d3f767fdeeb73f0e908b6a4ea68eebdb29fd686f8dad43cd73ed/analysis/1520807179/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SirinGassilFix-1.1-90086-1-1.zip?fid=1000268253&ttl=1535880078&ri=8192&rs=8192&setec=416ea2ccd7e3a50a55f13f1d0a5cf9cf"
    }
  ]
}