{
  "modId": 90137.0,
  "modName": "Super Guia de Modding Skyrim ENB ptBr English - DELETED",
  "summary": "Outro guia para modificação Total de Skyrim com a inclusão de algumas correções de erros que todos que já tentaram modificar Skyrim encontram!<br />en Another Skyrim Total Modification Guide with the inclusion of some bug fixes that everyone who has ever tried to modify Skyrim will find!",
  "descriptionHtml": "[size=4][b]Outro guia para modificação Total de Skyrim com a inclusão de algumas correções de erros que todos que já tentaram modificar Skyrim encontram! Feito pra quem nunca fez ou quer modificar totalmente Skyrim de maneira organizada.[/b][/size][color=#ffe599](en) Another Skyrim Total Modification Guide with the inclusion of some bug fixes that everyone who has ever tried to modify Skyrim will find! Made for those who never did or want to modify totally Skyrim organized.[/color][size=4][b]É um longo caminho pra quem decide modificar totalmente skyrim e uma grande comunidade de modders envolvidos nesse processo pra te ajudar e concluir o que eu chamaria de outro skyrim, porque será um novo jogo e uma nova experiencia e atualizada que infelizmente ainda é unica, poucos jogos tem um gameplay que se equipare ao de skyrim.[/b][/size][color=#ffe599](en) It is a long way for those who decide to total modify skyrim and a large community of modders involved in this process to help you to play what I would call another skyrim, because it will be a new game and a new and updated experience, that unfortunately is still unique, few games have gameplay that compare with skyrim.[/color][b][size=4]Eu utilizei diversos guias para modificação de skyrim ao longo do tempo e enfrentei incontáveis problemas que tentarei adicionar nesse guia e ajudar a comunidade! aqui alguns deles:[/size][/b][color=#ffe599](en) I've used several skyrim modification guides over time and I've countless issues that I'll try to add to this guide and help the community! here are some of them:\n<br />\n<br />[/color][size=3][url=https://www.nexusmods.com/skyrim/mods/76373]Skyrim Ultimate Guide[/url]﻿\n<br />[/size][size=3]Principal guia completo e com várias configurações de ENB[/size][size=3]﻿\n<br />[url=https://www.nexusmods.com/skyrim/mods/30936]Real Vision ENB[/url]﻿\n<br />[/size][size=3]Mais usado e mais compatível ENB com guias para ajudar\n<br />[/size][size=3]﻿[url=https://www.nexusmods.com/skyrim/mods/50214]Speed and Stability Guide[/url]﻿\n<br />[/size][size=3]Guia que certamente pode te ajudar a resolver muitos outros problemas\n<br />[/size][size=3]﻿[url=http://wiki.step-project.com/Guide:Skyrim_INI]Skyrim ini Guide (External)[/url]﻿\n<br />[/size][size=3]Configuração Original de Skyrim muito útil para modificação[/size]",
  "categoryId": "82",
  "version": "0.1",
  "author": "CabeloRnR",
  "createdUnix": "1521032013",
  "updatedUnix": "1521032013",
  "containsAdultContent": false,
  "uploadedBy": "CabeloRnR",
  "primaryFile": null,
  "files": []
}