{
  "modId": 90134.0,
  "modName": "Brother Kody Companion_Forever Immortalized In Skyrim - DELETED",
  "summary": "Adds Kody a brother and a friend who parted this earth way too soon.",
  "descriptionHtml": "[center]\n<br />\n<br />[size=5][color=#6d9eeb]This was a request mod from Kody's big brother to have him forever immortalized in Skyrim. Kody passed about three years ago from struggling with addiction. Now he can live forever in Skyrim. He comes with his Sword Of Life that is blessed by his soul that beams from the heavens to enhance his sword with power and speed. You can hang out with him by the fire and toast with him fruitful wine. Before you part with him on your journey be sure to read him his story of a final journey with his brother and may his soul be forever blessed in all of Tamriel. [/color]\n<br />\n<br />[color=#00ffff]Kody's Journey\n<br />By: RayneBrimstone\n<br />(Taken from the book on the table.)\n<br />\n<br />After morning the loss of his brother Kody, the Dragonborn felt like he could no longer go on being the hero. Saving all those lives, not being able to save his own ate at him for awhile. For months he would go to every crypt and ruin he could find hoping to go down in a fight of steel vs steel to take his place in Sovngarde to be with his brother once more. One night after leaving the Deadman's Drink he made his way to Lakeview Manor. He spotted A boy fighting off bandits while his brother was lying lifeless on the ground barely clinging to life after an overdose of Skooma. The Dragonborn stepped in and slaughtered the bandits. The boy was grateful but was in tears because he did not want to lose his little brother. This pulled at his heartstrings because he had lost Kody to a Skooma overdose years before.  He quickly gave the young boy a healing potion and brought him back from the edge of the Void. The two boys looked at one another with tears in their eyes and hugged. The Dragon born escorted the boys back to their parent's house.  Unknown to him, Talos saw this selfless act brought Kody back from Sovngarde with a second chance at life. Talos said to him, \"Your brother has earned you a second chance at life. You were taken before your time because of foolish acts. Do not waste this gift. Be there for one another. Be his sword as he will be your shield.\" Kody sought out his brother. He made camp at the entrance of the Lost Valley Redoubt. The Dragonborn was on his way to recover Hroldfir's Sheild. Little did he know that he would find the greatest treasure of all times. He saw a small camp and the fire was going and the traveler was drinking his favorite, Black-Briar Reserve. He asks the traveler if he could spare a bottle. He was invited over to the fire. As soon as the young traveler handed the bottle to him their eyes locked. They both had tears coming from their eyes as they both asked \"Brother? There was a long pause as they stared at each other.  The Dragonborn hugged the young traveler as hard as he could and picked him up off the ground. \"Kody, you-you're alive? How can this be?\" \"Put me down and I will tell you all about it you big lug.\" He put him down and they both laughed. Kody explained how Talos brought him back. As they were about to put out the fire, Forsworn were headed towards them. They looked at one another. Kody said, \"Are you ready for fun?\" The Dragonborn replied, \"With you back at my side there is nothing we can't handle.\"  \"Quit being a milk drinker and let's kick some Forsworn ass!\" The Dragonborn laughed. They killed every last one and brought back the shield. What happened after that is another story all together.........[/color]\n<br />[color=#ffff00]Also be sure to check this other mod out that was also done for Kody&gt;[/color]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/81048]In memory of Kody (Requested by RayneBrimstone)[/url]\n<br />\n<br />\n<br />[color=#6d9eeb]Stats&gt;[/color]\n<br />[color=#6d9eeb]Location: Lost Valley Redoubt ([/color]coc[color=#6d9eeb] lostvalleyredoubt01) (You can't miss the beam of light from the sky).[/color]\n<br />[color=#6d9eeb]Essential[/color]\n<br />[color=#6d9eeb]Health, Magicka, and Stamina: 500[/color]\n<br />[color=#6d9eeb]Speed: 165[/color]\n<br />[color=#6d9eeb]Combat: Heavy on melee and ranged.[/color]\n<br />[color=#6d9eeb]Healing: Smart Heal (SM) system that heals Kody and you when you need it. (You can still die).[/color]\n<br />[color=#6d9eeb]Class: Spellsword[/color]\n<br />\n<br />\n<br />[color=#6d9eeb]Credits:[/color][/size]\n<br />\n<br />[color=#6d9eeb]Custom Tattoo's\n<br />[/color]\n<br />[url=https://www.nexusmods.com/skyrim/mods/2488]Better males - Beautiful nudes and faces[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/6831]KS Hairdo's[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/13722]The Eyes Of Beauty[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/16977]Oriental weapon and armor set[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/20338]ORIENTAL ARMOR SET-FAVORED ARMOR SHIRTLESS VARIANT MALE[/url]\n<br />\n<br />[/center]",
  "categoryId": "66",
  "version": "1.0",
  "author": "Majestic Mod Squad",
  "createdUnix": "1521011475",
  "updatedUnix": "1521012238",
  "containsAdultContent": false,
  "uploadedBy": "User_44526602",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000268451",
      "name": "Kody Follower",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "19126",
      "fileName": "Kody Follower-90134-1-0.rar",
      "uploadedUnix": "1521011453",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f04d4f482d6e374c78795df2f5253edb73d7b25188cab56435a60ad0b2a8f89/analysis/1521011649/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kody%20Follower-90134-1-0.rar?fid=1000268451&ttl=1535880133&ri=8192&rs=8192&setec=de6198ae3bb614f76e936250b625456b"
    },
    {
      "fileId": "1000268452",
      "name": "No Tattoo Patch",
      "version": "1.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "3191",
      "fileName": "No Tattoo Patch-90134-1-1.rar",
      "uploadedUnix": "1521012238",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/46dd337c378d8a6944c1e0b0c2a9de063b34ee0ef986bfb8c61475192698b78a/analysis/1521012493/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Tattoo%20Patch-90134-1-1.rar?fid=1000268452&ttl=1535880133&ri=8192&rs=8192&setec=7885a4a0153677412e6afb2f794b3760"
    }
  ]
}