{
  "modId": 90135.0,
  "modName": "Dwarven Aetherial Shield Rework",
  "summary": "Reworks the Aetherial shield enchant.",
  "descriptionHtml": "I love dwemer things, lore, architecture. Dawnguard brought us The Aetherial Forge, I was exceedingly happy to see the addition but always felt the there was only 1 useful item. Now i'm aware theres dozens of aetherial based mods adding items/enchants. When all i wanted was just a tweak, nothing overpowered nothing that seemed unimmersive. This playthough i'm making a dwemer tank and wanted a dwemer shield that i felt was both worth while and something I could work towards. After looking for days for a mod for this shield or really any good dwarven shield I decided to just\n<br />\n<br />[b]This is what this mod does:[/b] Changes the enchant completely from the annoying \"fade\" enchant too a custom enchantment based on the Auriel's Shield and scripts. Tweaks some of the defenses to reflect more end game shields.\n<br />\n<br />[b]Armor[/b]:\n<br /> 26(vanilla) - 32 (modded)\n<br />\n<br />[b]Enchant[/b]: \n<br />(vanilla)Shield bash turns foes/friends into ghosts force fear/calm for 15 secs which is by far one of the most annoying enchants. I hate fear on any enemies let alone ones that now can't take any damage for 15 secs.\n<br />(modded) First off increases block by 20%, Secondly using the same scripts as Auriel's Shield every blocked hit will store power and you can release it with a full charge shield bash IE while blocking you hold down your attack button. Let me phrase this like the wiki does. \n<br />\"\n<br />\n<br />[list]\n<br />[*]The shield stores the energy of any attacks that are blocked. This stored energy can build up the more attacks are blocked. [url=http://elderscrolls.wikia.com/wiki/Power_Bash_(Skyrim)]Power bashing[/url] releases the energy.\n<br />[*]The strength of the energy released depends on how charged the shield is. 5 hits is the level 1 charge, 10 is the level 2 charge, and 15 is the level 3 charge. The shield will glow when charged.\n<br />[*]The energy attack can be compared with the different stages of the [url=http://elderscrolls.wikia.com/wiki/Unrelenting_Force_(Skyrim)]Unrelenting Force[/url] [url=http://elderscrolls.wikia.com/wiki/Shout]shout[/url].[list]\n<br />[*]The level 1 charge staggers enemies, like Fus.\n<br />[*]The level 2 charge has a stronger staggering effect like Fus Ro.\n<br />[*]The level 3 charge sends enemies flying like the full Fus Ro Dah.\n<br />[/list]\n<br />[/list]\"\n<br />\n<br />[b]I will say I could not get the \"shield will glow\" effect to work\n<br />[/b]Too be frank even if i could... i find it annoying :x Just be sparing wish full shield bash, you'll still have normal shield bash until BOOM.\n<br />\n<br />[b]Instilation\n<br />[/b]Pretty much the same as every other file, I recommend NMM but if you prefer manual  \n<br />\n<br />1. Download the file\n<br />2. Find your skyrim folder, Helpful hint if you don't want to find it. In steam right click the program in this case Skyrim go to preferences&gt;Local files [i](tab)[/i]&gt;  Browse local files. Boom your there now you can unzip the file there.\n<br />3.Activate the file in the load order via game launcher, Should work fine with or without SKSE. I however use and recommend SKSE always.\n<br />\n<br />[b]Uninstall[/b]\n<br />Just delete the file BOOM your done, the shield'll go back to it's default state.\n<br />\n<br />[b]Recommended Dwemer based mods[/b]\n<br />[url=https://www.nexusmods.com/skyrim/mods/72051/]Aetherial Shield Replacer[/url][b]﻿ [/b](Texture and mesh change)\n<br />[url=https://www.nexusmods.com/skyrim/mods/53950]Animated Dwarven back pack[/url] (not compatible with Sorcery armor) \n<br />[url=https://www.nexusmods.com/skyrim/mods/57825]Dwarven Sorcery Armor[/url]﻿ (Not compatible with really any other armor/accessories mod at all, uses accessories slots 54-60 every armor piece uses at least 2 armor slots. Makes me cry ever tim)\n<br />[url=https://www.nexusmods.com/skyrim/mods/87727]Dwarven Power Armor- Mihail Armors[/url]﻿\n<br />[url=https://www.nexusmods.com/skyrim/mods/61483]Silverstead - A Buildable Dwemer Estate[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/37675]Secrets of the Dwemer[/url]\n<br />\n<br />[b]Incompatibilities[/b]\n<br />I'd assume anything that messes with the auriel's shield scripts? this mod itself doesn't mess with those scripts just kind've piggy backs off the \"stored charges\" scripts so if you have a mod that changes those put this mod in the load order ahead of them and those mods if they effect the script themselves should transfer onto this shield as well. However the enchant itself is unique to this mod so any changes you have to the auriel's shield enchant will not transfer. If you by some chance run into any incompatibilities let me know? maybe i can fix it?[b]\n<br />\n<br />\n<br />[/b]\n<br />[b]If you have any requests or bug reports let me know and i'll take a look. [/b]",
  "categoryId": "54",
  "version": "1",
  "author": "Chrisraven",
  "createdUnix": "1521015176",
  "updatedUnix": "1521015176",
  "containsAdultContent": false,
  "uploadedBy": "chrisraven",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000268454",
      "name": "Aetherial Shield Rework",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Aetherial Shield Rework-90135-1.rar",
      "uploadedUnix": "1521015107",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/da85c26957645c3f660f5de3248f93be53472c3559ca1cdf10c1687e3a030572/analysis/1521015272/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aetherial%20Shield%20Rework-90135-1.rar?fid=1000268454&ttl=1535880135&ri=8192&rs=8192&setec=45247778a0df3c08fb43778cb205110f"
    }
  ]
}