{
  "modId": 90155.0,
  "modName": "Skyrim Vakia The Paralyzer GameSave",
  "summary": "Skyrim Modded GameSave - Take a shortcut through enemy filled caves starting at Pinepeak Cavern to get to High Hrothgar. From there return to Breezehome and explore a basement like new room and checkout other modded areas. Honeystrand Cave, The Alchemist Shack and good old QA Smoke (with access doors to Dawnguard HQ, Solsthiem, and Blackreach)",
  "descriptionHtml": "[size=2][color=#00ffff]Skyrim - Vakia The Paralyzer GameSave Description\n<br />\n<br />[/color]In this GameSave you start as a Male Nord, Level 11 named Vakia. Your character has completed the initial Quests and has just killed his first Dragon. You own Breezehome, Lydia is your follower (but she is not with you for the start of this GameSave). You are on your way to answer the summons of the Greybeards. You've travelled to Ivarstead and were on your way up the steps to High Hrothgar when a Wood Elf named Gwilin speaks to you about another more rewarding pathway which takes you to High Hrothgar. Gwilin tells you to go to Pinepeak Cavern and start your journey there which will take you through 3 more caves before finally getting to your destination. But, he says, it is a very dangerous journey as you must fight Trolls, Warlocks, Ice Wraiths, Falmer and Chaurus to get out. Along the way there is much treasure to be found and, in the end, you will be more combat experienced and better prepared all round for your journeys ahead.\n<br />\n<br />You thank Gwilin and head to Pinepeak Cavern. When you arrive, there is a whirling blue barrier blocking your way and a voice speaks and tells you that you cannot enter unless you leave your Armor and Weapons behind. After a while you do as the voice says and now you will be allowed to pass through the barrier. Once on the other side you find that you can't get back out. You then climb up to a small tower which contains a chest and a cage filled with wolves. The only way forward is through Pinepeak Cavern. This is the Starting point of this GameSave. Take the gear that you want from the chest and prepare yourself for battle. The Wood Elf Gwilin said that there are enemy in each Cave as well as progressively stronger weapons and armor and other loot worth fighting for. You won't find any weapons when you start, they will be on the floor of Pinepeak Cavern when you first go in as well as potions and some armor. You will have to be quick because the Trolls are coming for you at the same time. Fortunately, the entrance going into the Cave is quite and you can use your sneak skills to move around and gather up equipment off the ground before the Trolls spot you.\n<br />\n<br />Just remember that you also have the first part of the unrelenting shout and you can use that to stagger the enemy. You can also use Magicka to slow down the enemy, and another option is to evade them, quickly gather up stuff from the chests/containers, gear up and then do combat with better gear. Also make use of the Paralysis Poisons in your inventory which is applied to your weapons. Survival is in your hands. The end goal is to get to High Hrothgar. After that you can explore the new Cells/Rooms from Breezehome as well as a checking out some other modded areas (The Alchemist Shack and Honeystrand Cave). Note that there is a Change Race Menu available so that you can modify your character when you enter Breezehome for the first time, so you don't have to play the entire game as a male Nord.\n<br />\n<br />[color=#ff7700]Please check out the Readme file for more detailed info.[/color]\n<br /> \n<br />Note: I have included a Video, but I must apologize for it’s non HD quality and my scratchy voice. I’ve got a throat problem at the moment and I tend to lose my voice. Just needed to make the Video to cover a few things. Thanks for your understanding.\n<br /> \n<br />Good Gaming!\n<br />ShamanReaper57\n<br />[/size]",
  "categoryId": "43",
  "version": "v1",
  "author": "ShamanReaper57",
  "createdUnix": "1521102757",
  "updatedUnix": "1521102757",
  "containsAdultContent": false,
  "uploadedBy": "ShamanReaper57",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000268549",
      "name": "Skyrim Vakia The Paralyzer GameSave for Xbox (exs)",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2885",
      "fileName": "Skyrim Vakia The Paralyzer GameSave-90155-v1.zip",
      "uploadedUnix": "1521102191",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/9e6967b5cc68613c7ada5dc665b9445d2d49d05193f6700bf6c4d1d4c18b7d36/analysis/1521102552/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Vakia%20The%20Paralyzer%20GameSave-90155-v1.zip?fid=1000268549&ttl=1535880165&ri=8192&rs=8192&setec=e43d45d58514ed445940c7299cf9ba6b"
    },
    {
      "fileId": "1000268550",
      "name": "Skyrim Vakia The Paralyzer GameSave for PC (ess)",
      "version": "v1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2885",
      "fileName": "Skyrim Vakia The Paralyzer GameSave-90155-v1.zip",
      "uploadedUnix": "1521102405",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/ed5e77a4f071e232da4605cebcb6065efb66c64a3d81101aa5dea08f1be81003/analysis/1521102433/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Vakia%20The%20Paralyzer%20GameSave-90155-v1.zip?fid=1000268550&ttl=1535880165&ri=8192&rs=8192&setec=e6c405c93ce16388b4ddd24444c8bc58"
    }
  ]
}