{
  "modId": 90237.0,
  "modName": "The Beam",
  "summary": "NO PHOTOSHOP REQUIRED <br /><br />The Beam.<br /><br /> A modders resource tool",
  "descriptionHtml": "DOWNLAOD MANUALLY AND PLACE ON DESKTOP\n<br />\n<br />What is this?\n<br /> Its just a beam. \n<br />\n<br />Why a Beam?\n<br />Its not the beam in its self. But the panel or plane that's so interesting.\n<br />\n<br />Why so interesting?\n<br />Its all do to the way it was made.\n<br />\n<br />The way it was made?\n<br />Yes, Meshes are laid out on a UV map. This one is unique. Instead of just placing the mesh on the texture map as one unit. They broke the mesh down and placed it on different areas of the texture. Giving it a unique design.\n<br />\n<br />So what  Sounds like what we all do when making a UV map.\n<br />\n<br />No this one is different.\n<br />Most wood beams or floor panel UV's  are just placed on the texture map as one unit and adjusted to fit the texture according to there segments or faces.\n<br />\n<br />Still have not told us why so unique!\n<br />How many beams or floor panels in this game have 9 texture segments but no edge lines or segments that match where the texture changes.\n<br />\n<br />Yeah, So what.\n<br />Load any beam from the game into Nif Scope and change the texture 98% of the time it looks awful.\n<br />Now do the same with 1 of the beams from this mod.  With  a little over 31 thousand textures. You might get over 30%. Better then 2%. and If it works you can turn them 3 more ways for a different look.\n<br />\n<br /> Humm? What can I do with it?\n<br />Think of the beam as clay. What could you make from clay. This is no different its a raw material.\n<br />What I have also added in the mod besides the 9 beams are what I call trim or inlays. There are 9 of these also. 1 from each beam.\n<br />Take one of the meshes that has 8 beams pointed away from the center . Load it into Nif  Scope then go to the line that reads BSShaderTextureSet open it, \n<br />you will see 2 texture sets. The first asterisk is the one you want to change. Its the diffused  map. Double click and s window will open. If set properly it will open to where ever you have your skyrim textures saved to I have mine saved to a folder on my desk top, not in the skyrim directory. Double click a texture. I Like to use stone of any type even cave walls , Not a bad pattern right? If you change the normal map some will distort the texture to much. \n<br />\n<br />Getting better. Now what?\n<br />Well if you have 3ds Max, Maya or Blender (which is free) you can make a Boolean cut. Most Of the patterns will be hexagons. If there are certain aspects of the pattern that you want.  You will have to manually make cut. There are 3 versions of each inlay. Full beam, half beam and a plane. I use the plane for inserts. Make the cut out. If you add a shell modifier to it Then use it to stick in the floor, wall or ceiling. If you go the distance you can use that inlay to make a Boolean cut In the floor, wall or ceiling to prevent bleed through..\n<br />\n<br />What do I do with the beams?\n<br />What can you do In your 3d modeling program. If you can think it. it can be made with time and effert.\n<br />I'll  make a few things to show you some ideas and load a picture. The reason I don't give you these meshes, is because you might want it made in a different way or from a different beam. \n<br />\n<br />OK lets get into what you could make.\n<br />\n<br />New interiors that the user can change.\n<br />New furniture\n<br />A new house from scratch (Which I'm doing right now, scraped it out three  times already when I have a better idea) think of how the BYOH looks and go from there as a start\n<br />Ruins in a  dungeon.\n<br />New rugs.\n<br />Arches and supports.\n<br />Intricate patterns.\n<br />  \n<br />\n<br />What you need to work with  this Material\n<br />\n<br />A 3d modeling program 3ds max, Maya , Blender or some other that works with niffs\n<br />\n<br />Nif Scope easiest way to change a texture \n<br />\n<br />A BSA Unpacker  I use BSAopt x64 here on the Nexus But any will do.\n<br />\n<br />A dds Viewer I use DDS Viewer. it allows me to not only view but to turn the texture where I saved it. details in the forums if asked\n<br />\n<br />And last but not least  A DDS converter. I use Easy2Convert. Its used  to convert the jpeg that dds viewer made  back to dds format\n<br />\n<br />\n<br />\n<br />There all free except for the modeling program 3ds Max and Maya\n<br />\n<br />I might throw in more pices as I make them,  not sure though so we will see",
  "categoryId": "82",
  "version": "1",
  "author": "Looknot",
  "createdUnix": "1521531240",
  "updatedUnix": "1521531240",
  "containsAdultContent": false,
  "uploadedBy": "Looknot",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000268919",
      "name": "The Beam",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7473",
      "fileName": "The Beam-90237-V1.zip",
      "uploadedUnix": "1521530736",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/8e1642a4d099d5c1ac31b1ea27d9fa2d344cd407c8d2c99fc7d9377d7caae1a6/analysis/1521568786/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Beam-90237-V1.zip?fid=1000268919&ttl=1535880297&ri=8192&rs=8192&setec=3d82effd7d234fbad4143148cc7b117d"
    }
  ]
}