{
  "modId": 90268.0,
  "modName": "Enderal - English Version TRADUCAO PT-BR - DELETED",
  "summary": "Enderal é um novo jogo baseado em Skyrim. Proporciona uma experiência de jogo completamente nova com um novo terreno com a sua própria tradição e biomas diferentes, um jogo revisto e uma linha de história profissionalmente dublada com uma narrativa sombria e madura com entre 30 a 100 horas de jogo.",
  "descriptionHtml": "[b][size=4]Enderal é uma Conversão Total para The Elder Scrolls V: Skyrim - isto é, um novo jogo baseado na arquitetura central, jogo, engine e ativos de Skyrim. Está em construção há 4 anos e meio, com mais de 30 000 horas de trabalho, numa base totalmente não comercial. Ele é executado independentemente de Skyrim e fornece uma experiência de jogo completamente nova com um novo terreno com seu próprio conhecimento e biomas diferentes, um jogo profundamente revisto e uma linha de história profissionalmente dublada com uma narrativa sombria e madura. Dependendo do seu estilo de jogo, o Enderal tem entre 30 e 120 horas de tempo de jogo.\n<br />Uma terra inteiramente nova com diferentes biomas: explore as florestas exuberantes do Heartland, os vastos prados do Suncoast, as costas tropicais do Powder Desert ou as montanhas nevadas das montanhas Frostcliff. E muitos mais.\n<br />Uma narrativa principal única, escura e psicológica com voltas e mais e mais de 30 horas. de brincadeira\n<br />Várias missões secundárias e uma linha de busca de guilda (ainda a ser lançada)\n<br />Mais de 30 horas. de diálogo proferido profissionalmente, tanto em alemão e em inglês. Apresentando dubladores de renome, como Annina Braunmiller-Jest (voz alemã de Kirsten Stewart), Till Hagen (Kevin Spacey) e Bernd Vollbrecht (Antonio Banderas) para a versão alemã, e atores ingleses como Lani Minella (Skyrim) ou Dave Fennoy ( Starcraft 2, The Walking Dead)\n<br />Mais de 4 horas de trilha sonora recém-composta: faixas de batalha, trilhas de exploração, temas de personagens\n<br />Personagens multi-facetados e críveis, incluindo dois companheiros com capacidade de romance, com a sua própria linha de busca única\n<br />Um arsenal de novos ativos, que vão desde a vegetação foto-digitalizada até novos edifícios, arsenal, armas e criaturas.\n<br />Um sistema de nivelamento e habilidade completamente revisado com pontos de experiência e classes: construa sua própria classe única, combinando nove subclasses que representam um estilo de jogo diferente\n<br />Novos \"talentos\" de classe específicos e animados que substituem os dragonshouts de Skyrim e podem ser combinados para um efeito máximo: Jogue as garrafas de óleo do Vagabond para fazer seus inimigos deslizarem neles para acendê-los com o \"Arrows Flows\" do Rogue.\n<br />Novas animações feitas a mão ou capturadas por movimento para cut-scenes, danças ou ataques especiais\n<br />Bardos com mais de 10 baladas recém-compostas e canções folclóricas, interpretadas por três artistas diferentes\n<br />Combate reequilibrado destinado aos jogadores de núcleo\n<br />Próximos recursos:\n<br />Ainda lançamos regularmente correções de erros para o Enderal, que estão disponíveis no Enderal Launcher.\n<br />Enquanto isso, estamos ocupados criando novos conteúdos para a Enderal, chamados de DLC \"Enderal: Forgotten Stories\". Se você estiver interessado, poderá ler mais sobre os recursos futuros do nosso anúncio.\n<br />Várias equipes externas de localização estão ocupadas trabalhando em traduções em seu idioma. Se você quiser ajudá-los ou apenas quiser verificar se eles terminaram de traduzir o Enderal em seu idioma, você deve verificar a respectiva página do wiki.\n<br />Em primeiro lugar: Não espere uma experiência totalmente livre de bugs! Neste ponto, somos apenas um punhado de desenvolvedores ativos e testadores de controle de qualidade que precisam consertar os erros de mais de um milhão de jogadores. Estamos fazendo o nosso melhor, puxando todos os nighters sempre que podemos, mas só temos muita energia no nosso sistema além de empregos e universidade. Então, se você é uma pessoa que fica facilmente perturbada por um bug, recomendamos que espere até que o Enderal esteja tão bem corrigido quanto possível para nós.\n<br />Para uma explicação detalhada da instalação, confira este vídeo do Gopher:\n<br />O Enderal precisa ser instalado em uma instalação do Skyrim Classic (não é necessário nenhum DLC). Faça o download do mainfile (.gz) e do nosso launcher - Então, basta seguir as etapas fornecidas pelo launcher.\n<br />Ao instalar o Enderal, nosso lançador fará o backup de todo o seu diretório Skyrim - em outras palavras, seu Skyrim modificado ficará intocado. Por outro lado, ao desinstalar o Enderal, você tem a opção de fazer backup de sua instalação do Enderal (incluindo mods, caso haja algum), o que permite alternar com segurança entre os dois.\n<br />No entanto, recomendamos instalar o Enderal em uma instalação limpa do Skyrim Classic (sem mods ou ENBs).\n<br />Como o Enderal usa seu próprio masterfile, ele não será compatível com a maioria dos mods que exigem um .esp. Os mods gráficos, como os pacotes de textura de alta resolução, devem ser compatíveis em teoria, mas desaconselhamos aqueles que não são feitos especificamente para o Enderal, já que substituímos grande parte das texturas por nós mesmos.\n<br />Nós aconselhamos fortemente contra o uso de ENBs que não tenham sido ajustados para o Enderal, pois isso provavelmente arruinará completamente o visual, assim como produzirá erros severos (o ImageSpaceModifiers não funciona corretamente, o que depende muito da nossa história).\n<br />Nossa sugestão: Primeiro jogue baunilha, depois mod.\n<br />Patches são obrigatórios se você quiser jogar. Eles serão instalados através do Launcher Enderal, basta apertar o botão Update e deixar o lançador fazer o resto. Se você tiver problemas para baixar e instalar pathces (por exemplo, um loop never ending), confira nossa página wiki sobre os problemas do launcher.[/size][/b]",
  "categoryId": "94",
  "version": "1.0",
  "author": "Neo",
  "createdUnix": "1521813688",
  "updatedUnix": "1521813688",
  "containsAdultContent": false,
  "uploadedBy": "neo7p5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000269122",
      "name": "Enderal - English Version TRADUCAO PT-BR",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1947",
      "fileName": "Enderal - English Version TRADUCAO PT-BR-90268-1-0.zip",
      "uploadedUnix": "1521813623",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/72bae53630b3a46b9794da0a31e9d83457a5e614892bfd768b43876e55257c89/analysis/1521813741/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enderal%20-%20English%20Version%20TRADUCAO%20PT-BR-90268-1-0.zip?fid=1000269122&ttl=1535880339&ri=8192&rs=8192&setec=29379eeaaaa70a1f1907decab789f12a"
    }
  ]
}