{
  "modId": 90389.0,
  "modName": "Oblivion Artifact Pack Spanish",
  "summary": "Traducción del mod Oblivion Artifact Pack V6",
  "descriptionHtml": "Traducción del mod [url=https://www.nexusmods.com/skyrim/mods/24806/?tab=files]Oblivion Artifact Pack V6[/url]﻿ de mi colega [url=https://www.nexusmods.com/skyrim/users/1305085]Watcherzero[/url]. Realizada por [url=http://www.caballerosdecalradia.net/u41838]celiand[/url], traductor oficial de [url=http://www.caballerosdecalradia.net/]Caballeros de Calradia[/url]; que trae de vuelta muchas de las armas, armaduras y ropas clásicas únicas de The Elder Scrolls IV: Oblivion a The Elder Scrolls V: Skyrim.\n<br />\n<br />ADVERTENCIA: El Anillo Silencio de Blackwood hace 150 de daño por segundo. Puede matarte.\n<br />\n<br />\n<br />Ubicaciones de todos los objetos:\n<br />\n<br />Escudete de Chorrol - En la Torre Sombra del Pico, al Sudeste de Falkreath.\n<br />Ola de Fuego - En el barco Ola Roja, en el Puerto de Soledad.\n<br />Astilla del Ingenio - En la Casa de Alva, en Morthal.\n<br />Arco de Frostwyrm - En Paraje de Ivar, hay un nuevo y pequeño almacén propiedad de Temba Brazo Ancho.\n<br />Set de Amelion - En la Cueva del Eco Perdido.\n<br />Ojo de Sithis - En el Santuario de Lucero del Alba, antes de la sala de torturas.. o antes de encontrar a Cicerón.\n<br />Anillo del Gris - En las Alcantarillas de la cárcel de Riften, Está en un 'monedero' en el suelo.\n<br />Anillo Silencio Blackwood - En la Colección Argoniana en Ventalia, en un 'monedero' que está en un estante.\n<br />Joya de los Rumare - En la Caseta del Cangrejero cerca de Orotheim, en un estante.\n<br />Diadema de Omnipotencia - En el Estanque del Ojo de Mara al final de una mesa.\n<br />Casco de la Ferocidad - En Dushnikh Yal en un estante.\n<br />Anillo de la Trasmutación - En el Campamento de las Lunas Silenciosas es un 'monedero' en un cofre junto a la escalera al final.\n<br />Sable de Rohssan - En el Bastión de Helgen en un estante.\n<br />Roca Draconiana - En la taberna del Gigante Dormido de Cauce Boscoso, en la habitación oculta en un estante.\n<br />Torre de los Nueve - En el Templo de Soledad, en el área del sótano antes de las catacumbas de Potema.\n<br />Anillo Wortcraft - En el Caldero de Arcadia, en Carrera Blanca, dentro de un 'monedero'.\n<br />Manos de Atronach - En el Podridero del Colegio de Hibernalia en la Fragua de Atronach.\n<br />Hoja Akaviri de la Ruptura - En el Claro de los Ancestros, junto a una roca cerca de uno de los árboles más altos..\n<br />Mal Apocalíptico - En la Gruta del Hombre Hinchado junto a la Hoja del Juramento de Bolar.\n<br />Manos de Medianoche - En Punta de la Arpía.\n<br />Derecho de Nacimiento de Astalon - En el Bastión de la Guardia del Norte, en un estante.\n<br />Réplica Sombría de Caliben - En la Embajada Thalmor, en la estantería de un dormitorio.\n<br />Tejedora del Pecado - En los Cuarteles Thalmor, subiendo las escaleras, arriba en una pared.\n<br />Hacha de Batalla del Odio - En la Mina de Ascua en un estante.\n<br />Sable del capitán Kordan - En el Sload Delicado al final de una mesa.\n<br />Daga de la Disciplina - En el Santuario de Falkreath en un estante.\n<br />Especial de Rasheda - En Riften, en la casa del herrero sobre la chimenea.\n<br />Anillo del Límite Eidolon - En la capilla de Mehrunes Dagon en un plato con algunas sales.\n<br />Capucha del Druida - En la Cueva de la Roca Andante en un estante.\n<br />Velo del Vidente - En Cuesta del Risco al final de una mesa.\n<br />Capa de la Creatividad - En la Torre de Luz Oscura, al final de una mesa con una calavera de troll.\n<br />Yaganatha de Dondoran - En Raldbthar en la sala principal donde está el jefe bandido.\n<br />Delantal del Maestro Artesano - En Carrera Blanca, en la Casa de Melena Gris, en la habitación principal.\n<br />Botas del Mercader Ágil - En el Colegio de Bardos de Soledad, en la habitación principal.\n<br />Botas Plata Rápida - En el Gremio de Ladrones en Riften.\n<br />Banda Negra - En el Santuario de Lucero del Alba sobre la mesa cuando entras por primera vez es un 'monedero'\n<br />Espada del Honor de Chorrol - Una cueva pequeña cerca de Falkreath y Torre Sombra del Pico, Prepárate para pelear, y para una buena escalada.\n<br />Adornos del Mentiroso - Ropajes Radiantes en Soledad.\n<br />Rompepiedras - En Orotheim en un cofre.\n<br />Espina del Sufrimiento - Guarida de Aguas Rojas cerca del pozo.\n<br />Corazón de Odio - En la Isla Aislada cerca de La Fresquera en Hibernalia. Prepárate para pelear.\n<br />Alma de Odio y Flechas de Odio - En la Isla Aislada cerca de La Fresquera en Hibernalia. Prepárate para pelear.\n<br />Anillo Ojo de Víbora - En Harmugstahl en una mesa junto al laboratorio de Alquimia.\n<br />Caza de Sombras - En una pequeña cueva glacial cerca de La Fresquera en Hibernalia. Prepárate para pelear.\n<br />Buscador de Hechicería - En la Cueva de Hob.\n<br />Anillo de Desecación - En la Cueva de la Costa Lúgubre.\n<br />Diadema de Verdure - En la Cueva Pierna Rota.\n<br />Anillo del Océano - En Riba Norte.\n<br />Septim de Dos Caras - En Pecio de la Borrasca del Sur.\n<br />Cuchilla de Blackwater - En Pecio de la Borrasca del Sur.\n<br />\n<br />\n<br />*Cabe destacar que hay ubicaciones añadidas por el mod que el juego vanilla no aparecen*\n<br />\n<br />Hay un diario en Coc Qasmoke que tiene todos los lugares en él\n<br />\n<br />Cualquier duda más, ir al post original del mod: [url=https://www.nexusmods.com/skyrim/mods/24806/?tab=files]Oblivion Artifact Pack V6[/url]﻿\n<br />\n<br />\n<br />[size=2][url=https://rd.nexusmods.com/skyrimspecialedition/users/44573037/?tb=mods&amp;pUp=1&amp;tab=user+files][size=4]\n<br />[center]\n<br />****LINK A TODAS MIS TRADUCCIONES****[/center]\n<br />[/size][/url][/size]",
  "categoryId": "36",
  "version": "V6.1Repack",
  "author": "celiand",
  "createdUnix": "1522167281",
  "updatedUnix": "1522167281",
  "containsAdultContent": false,
  "uploadedBy": "celiand",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000269447",
      "name": "Oblivion Artifact Pack V6 Spanish",
      "version": "V6.1Repack",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "125",
      "fileName": "Oblivion Artifact Pack V6 Spanish-90389-V6-1Repack.rar",
      "uploadedUnix": "1522167242",
      "modVersion": "V6.1Repack",
      "virusScanUrl": "https://www.virustotal.com/file/3cc0b27ee2dc4c9249b871a82a0a572d79c4afd8f32b97eeacf521beb52c95ff/analysis/1522167422/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Oblivion%20Artifact%20Pack%20V6%20Spanish-90389-V6-1Repack.rar?fid=1000269447&ttl=1535880503&ri=8192&rs=8192&setec=0d05475cdd666c0e0ae7132f378dda5f"
    }
  ]
}