{
  "modId": 90399.0,
  "modName": "Origins of the Dragonborn by M7",
  "summary": "Origins of the Dragonborn is a quest / house / castle / city mod with about 4 new quests and a player home and city.  It is lore-friendly.  M7 2018.",
  "descriptionHtml": "The Elder Scrolls V: Skyrim / Hearthfire / Dawnguard / Dragonborn DLC:\n<br />=======================================================\n<br />Presents... Origins of the Dragonborn.\n<br />A Quest Mod by M7. 2018.\n<br />=============================\n<br />First go to the Courier to Septim (Map Marker) near Riverwood, then fast travel to Riverwood to set up the Courier. The Courier will give you a letter -- Dragonborn Inheritance. Read it. Then follow the instructions. \n<br />\n<br />=============================\n<br />http://steamcommunity.com/sharedfiles/filedetails/?id=1342588116\n<br />https://www.youtube.com/watch?v=EaEF3Ut8fiQ&amp;feature=youtu.be\n<br />\n<br />\"Greetings, Dragonborn.  This is Celia, I am a member of the Blades.  I suppose you want answers as to why you were sent to Helgen to be executed.  The reason is not that simple to explain, but continue reading... The Imperials wanted you executed because they knew you are or will become Dragonborn.  You are of Royal Blood, as are all Dragonborns, of the House of Septim in the Septim Dynasty. You see, there was a Purge of the Royal Household recently, and you were counted among them.  All Dragonborns are heirs to Emperor Titus Mede II and thus in line for the throne because of Divine Right.  The Emperor considered them a threat to his power, so he ordered their execution.  \n<br />\n<br />Miraak is also of the Septim blood line, but he was spared the Purge as his destiny lays elsewhere.  General Tullius pretended not to know your true identity as heir to the Septim Dynasty.  A living Septim would interfere with the Thalmor Treaty (The White-Gold Concordat), in favor of Talos worship and the return of the Septims to power in Tamriel. \n<br />\n<br />You have as your inheritance a small island called Dragon Isle with its own City and the Septim Palace, your ancestral home.  You can find it by visiting a Septim Teleport Tower in Falkreath or outside Raven Rock in Solstheim. Other Heirs to the Throne may exist there as obstacles or threats to your power, so be careful. \n<br />\n<br />- Celia, Royal Scribe of the Blades.\"\n<br />\n<br />=====================================\n<br />=========\n<br />Features:\n<br />=========\n<br />City:  \n<br />-----\n<br />Casino with slot machine and bartender\n<br />Food and Scrolls merchants store\n<br />Sword and Shield merchants store\n<br />Bank with Hearthfires Merchant\n<br />Working/Functional Inn\n<br />Clothing Emporium store\n<br />Water Wells &amp; landscape/trees\n<br />Healing Pool with waterfalls and statuary\n<br />Forge, etc.\n<br />Stables with Horse\n<br />Nearby Mines\n<br />Nearby Beach with Docks/Boat\n<br />Nearby Temple of the Dragonborn (with statues/tomb)\n<br />Nearby Farms and Entrance Tower, walls.\n<br />Teleport Spell tome (Store in City)\n<br />Butler spell tome (store in City)\n<br />---------------\n<br />Septim Palace:\n<br />---------------\n<br />Main Hall/Great Hall with thrones, furniture\n<br />Healing Shrine\n<br />Servants' rooms\n<br />Master Bedrooms, healing pool (cellar)\n<br />Cellar with storage, Wine/Mead kegs, Drug Lab, Practice Safe (Lockpicking skill)\n<br />Formal Dining room with kitchen and furniture\n<br />2 Bards, 1 Chef, Maid, Toy Merchant\n<br />Man-At-Arms (Follower), Housecarl (Follower)\n<br />Origins Hall - for quests, with Mannequins, Weapon Racks, Book Shelves, storage, Garden\n<br />Barracks with Jail cell (Justicar; the Guards are set to ally of Player. Only Justicar can make arrests)\n<br />Guards who protect Palace\n<br />Governor's Residence (Quest)\n<br />Stables with horses (buyable one in Food/scrolls store, spell tome)\n<br />\n<br />--------\n<br />Quests:\n<br />--------\n<br />1. Inheritance - visit the bridge outside of Riverwood then Riverwood to activate Courier.\n<br />Courier gives you \"Dragonborn Inheritance\" letter. Read it.  It gives you a key to the Septim Tower(s) in Falkreath or Raven Rock (Solstheim).  Use gold teleport to access Dragon Isle.\n<br />2. Origins of the Dragonborn - pick up the Book of the Dragonborn and deliver it to the Temple of the Dragonborn near the beach.  Make an offering at the Talos Shrine Altar. You will be instructed to find/kill Maximus Septim the Usurper who ordered you executed at Helgen.  Then you get a key to the Origins Hall in the Septim Palace, which you need for other quests.\n<br />3. There is more to it than that - bring the Dragon Heart to your Drug Lab in the Cellar, make 10 Essences of Dragon and bring them to the Temple of the Dragonborn.  Access a shrine there.  Then go to the Field of Battle (near Tower) and bring something to the Dragon Skull.  Win the Battle by wearing a Crown.\n<br />4. Thalmor Conquest - Read 2 books from the strongbox in Origins Hall.  Decide if you really want to revoke the White-Gold Concordat, a Treaty between the Thalmor and the Empire. If so, win the battle against the Thalmor and make a new treaty.  \n<br />5. Find a Treasure Chest from a map in the strongbox.\n<br />6. Find what happened to your parents in the tomb below the Temple.\n<br />\n<br />--------\n<br />M7. 2018.",
  "categoryId": "53",
  "version": "1.0",
  "author": "M7",
  "createdUnix": "1522182870",
  "updatedUnix": "1522182870",
  "containsAdultContent": false,
  "uploadedBy": "morsepone7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000269460",
      "name": "SeptimLO2M7001",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12213",
      "fileName": "SeptimLO2M7001-90399-1-0.zip",
      "uploadedUnix": "1522182511",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2c23e9a70ab9489edaaf139df41b7c99a4b89a14ddc733089cbdad47dc3e1ca4/analysis/1522182707/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SeptimLO2M7001-90399-1-0.zip?fid=1000269460&ttl=1535880513&ri=8192&rs=8192&setec=2a9681618da05c6c0eb6b6be115fe982"
    }
  ]
}