{
  "modId": 90423.0,
  "modName": "Terror Mask",
  "summary": "A Mod that adds a lore friendly version of the Terror Mask from Splatterhouse to Skyrim",
  "descriptionHtml": "I have always loved the Splatterhouse Games from childhood to now.  Porting something like the Terror Mask to Skyrim has been a minor dream for years.  Sadly with no mesh or texture editing slash creating know how,  I decided to do the next best thing and make something more lore friendly, hopefully.\n<br />\n<br />\n<br />\n<br />Many many moons ago,  a priest for Miraak's cultists grew too big for his britches and became egotistical.  He disrespected Hermaeus Mora and paid a heavy price.  His body was shattered to the winds and his soul was cast into his own mask.  This deluded fool also enchanted a woodcutter's axe (Ironic humor) with the most insidious of magics.  Problem is,  it wasn't enough.  Now, the mask has been cast through different lands throughout Tamriel, tempting wearers,  gathering the evil from those around it, gaining power. In an old barrel,  made of weathered skin, in Riverwood,  the Dragonborn can don this evil thing,  and help the spirit of the mask achieve its revenge against Miraak, for its body's destruction!\n<br />\n<br />\n<br />The Mask itself offers enchantments.  Enhanced life,  carrying weight and hand to hand bonuses.  It also renders the wearer immune to any magic.  The stamina bonuses border on the op, including stamina regeneration.  However, there is a price for this hideous head ornament.  Your magicka is consumed entirely when you wear it,  no casting spells, nada...zilch!  However, two bloody notes will provide you with abilities that can truly be useful.  One is Bloody Wrath; think Berserker rage as a lesser power.  The other is to summon the Axe of Terror that the Mad Cultist used against his enemies. This axe does admittedly overpowered damage to enemies, and also has a vampiric draining effect. The thing also has soul trap for those slain by its blade.  There is also a book with a mild history of the Cultist's story...in his own words of course.\n<br />\n<br />The Mask can be found by the Mill in Riverwood.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Wes",
  "createdUnix": "1522305939",
  "updatedUnix": "1522305939",
  "containsAdultContent": false,
  "uploadedBy": "gelledorn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000269567",
      "name": "Terror Mask",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26",
      "fileName": "Terror Mask-90423-1-0.7z",
      "uploadedUnix": "1522305869",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bce338d195fead00a8920bfb9a2e163a149be90e21e9e07bf1bb2db6b65bbe78/analysis/1522306022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Terror%20Mask-90423-1-0.7z?fid=1000269567&ttl=1535880542&ri=8192&rs=8192&setec=3dc3740c5151f0907fb37501834e3f2c"
    }
  ]
}