{
  "modId": 90472.0,
  "modName": "Ambriel - la princesse perdue - version francaise",
  "summary": "Traduction française du mod d'Excelsior2000 : Ambriel - the lost Princess",
  "descriptionHtml": "[center][size=4]Le mod original [url=https://www.nexusmods.com/skyrim/mods/78762/]Ambriel - The Lost Princess (Fully Voiced and Quest)[/url]﻿ de [url=https://www.nexusmods.com/skyrim/users/3668579]Excelsior2000 [/url]﻿reste nécessaire.\n<br />Cette trad propose la version CBBE (sans HDT), c'est facile de la transposer aux ESP UNP, 7BASE +HDT\n<br />(si vous ne savez pas le faire, demandez-moi ici)\n<br />\n<br />Bonjour, mon nom est Ambriel, princesse de Tamriel et défenseur de l'Empire et des Neuf.\n<br />De fabuleux secrets me furent révélés quand j'ai commencé à découvrir l'origine de mes pouvoirs et de mon immortalité.\n<br />Peu de gens connaissent cette histoire mais elle va bouleverser les fondements de Tamriel.\n<br />J'ai besoin de vous pour m'aider à découvrir la vérité sur une prophétie longtemps oubliée, pour éviter que le monde ne périsse sous les flammes et la destruction. Notre ennemi fera tout pour nous faire chuter. Mais nous gagnerons... nous devons gagner, en l'honneur de Talos.\n<br />\n<br />Compagnon totalement doublé en anglais (1800 lignes de dialogues)\n<br />Pas besoin de EFF, AFT ou autre, et permet en plus d'être suivi par un compagnon vanilla.\n<br />CBBE, UNP, 7BASE, HDT en option\n<br />Interactions uniques (dialogues avec autres PNJs, notamment avec Recorder - La chroniqueuse)\n<br />Consciente de l'environnement et des autres PNJs, ainsi que de certains animaux.\n<br />Compétente en archerie et en magie\n<br />Consciente des quêtes en cours\n<br />Quête personnelle conséquente et totalement doublée (en anglais)\n<br />\n<br />\n<br />Où se trouve Ambriel : un messager vous donnera une lettre dans une des villes de Bordeciel...\n<br />\n<br />NDT : Ambriel est une des meilleures équipières que j'ai personnellement testées. Du fait des caractéristiques ci-dessus et elle possède des interactions uniques avec le PJ que j'ai jamais vues ailleurs. De plus elle est une enfant de dragon potentielle et si vous réussissez sa quête personnelle, elle sera capable de se transformer en dragon et de combattre un autre dragon dans les airs  :shock:      [Trad testée jusqu'à la rencontre avec Naarifin mais pas plus loin car je l'ai jouée sous Skyrim SE]\n<br />[/size][/center]",
  "categoryId": "66",
  "version": "1.06",
  "author": "jihan02",
  "createdUnix": "1522598807",
  "updatedUnix": "1522598807",
  "containsAdultContent": false,
  "uploadedBy": "jihan02",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000269792",
      "name": "Ambriel - la princesse perdue VOST FR",
      "version": "1.06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "615",
      "fileName": "Ambriel - la princesse perdue VOST FR-90472-1-06.rar",
      "uploadedUnix": "1522598772",
      "modVersion": "1.06",
      "virusScanUrl": "https://www.virustotal.com/file/76837cb6e1375d3e57ac002d47e7b324645fd4a2b76b4612ae2469dc0f019a08/analysis/1522598946/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ambriel%20-%20la%20princesse%20perdue%20VOST%20FR-90472-1-06.rar?fid=1000269792&ttl=1535880616&ri=8192&rs=8192&setec=8c40edb00fb61d8970e5bfbea69925c0"
    }
  ]
}