{
  "modId": 9056.0,
  "modName": "Captains Cabin",
  "summary": "Captain\\'s Cabin is a small player house located on the opposite side of Anga\\'s Mill, across the fast flowing river that flows down through a couple of waterfalls towards Windhelm. It is comfortable and compact house most suited to a ranger/warrior character.\r\n",
  "descriptionHtml": "Introduction\r\n===========\r\nI\\'ve always been a big fan of small houses. I\\'m not the type of player who enjoys the big manor houses with hundreds of rooms, multiple levels and so on. Personally, I prefer small quaint homes that have plenty of storage and a simple, cozy, compact and comfortable feeling about them. The house is probably best suited to a player more suited to swords and bows rather than magic. A ranger/thief/hunter/warrior character will probably feel more satisfied with it. I\\'ll try and provide as much information about the house as possible because I know limited information about a mod can be irritating at times.\r\n\r\nThis was originally intended as a personal project to relearn the creation/construction kit, but I decided to release it anyway to see if anyone else likes it at all. I\\'d dabbled in Oblivion modding before (search Hansholm village for example or visit Oblivions\\' Real Estate) but I would still call myself a rookie in terms of modding.\r\n\r\nI wasn\\'t particularly fond of the default city houses of vanilla. I prefer being out of the cities yet not too remote that you are nowhere near civilisation so after a quick search around some of my favourite snowy regions, I decided to make one in the place explained below.\r\n\r\nLocation\r\n===========\r\nCaptain\\'s Cabin is a small player house located on the opposite side of Anga\\'s Mill, across the fast flowing river that flows down through a couple of waterfalls towards Windhelm. Please see the map screenshot for a visual guide to the location if for one reason or another you struggle to find it.\r\n\r\nExterior\r\n===========\r\nThe exterior of the Cabin includes a fully functional weapon/armour crafting area with only the exclusion of the ore smelter (You\\'ll have to make a trip to Windhelm for that!). A tanning rack is also available, positioned in a seclusive corner of the Cabin exterior. I have placed a named barrel near the forge called \\'Crafting Supplies\\' that shouldn\\'t respawn so you can place all your ingots, leather strips and other crafting materials here.\r\n\r\nI also provided plenty of wood and a chopping block so you can produce some firewood and sell it to Anga over at her mill. A nice way of getting a bit of income for low-level players who prefer woodcutting at home rather than sharing the chopping block with Anga\\'s goons at the mill. I have provided a non-respawning barrel named \\'Firewood supplies\\' here too so you can store wood here if you prefer making a big supply then heading over to the Mill/Windhelm.\r\n\r\nThe last feature worthy of note outside the Cabin is just two benches and a camp fire over looking the rapids surging down one of the nearby waterfalls.\r\n\r\nInterior\r\n===========\r\nAs I mentioned in the introduction, I prefer small, compact houses so it\\'s two room house. A main room and a basement with enough weapon racks, display cases, and mannequins for most players.\r\n\r\nThe main room features your usual areas. Bed, fireplace, an obvious \\'eating area\\' and so on. I\\'ve also continued to use named containers here for most of your storage needs. For example, I\\'ve provided a chest for swords, while another one for your maces & axes. A satchel for important notes & documents and a wardrobe for clothing & armour.\r\n\r\nAccess to the basement is from a trap door on the far left of the room. I\\'ve always wanted an area when I can display all my favourite weapons and armour but the areas in the default houses didn\\'t really appeal to me. This gives more than enough weapon racks, display cases and mannequins for more than just my favourites.\r\n\r\nInstall\r\n=======\r\n1. Copy the .esp file to Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\ (alternatively use the Nexus Mod Manager)\r\n2. Start the Skyrim Launcher, click \\'Data Files\\', place a checkmark beside the CaptainsCabin.esp file.\r\n\r\nKnown Issues or Bugs\r\n====================\r\nNothing particularly major as far as I can tell. Perhaps the occasionally poorly position item but other than that, it should be swell. If not, I suspect some will voice their disapproval and I can try and fix it.\r\n\r\nWhile not a technical issue, I\\'m pretty sure Anga\\'s Mill can be attacked by a Dragon now and then so don\\'t be too alarmed if a Dragon turns up on your doorstep one day.\r\n\r\nIncompatibility\r\n===============\r\nThis will mod will obviously conflict with anything that modifies the area where it is built but other than that, no problemos hopefully.\r\n\r\nUninstall\r\n=========\r\n1. Start Skyrim Launcher, click Data Files, uncheck the CaptainsCabin.esp\r\n2. Delete the .esp file from Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\\\\\r\n\r\n========\r\n\r\nI do hope I uploaded this right.\r\n\r\nThanks,\r\n\r\nLewis.\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "LuckyLewis",
  "createdUnix": "1329009753",
  "updatedUnix": "1329009823",
  "containsAdultContent": false,
  "uploadedBy": "Luckylewis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "29265",
      "name": "Captains Cabin",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "77",
      "fileName": "Captains Cabin-9056-1-0.7z",
      "uploadedUnix": "1329009823",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6e42403ae6b033bdb4b624d67620f4fc8b4b86207aad7172b3a2e1fc257f4a4c/analysis/1406671689/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Captains%20Cabin-9056-1-0.7z?fid=29265&ttl=1535768290&ri=8192&rs=8192&setec=9644f8c2dcc7afb20e841f126fa60c0d"
    }
  ]
}