{
  "modId": 90568.0,
  "modName": "All My Work in One File (Second Edition) - DELETED",
  "summary": "Here is all my stuff since the last \"all in one\" file upload.",
  "descriptionHtml": "My Skyrim Works again! After 2 clean installs of mods and the game it finally doesn't crash!\n<br />\n<br />Anyway.. onto the mod:\n<br />\n<br />&gt;&gt;&gt;This file cannot -=- [color=#ff0000][b]CANNOT[/b] [/color]-=- be installed like a mod. This mod is in fact a folder containing folders containing folders. There are many mods inside the folder you are gonna download. What I did here was basically zip up my mods work folder. Everything is inside of it...\n<br />\n<br />[b][size=3][color=#ff7700]I have decided to make my content available for use. Everyone has full permissions to use this. I would ask this, though - that you message me about what you are making because I think it is neat to see people use my work.[/color]\n<br />\n<br />[color=#00ffff]So, What All Does this Include:[/color][/size][/b]\n<br />[list]\n<br />[*]Many requested that I share my modified version of Legacy ENB so my modified files are included with this. Just copy these files into the legacy ENB files and overwrite when asked.\n<br />[*]The RaceMenu presets and BodySlide presets I made since my last \"All My Work in One File\" upload.\n<br />[*]Screenshots of landscapes.\n<br />[*]Lewd screenshots of my female characters.\n<br />[*]RaceMenu inspiration pictures (some of them I never got around to making)\n<br />[*]Anything else that might have been in there, I dunno.\n<br />[/list][b][color=#00ffff][size=3]Requirements for RaceMenu Presets:[/size][/color][/b]\n<br />[i][color=#b4a7d6]All of the mods I use for my presets listed below:[/color][/i]\n<br />[list]\n<br />[*]Fair Skin Complexion - and all of the installer's optional addons (brows, eyes, etc.)\n<br />[*]Unslaad Pale UNP Textures - I also use the no freckles optional file with this. I let this overwrite Fair Skin Complexion. You do not need this mod, It is simply my preferred skin texture to use :)\n<br />[*]The Eyes of Beauty - let this overwrite fair skin complexion\n<br />[*]Eyes of Aber\n<br />[*]Brows\n<br />[*]SG Female Brows\n<br />[*]Freckle Mania 2\n<br />[*]Neith Team WarPaints\n<br />[*]Stoja's WarPaints\n<br />[*]RaceMenu\n<br />[*]SKSE\n<br />[/list][color=#00ffff][size=3][b]Requirements for BodySlide Presets:[/b][/size][/color]\n<br />[list]\n<br />[*]SKSE\n<br />[*]BodySlide and Outfit Studio - choose UUNP options\n<br />[*]HDT Physics Extension - let bodyslide overwrite this\n<br />[*]XP32 Maximum Skeleton Extended - choose HDT rigging in the installer\n<br />[*]Realistic Ragdolls and force - let XP32 overwrite this\n<br />[/list]\n<br />[b][color=#00ffff][size=3]The Overly Long Credits:[/size][/color][/b]\n<br />[list]\n<br />[*]Credits to the Skyrim Community as a whole. This modding community is simply amazing. The vast amount of mods made to improve upon the game we love is astounding and incredible. Every day I go to the Skyrim files and say \"damn, that's pretty neat!\" You guys constantly amaze me. I will never be able to make super cool mods that you make but I do try to contribute in small ways. I appreciate each and everyone of you. Even those of you who don't make mods - you are still the people that make this possible. Skyrim mods wouldn't be posted and released unless there were those of use who wanted them, supported them, and downloaded them. This community is amazing and I open it continues into all of the future Elder Scrolls Games. \n<br />[*]Huge thanks to [b]RaceMenu[/b] and [b]BodySlide[/b]. Without these mods I wouldn't be able to make any of my mods.\n<br />[*]Special thanks to [b]Fair Skin Complexion[/b] and [b]KS Hairdos[/b]. These mods helped me make very beautiful looking characters.\n<br />[*]Big thanks to everyone who uses, comments on, endorses, and downloads my mods. I appreciate all of you.\n<br />[*]A round of applause to Bethesda for making Skyrim.\n<br />[*]And last but not least, thank you to Nexus Mods for hosting my mods and everyone else's mods. Great website!\n<br />[/list]\n<br />[color=#b4a7d6][i]Please do not ask me about the outfits I used. I will NOT answer these questions.[/i][/color]",
  "categoryId": "26",
  "version": "1",
  "author": "wnisewond",
  "createdUnix": "1522988943",
  "updatedUnix": "1522988943",
  "containsAdultContent": true,
  "uploadedBy": "wnisewond",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000270090",
      "name": "mod stuff",
      "version": "1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1229598",
      "fileName": "mod stuff-90568-1.zip",
      "uploadedUnix": "1522988926",
      "modVersion": "1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mod%20stuff-90568-1.zip?fid=1000270090&ttl=1535880756&ri=8192&rs=8192&setec=315ac9c4ae6918930490d7b23399a37f"
    }
  ]
}