{
  "modId": 90575.0,
  "modName": "Niobe the Sun Rose Mage (Healer) - Jinxxed Followers",
  "summary": "This mod adds a female Redguard healer follower to the Temple of Kynareth in whiterun",
  "descriptionHtml": "[center]﻿[img]https://i.imgur.com/2x5gRNC.png[/img]﻿[/center][u][size=6][b][color=#ffd966]DESCRIPTION[/color]\n<br />[/b][/size][/u]This is Niobe. She's a completely original character. One of my characters that I've played for a while in fact. She's a restoration mage that will heal the player and party members. She's not that good at destruction and her only means of attack is her Run Rose Staff. She carries a copy for you if you'd like it (otherwise she will dual wield them possibly making her OP, though she does not have 100% accuracy. Her attacks work on all enemies, not just the undead.\n<br />\n<br />Niobe is best suited for difficult games or for those who don't care about being over powered.\n<br />Please note that having a ton of party members at once might cause her to heal you less frequently because she'll be healing all of you.\n<br />[img]https://i.imgur.com/kF7YgSz.png[/img]﻿\n<br />[size=6][b][u][color=#ffd966]BACKGROUND[/color][/u][color=#ea9999] [/color][/b]                                    [/size]\n<br />Niobe is known as \"The Sun Rose\" or \"The Sun Rose Mage\".\n<br />When she was a younger, she had a garden of roses at her home in a small village in Hammerfell. She was known for being able to such lovely plants of all types, but loved roses very much. She also dabbled in healing magic and planned to work with the village healer, eventually taking his place once he got too old. her village was relatively peaceful. There were a handful of fighters, including Niobe's brother, so whenever there was trouble, he and his group would take care of it.\n<br />\n<br />Unfortunately, the village was invaded by a large group of bandits who wanted to hide out in their village after stealing a large shipment of gold. Niobe's brother and his group tried to fight them off, but they were no match for the evil horde of bandits. Niobe's brother was mortally wounded and he tried to crawl to her to make sure she was safe. He collapsed into her rose garden and died a few moments later. Out of desperation, Niobe tried to heal him, praying and pleading for him to come back. Even with her magicka drained, she tried desperately to no affect...on her brother. The bright red roses wilted and turned black as she tried to heal him and after a few seconds, they rapidly blossomed back to life with a bright golden glow. She stopped to look at what was happening and the roses kept growing, almost into the size of people. Her brother vanished leaving only his robes behind. When the bandits tried to attack her and the rest of the village, all of the roses shot out blasts of light at them, igniting them all on fire.\n<br />\n<br />Some time later, when the village back to peace, Niobe plucked a few of the giant golden roses to study them. Even with out water, they thrived without being in the ground. It seemed they only needed sunlight. The ones that were kept in the dark remained alive, but lost their glow and power. Niobe believes the roses are a gift from Mara or perhaps Mara and Dibella. She had always worshiped them both believing that there was a beauty in everything. Ever since that day, the large roses in her garden protected the village for anyone who wanted to do them harm. All the new roses she planted in the garden didn't grow into giant plants, but were blight and yellow.\n<br />\n<br />A year later, Niobe set off to travel the world. Her restoration improved and she had taken the identity of the Sun Rose and word spread around about her and her roses. She even wore clothing to reflect it, including her brother's old cloak which she dyed gold. She was gifted jewelry crafted and enchanted specifically for her as news of her deeds spread. Her deeds mainly consisted of healing those needed it the most and occasionally dealing with bandits. She's traveled all around Tamriel over the years and now finds herself in Skyrim during the Civil War.\n<br />[right][img]https://i.imgur.com/SFQaqDN.png[/img]﻿﻿[/right][color=#ffd966][size=6][u][b]FEATURES[/b][/u][/size][/color]\n<br />[u][size=4]Momohime's Stats[/size][/u]\n<br />Gender: Female\n<br />Age: 34\n<br />Race: Redguard\n<br />Weapon: Sun Rose Staff\n<br />Armor: Modified rags sewed together to fit her Sun Rose identity.\n<br />Abilities: She's very good at restoration and alteration. She'll heal the crap of you\n<br />Voice Type: Female Sultry\n<br />Body: Custom UUNP Special Body\n<br />Height: 1.10\n<br />Weight: 30\n<br />Class: Healer\n<br />Combat Style: Shoots enemies with her staff. Heals party members when they take damage.\n<br />Likes: Flowers, sweets, revealing clothes that leave her exposed to the sun\n<br />Dislikes: Bandits, giant spiders, rain clouds\n<br />\n<br />\n<br />[u][color=#ffd966][size=6][b]LOCATION[/b][/size][/color][/u]\n<br />Whitherun\n<br />Temple of Kynareth\n<br />\n<br />[u][color=#ffd966][size=6][b]REQUIREMENTS[/b][/size][/color][/u]\n<br />Skyrim and ALL the DLC\n<br />XP32 Maximum Skeleton -XPMS\n<br />HDT Physics\n<br />﻿﻿\n<br />[color=#ffd966][size=6][u][b]RECOMMENDED MODS[/b][/u][/size][/color]\n<br />EFF or your favorite follower mod\n<br />My Home is Your Home\n<br />RaceMenu + RaceMenu BodySliders (With EFF and these mods you can reshape any female follower you have)\n<br />\n<br />[color=#ffd966][size=6][u][b]CREDITS[/b][/u][/size][/color]\n<br />Calyps - for making this awesome cloak and letting me convert it - https://www.nexusmods.com/skyrim/mods/19377/\n<br />Raven - for Calyps Investigator Cloak original Retexture - [Look up Imperial Investigator]\n<br />nsk13 - for Merta Black Rose Armor UUNP - https://www.nexusmods.com/skyrim/mods/66967\n<br />nsk13 - for Gwelda (Little) Red Riding Hood Boots - https://www.nexusmods.com/skyrim/mods/67952\n<br />SydneyB - for  Ashara Princes of the Woods for UNP and male - https://www.nexusmods.com/skyrim/mods/18008/?\n<br />Petrovich - for UNP Undies and Gloves - https://www.nexusmods.com/skyrim/mods/24444/?\n<br />Petrovich - for UNP high heels- http://www.nexusmods.com/skyrim/mods/36393/?\n<br />Shocky - for Skyrim Necrosarium Set - http://shockyy.tumblr.com/post/108194768044/skyrim-necrosarium-set-by-shocky-this-mod-contains\n<br />S-Club - for the jewelry pieces http://sclub.mktm.co.uk/en\n<br />Kazumi (Necrosarium) - for the inspiration https://www.facebook.com/Necrosarium\n<br />nisetanaka - for Amazing World of Bikini - https://www.nexusmods.com/skyrim/mods/83383\n<br />HHaleyy - for Fair Skin textures - https://www.nexusmods.com/skyrim/users/4557236\n<br />egenbot03 - for PureSkinTexture - https://www.nexusmods.com/skyrim/mods/73853/\n<br />Ela'Neith - for The Neith Team Warpaints Set - https://www.nexusmods.com/skyrim/mods/54118\n<br />UNI00SL - for Vanilla Follower AI - https://www.nexusmods.com/skyrim/mods/61620/\n<br />ArcadianPhoenix - for Cloudy Eyes Standalone - https://www.nexusmods.com/skyrim/mods/35373\n<br />Caliente - for bodyslide - https://www.nexusmods.com/skyrim/users/3330686\n<br />ousnius - for Bodyslide - https://www.nexusmods.com/fallout4/users/4291759\n<br />Dimon99 - for UNP - https://www.nexusmods.com/skyrim/users/537675\n<br />expired6978 - for RaceMenu - https://www.nexusmods.com/skyrim/users/2950481",
  "categoryId": "66",
  "version": "1.0",
  "author": "Jinxxed0",
  "createdUnix": "1523026243",
  "updatedUnix": "1523026243",
  "containsAdultContent": true,
  "uploadedBy": "Jinxxed0",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000270115",
      "name": "Jinxxed Followers - Niobe the Sun Rose Healer",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "104952",
      "fileName": "Jinxxed Followers - Niobe the Sun Rose Healer-90575-1-0.rar",
      "uploadedUnix": "1523026168",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f4b4d1384a582968288b010f4d51663607700e1ecd0fc85d3c7670a00d414ccf/analysis/1523026273/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jinxxed%20Followers%20-%20Niobe%20the%20Sun%20Rose%20Healer-90575-1-0.rar?fid=1000270115&ttl=1535880763&ri=8192&rs=8192&setec=135d7377c1087aba41df9032ddfb8cde"
    },
    {
      "fileId": "1000270116",
      "name": "Niobe BodySlide Preset",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1",
      "fileName": "Niobe BodySlide Preset-90575-1-0.rar",
      "uploadedUnix": "1523026227",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fda79879824705b4806ed6214dfdfe4d0ad32d9ec3055947b62524b88f713b31/analysis/1523026274/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Niobe%20BodySlide%20Preset-90575-1-0.rar?fid=1000270116&ttl=1535880764&ri=8192&rs=8192&setec=12525a7c378afab7d8806e0454608abb"
    }
  ]
}