{
  "modId": 9057.0,
  "modName": "Dragonborn Lodge",
  "summary": "Its a lodge fit for the Dragonborn, I made it for myself since I never really liked any of the bought houses.  Its not too extravagant or too simple, its a nice lodge and Im sure its got everything you\\'ll ever need...\r\n\r\nAs always, download at your own risk, I havent had any issues but hey, stuff happens.",
  "descriptionHtml": "Its a lodge fit for the Dragonborn, I made it for myself since I never really liked any of the bought houses.   It is located just southwest of the Whiterun Stables, you cant miss it.  Its designed to meet my demands and its got everything you\\'ll ever need...\r\n\r\nComes with all the smithing, enchanting and alchemy tools.\r\n\r\nAs always, download at your own risk, I havent had any issues but hey, stuff happens.  Im pretty sure its compatible with every mod unless you put something literally right where I put this place.  I dont have a readme for it because I didnt feel like it needed one, its just an .esp file.  But if you have any questions ask in the comments and Ill try to answer what I can.\r\n\r\nAlso check out my Dragonborn worthy Breezehome here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=8855\r\nAlthough Im no longer updatin it, or this really, making a new place!  Its addicting really...\r\n\r\nThanks for checking it out and let me know what you guys think!",
  "categoryId": "67",
  "version": "1",
  "author": "dsthebest",
  "createdUnix": "1329009977",
  "updatedUnix": "1329010078",
  "containsAdultContent": false,
  "uploadedBy": "dsthebest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "29270",
      "name": "Dragonborn Lodge",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "168",
      "fileName": "Dragonborn Lodge-9057-1.zip",
      "uploadedUnix": "1329010078",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8d48c393cfe23395af4f91df50b62e5077970ed462b1037b4c66e3a032c9316e/analysis/1406671743/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Lodge-9057-1.zip?fid=29270&ttl=1535768292&ri=8192&rs=8192&setec=ad4f1b7e42c04031a2c49c15aac0142b"
    }
  ]
}