{
  "modId": 90612.0,
  "modName": "Myths In Skyrim Fr",
  "summary": "Premier mod, pour cet auteur ; essayant d'écrire des livres d'histoires basés sur des mythologies du monde réel et des contes qui correspondent aux The Elder Scrolls.",
  "descriptionHtml": "[1] Note du traducteur: Ici le \"j'/je\" et autres sont pour coller aux propos de l'auteur du mod.\n<br />\n<br />Donc, j'espère que cela fonctionne bien car sauver l'esp me donnait quelques problèmes.\n<br />\n<br />Salut! J'ai décidé de faire un mod dans lequel j'ai mis ma fanfiction simplifiée des mythes anciens. Je suis toujours en train de jouer avec, mais pour la 1ère version, installez-là, et tapez dans votre console commande [via ²] [help\"Borghilde\"] sans les [crochets] et elle devrait apparaître. J'ai une tonne de ces vraies histoires basées sur des mythes qui pourraient être \"jetées\" dans votre jeu Skyrim, et je voulais vraiment que ça se passe.\n<br />\n<br />Les plans futurs sont de finir d'écrire ces histoires dans le Creation Kit, en m'assurant qu'elles sont toutes sous un esp, et ensuite je vais travailler sur la belle tâche de les mettre dans le monde ou dans des leveled-lists.\n<br />\n<br />Puis, après cela, je vais essayer de comprendre si je peux faire une quête de l'Académie des bardes pour trouver ces mythes. Cela semble approprié pour ce groupe de rechercher ces livres.\n<br />\n<br />Pour le côté lore-friendly...Cela l'est... En quelque sorte. Évidemment, rien de tout cela n'est arrivé dans le monde de Bordeciel, mais cela aurait pu être le cas.\n<br />\n<br />En me concentrant sur les mythes et les légendes générales que je connais par ouï-dire, par le bouche à oreille et par des trucs généraux, j'espère que tout cela est du domaine public. J'ai l'intention de regarder des parties de la saga des Volsung, des morceaux des 'vierges des mers', un peu des mythes arthuriens, et des traités et des histoires aléatoires qui pourraient vaguement coller à Bordeciel.\n<br />\n<br />Faites-moi savoir ce que vous pensez, en prévoyant d'en ajouter d'autres dans les prochaines versions!\n<br />\n<br />[2] Notes du traducteur: J'ai ajouté le livre à une leveled-list, celle de l'Orsimer Libraire de l'Académie de Fortdhiver, car je crois qu'aucun Barde n'a de leveled-list \"Vendeur\" et je trouvais que ça faisait autant sens. J'ai dû re-manier le texte en Français pour essayer de lui donner un côté chanson/poésie. J'ai rajouté une fiche de personnage en début de livre pour essayer de les expliquer rapidement [les personnages]. Merci à l'auteur du mod pour sa permission d'ajout aux leveled-lists &amp; traduction.",
  "categoryId": "98",
  "version": "1",
  "author": "HadrasVorshoth and Setvi",
  "createdUnix": "1523195432",
  "updatedUnix": "1523195432",
  "containsAdultContent": false,
  "uploadedBy": "SETVI",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000270260",
      "name": "Song of Borghilde",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "591",
      "fileName": "Song of Borghilde-90612-1.rar",
      "uploadedUnix": "1523193904",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/3cae248da72256f979e3cd6512bb5994247b4c0009fded95e42b0d587e1b3466/analysis/1523194024/",
      "changelogHtml": " Version 1 initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Song%20of%20Borghilde-90612-1.rar?fid=1000270260&ttl=1535880816&ri=8192&rs=8192&setec=007ea5f985fd085840ed253cdfb874af"
    }
  ]
}