{
  "modId": 90626.0,
  "modName": "Your Own Skyrim - Decision Tree Player Classifier",
  "summary": "Your Own Skyrim - Decision Tree Player Classifier is a mod that adds a system to Skyrim that records and analyses player actions and interactions in order to classify the player into one of several archetypes. The objective of this classification is to present the player new customized content, in the form of skill-centered quests.",
  "descriptionHtml": "[font=Trebuchet MS][color=#b6b6b6][size=4][center]Overview[/center][/size][/color]\n<br />\n<br />[size=2]﻿Your Own Skyrim - Decision Tree Player Classifier is a mod that adds a system to Skyrim. This system records and analyses player actions and interactions in order to classify the player into one of several archetypes. The objective of this classification is to present the player new customized content, in the form of skill-centered quests. [/size][size=2]\n<br />\n<br />This is part of my Master's Thesis project, where I developed a machine learning algorithm and incorporated it into Skyrim in order to classify the player into one of [url=https://en.wikipedia.org/wiki/Bartle_taxonomy_of_player_types]Richard Bartle's player archetypes[/url]﻿, according to the actions and interactions the player has with the virtual world. \n<br />\n<br />This mod is the resulting work of myself and my supervisor over the course of 170+ hours in Creation Kit and I really hope you like it. One of the objectives of this work is to prove that Player Modeling systems are a beneficial and wanted feature in RPGs and that, overall, players enjoy a personalized experience rather than a generic one.\n<br />\n<br />If you are interested in helping me completing my Master's Thesis, you can fill [/size][color=#ffffff][size=2][url=https://goo.gl/forms/UiuSDpNsx3XwKMj03]this survey[/url], which only takes 3 minutes and means the world to me. ﻿ \n<br />\n<br />[/size][/color][size=2]Thank you\n<br />[/size][size=4]\n<br />[/size][center][color=#b6b6b6][size=4]﻿[/size][/color][b][font=Trebuchet MS][b][font=Trebuchet MS][color=#b6b6b6][size=4]What is it?[/size][/color][/font][/b][/font][/b][/center][b][font=Trebuchet MS][b][font=Trebuchet MS][color=#b6b6b6][size=4][b][font=Trebuchet MS]\n<br />[/font][/b][/size][/color][/font][/b]\n<br />[/font][/b][size=2][b]The system implemented in the mod is composed by a decision tree that runs periodically in order to analyse the player recent actions and assign him one player type and one player class. [/b]\n<br />[b]The player types available are the following:\n<br />[/b]\n<br />[/size][list]\n<br />[*][b][size=2]Achiever - Achievers  are interested in ACTING on the WORLD.  They are typical gamers, playing to “win”.  They give themselves game-related goals, and vigorously set out to achieve them.[/size][/b]\n<br />[*][b][size=2]Explorer - Explorers like INTERACTING with the WORLD.  They delight in discovery.  They try to find out as much about the environment’s topology and physics.[/size][/b]\n<br />[*][b][size=2]Socializer - Socializers are interested in INTERACTING with other PLAYERS/NPCS.  They spend a lot of time chatting, and empathize with other players and npcs.[/size][/b]\n<br />[*][b][size=2]Killer - Killers like ACTING on other PLAYERS/NPCS.  They wish to dominate them, either through bullying or politicking.  They use the tools of the game to cause distress to other players/npcs.[/size][/b]\n<br />[/list][size=2]\n<br />[b]The classes available are the following:[/b]\n<br />\n<br />[/size][list]\n<br />[*][b][size=2]Mage[/size][/b]\n<br />[*][b][size=2]Blacksmith[/size][/b]\n<br />[*][b][size=2]Hunter[/size][/b]\n<br />[/list][size=2][b]\n<br />The way that a class is chosen depends on your in-game skills. For example, if you have a higher skill level in Destruction and Conjuring than the other skills, you're probably going to be classified as a Mage, etc.\n<br />[/b]\n<br />The player types, on the other hand, use a different approach. These are decided based on your actions during a specified interval in which the algorithm collects data. A large number of actions are used as input by the decision tree and include things like Dungeons Cleared, People Killed, Locations Discovered, Items stolen, etc... \n<br />The classifier was built using a training data set consisting of 25 people under supervised tests. The algorithm used was the [url=https://en.wikipedia.org/wiki/C4.5_algorithm]C4.5 algorithm[/url]﻿, for any of you more interested in the topic.\n<br />The algorithm runs every two hours to analyse the actions performed during the two previous hours and the current skills in order to update the player class and type.\n<br />\n<br />After that, the game will adapt itself and choose some content that is likely to please players of the chosen class and type. This content comes in the form of several class-based quests that were developed using the Radiant AI system. This means that some of the objectives and location start of each quest will be selected on-the-fly (while the algorithm is running) and are not predefined. These quests are also player type related. For example, if the classifier classified you as \"Killer\", you can expect a quest where you have to kill several enemies. If you were classified as \"Explorer\", it is possible that the quests that you will receive may involve getting from point A to point B, etc.[/size][size=4]\n<br />\n<br />[/size][center][size=4]﻿[/size][b][font=Trebuchet MS][b][font=Trebuchet MS][color=#b6b6b6][size=4]How to use?\n<br />\n<br />[/size][/color][/font][/b][/font][/b][/center][font=Trebuchet MS][font=Trebuchet MS][size=2]Just play as you would in a normal play through. Because of the complexity behind the mod (i.e. data gathering), I recommend starting a new game. You can just load the mod and it will work as well, but it can fail to predict your player type because of the way the mod was designed. I also don't recommend that you fast travel, specially if you are in the middle of one of the created quests, as it can screw some of the NPCs AI and may fail to trigger something quest related. \n<br />\n<br />The mod only activates after the initial part where you leave Helgen (\"Unbound Quest Completed\"). This is due to the fact that this part is similar to all players and serves the purpose of a tutorial, so there was no point in starting recording the player actions until after said part. After the mod is enabled, you can do whatever you please: kill dragons, complete other quests, improve your skills, etc. All of this will be used as input for the decision tree and introduce you new small quests that you may decide to participate or not. The choice is yours. \n<br />[/size][size=4]\n<br />[/size][color=#b6b6b6][size=4]Compatibility\n<br />[/size][/color][size=2]This mod should be compatible with every other mod except those that change Innkeepers and Courier behavior. If you find some incompatibility let me know and I'll do my best to try and fix it.[/size]\n<br />[size=4]\n<br />[/size][color=#b6b6b6][size=4]Known Bugs[/size][/color]\n<br />\n<br />[size=2][b]This is a comprehensive list of some of the anomalies detected with the mod. If you find any bug, let me know and I'll do my best to fix it.[/b][/size]\n<br />\n<br />[list]\n<br />[*][b]Sometimes, the letter delivered by the courier to indicate a quest start location does not contain the nearest location/ always points to Whiterun. [/b]\n<br />[*][b]Some player have reported that certain followers will stop following the player when the mod is active.\n<br />[/b]\n<br />[/list][b]\n<br />[center][color=#b6b6b6][size=4]Special Thanks and Notes[/size][/color][/center]\n<br />[/b][b]\n<br />[size=2]I would like to thank my supervisor and girlfriend for all the support and guidance and all those who participated as training data for the decision tree generation algorithm and to all of you who played, tested and commented this mod. Also a big special thanks to the [url=https://www.reddit.com/r/skyrim/]&#92;r&#92;skyrim[/url]﻿ and [url=https://www.reddit.com/r/Skyrim_Mods/]&#92;r&#92;skyrimmods[/url]﻿﻿ subredits.\n<br />[/size]Don't forget to participate in the survey for my thesis and leave any (positive or negative) feedback.\n<br />\n<br />Thank you all\n<br />[/b][/font][/font][/font]",
  "categoryId": "24",
  "version": "1.0",
  "author": "Henrique Moises Fernandes",
  "createdUnix": "1523229052",
  "updatedUnix": "1523229052",
  "containsAdultContent": false,
  "uploadedBy": "henriquemoises2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000270306",
      "name": "YourOwnSkyrim",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "109",
      "fileName": "YourOwnSkyrim-90626-1-0.zip",
      "uploadedUnix": "1523229015",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/136f4cb53bab2ec9f7d968d6bc334bfbf13d52f3892b4fb3626fb2d355fbcb1a/analysis/1523229183/",
      "changelogHtml": " Added to NexusMods <br/> \n Created Mod page <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YourOwnSkyrim-90626-1-0.zip?fid=1000270306&ttl=1535880834&ri=8192&rs=8192&setec=ab0180c93fec99fb2bc62cede840b64b"
    }
  ]
}