{
  "modId": 90625.0,
  "modName": "Shuze Follower - DELETED",
  "summary": "Adds two -handed swordswoman and Blade, Shuze Yazama",
  "descriptionHtml": "Hello! This is my very first attempt at a basic follower. Shuze is a dispirited Blade warrior who likes drink and fight, will level up with you and watch your back :)\n<br />\n<br />Requirements\n<br />\n<br />UNP body or 7base\n<br />XPMSE\n<br />HDT physics extensions\n<br />RaceMenu\n<br />KS Hair Renewal\n<br />\n<br />Recommended\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83383]Amazing World of Bikini Armor [/url]﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/72955]Kai's Makeup and Warpaints[/url]﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/3871/]Weapons of the Third Era [/url]﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/13722]Eyes of Beauty[/url]﻿\n<br />\n<br />\n<br />\n<br />Background \n<br />\n<br />Shuze grew up on a farm in Cyrodil, and her greatest joy was spending time with her two older brothers.  not being fond of dolls or dresses as a child,  more often than not she was playfighting  with her siblings, and more often than not, she held her own,  despite being smaller. when they were old enough her brothers left home to join the Imperial army, which Shuze resented.  she didn't think they should get roped into fighting other people's wars.without her brothers,  she became angry and despondent.  she often would stay out all night drinking and chasing farmboys, sleeping till noon and completely ignoring her chores. Alarmed by her lifestyle her father, a former Blade, contacted his old former colleague to ask if she could be trained by her,  believing that it would give her a direction in her life. after a day's worth of convincing,  Shuze reluctantly agreed. As it turned out, though she was often surly and insubordinate, she was natural fighter and gifted with both swordsmanship and archery,  and thusly was promoted to full-fledged Blade in record time, an accomplishment that filled her with pride. unfortunately,  not more than a month afterwards the Blades were disbanded and Shuze once again felt disillusioned and abandoned.  not wanting to go back home, and having no desire to fight for anyone but herself, she set out to Skyrim, hoping to make a living as a sellsword and adventurer.",
  "categoryId": "96",
  "version": "1.0",
  "author": "Gman749",
  "createdUnix": "1523226067",
  "updatedUnix": "1523226067",
  "containsAdultContent": false,
  "uploadedBy": "Gman749",
  "primaryFile": null,
  "files": []
}