{
  "modId": 90667.0,
  "modName": "Ayleid Ruins Building Kit -Resources-",
  "summary": "The most complete Ayleid building kit available for modders, designed by the teams at Beyond Skyrim, Province Cyrodiil and with future aditions by Skyblivion",
  "descriptionHtml": "[center][img]https://c1.staticflickr.com/1/964/41745299592_a4645d4e05_o.png[/img]﻿﻿[/center]\n<br />[center][size=3]The Imperial Geographical Society is happy to presents the most complete Ayleid Ruins building kit available for TES:V Skyrim. \n<br />\n<br />This remake of Oblivion's Ayleid dungeon tileset contains over 250 unique building pieces, giving modders the tools necessary to create a wide variety of different Ayleid constructions. [/size][/center]\n<br />\n<br />[center][img]https://c1.staticflickr.com/1/911/41781291741_e1b5e03748_o.png[/img][/center][size=3]\n<br />[/size][size=3]Development of the Ayleid Building kit was originally started by Varlaisaran back in 2012, as part of the Adabala Building System resource. With the permission of Varlaisaran, The Beyond Skyrim development team retextured and expanded the resource, eventually merging it with the interior building kit developed by Tarius for Province Cyrodiil. \n<br />\n<br />The resource you see today is the combination of several peoples work througout half a decade of modding, we are excited to finally be able to present the full building kit as a mod resource here on the Nexus, and we cant wait to see what the community will do with it. \n<br />\n<br />[/size][center][b][size=5]\n<br />Avalible for Special Edition soon![/size][/b][/center]\n<br />[size=3]\n<br />[/size]\n<br />\n<br />[center][img]https://c1.staticflickr.com/1/910/26913428077_3695f3a868_o.png[/img]﻿[/center][b][size=4]Installation\n<br />[size=3]\n<br />[/size][/size][/b][size=3]1. Download the files and place them directly into your Skyrim data folder ([/size][size=3]Steam&#92;steamapps&#92;common&#92;Skyrim&#92;Data) \n<br />\n<br />2. All assets have been implemented on the igs_tileset_Ayleid.esp for easy use. Simply launch this in the Creation kit and start building. [/size]\n<br />\n<br />\n<br />[size=4][b]In the CK[/b][/size]\n<br />[size=3]\n<br />The Ayleid building kit is divided into two main chategories, Exteriors and Interiors. \n<br />\n<br />Check out our [url=https://trello.com/b/brvdEIrQ/ayleid-tileset-development]Trello [/url]board for a complete list of all complete, incomplete and missing assets. Feel free to request any missing assets in the nexus comment section or on our [url=https://discord.gg/a9bf3Vf﻿]Discord [/url]server. We prioritize the asset that gets the most requests\n<br />\n<br />\n<br />The exterior subset contains all the exterior pieces, from arches to gates. Unlike the interiors, this set is not divided into smaller subsets, but it's easy enought to use once you've learned the names for the various pieces. The interior set is divided into 10 subsets, which I will explain below.\n<br />[/size]\n<br />[size=3][size=2][b]\n<br />AyleidClutter\n<br />[/b]This subset contains small pieces that can be used across the entire kit. Items such as Ayleid Thrones and columns can be found here[b]. [/b]This folder als contains banners, but they are located under the movable statics category. To find these, simply search for ArBanners[b]\n<br />\n<br />Crystals\n<br />[/b]This is a small collection of ayleid crystals, all set to glow in the dark. This folder also contains Welkynd and Varla stones, these stones are implemented as statics, and cannot be picked up[b], [/b]though you can easily change that in the CK if you wish to make them usable.[b]\n<br />\n<br />Door\n<br />[/b]This is where you will find the various doors used throughout the set. Keep in mind that only some doors have animations[b]\n<br />\n<br />FloorRaised\n<br />[/b]A series of raised floor pieces that match the layout of the larger halls and rooms. These pieces are designed to snap together.[b]\n<br />\n<br />NarrowHalls\n<br />[/b]This is one of the four major interior subsets, and contains the smaller halls and staircases[b].[/b] Great for connecting larger areas together[b]\n<br />\n<br />PitHalls\n<br />[/b]This is one of the four major interior subsets, and contains the largest pieces in the kit. Good for making epic rooms and massive hallways[b]\n<br />\n<br />WideHalls\n<br />[/b]This is one of the four major interior subsets, and contains medium sized hallways. This set is very similar to the wide rooms set, but is designed specifically for hallways[b]\n<br />\n<br />WideRooms\n<br />[/b]This is one of the four major interior subsets, and contains medium sized room pieces. The design is identical to that of the wideHalls subset, but allows for the creation of rooms rather than hallways[b]\n<br />\n<br />Rubble\n<br />[/b]This is a small selection of rubble pieces, a great tool for making the ruins look old and crumbling[b]\n<br />\n<br />SecretTunnel\n<br />[/b]This is a small set of secret passages designed to connect with the WideHalls and the WideRooms subset. Unfortutately, we're missing the secret tunnel doors, but we're hoping to include these in a future update[/size]\n<br />\n<br />LOD files for exterior assets coming soon!\n<br />\n<br />If you have any questions at all, feel free to ask in the comment section or on our [url=https://discord.gg/a9bf3Vf]Discord [/url]server! We look forward to hearing your feedback![/size]\n<br />\n<br />\n<br />[b][size=4]Tips and tricks\n<br />\n<br />[/size][/b][size=3]For those looking to create a similar atmosphere to Oblivion Ayleid dungeons, we recommend creating a custom lighting preset with dark, blue colours. The IceImageSpace works particularly well with Ayleid Ruins. Good luck![/size]\n<br />[center][img]https://c1.staticflickr.com/1/982/41740387152_caf3726e7e_o.png[/img][b]﻿﻿[/b][/center][b]\n<br />[/b][center][size=4][b]﻿Varlaisaran\n<br />[/b][size=3]For creating the original exterior assets[/size][b]\n<br />\n<br />Tarius\n<br />[/b][size=3]For creating the original Interior Assets[/size][b]\n<br />\n<br />Markus Liberty\n<br />[/b][size=3]For retexturing, re-modelling and expanding the set with aditional assets[/size][b]\n<br />\n<br />1shoedpunk\n<br />[/b][size=3]For helping expand the set with aditional assets[/size][b]\n<br />\n<br />Simsim\n<br />[/b][size=3][/size][size=4][size=3]For helping expand the set with aditional clutter[/size][/size][size=3][/size][b][size=4][b]\n<br />[/b][/size]\n<br />Hart\n<br />[/b][size=3]For creating the Ayleid Banners[/size][b]\n<br />\n<br />Matth\n<br />[/b][size=3]For implementing animations on several assets[/size][b]\n<br />\n<br />Suran\n<br />[/b][size=3]For creating the Welkynd and Varla stones[/size][b]\n<br />\n<br />Beyond Skyrim\n<br />[/b][size=3]For their efforts in testing and bug fixing the Ayleid building kit[/size][b]\n<br />\n<br />Province Cyrodiil[/b]\n<br />[/size][size=3][/size][size=3]For granting us the permission to port their interior assets[/size]\n<br />\n<br />[size=4][b]TESR: Skyblivion[/b][/size]\n<br />For picking up the ropes and continuing development of the Ayleid Tileset[/center]\n<br />[center][img]https://c1.staticflickr.com/1/946/26913428167_e496f78a56_o.png[/img]﻿\n<br />[img width=135,height=125]https://c1.staticflickr.com/1/823/26918735927_39c37d23ae_o.png[/img]﻿\n<br />\n<br />[size=4][b]The Imperial Society's Discord server\n<br />[/b][size=3]For the latest updates on our resource projects[/size][b]\n<br />\n<br />[/b][/size][url=https://discord.gg/a9bf3Vf][size=4][b][/b][/size][size=4][b][/b][/size][b][size=4][/size][/b][/url][url=https://discord.gg/qnaT9mP]https://discord.gg/qnaT9mP[b][size=4][/size][/b][/url]﻿[b][size=4]\n<br />\n<br />The Imperial Society is a community of modders who enjoy making mod resources, often in collaboration with large projects. Large collaborative projects, such as the Ayleid tileset, are uploaded here on our shared nexus account.\n<br />\n<br />\n<br />[/size][/b][/center]",
  "categoryId": "82",
  "version": "1.0",
  "author": "Imperial Society",
  "createdUnix": "1525167011",
  "updatedUnix": "1525167011",
  "containsAdultContent": false,
  "uploadedBy": "ImperialSociety",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000271869",
      "name": "Ayleid Building Kit",
      "version": "001",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "63587",
      "fileName": "Ayleid Building Kit-90667-001.zip",
      "uploadedUnix": "1525083999",
      "modVersion": "001",
      "virusScanUrl": "https://www.virustotal.com/file/5f465b70c2f04ccaa780f693dbe1a9da55cc572aea058d7b8f49ac1ebd75c3d2/analysis/1525084097/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ayleid%20Building%20Kit-90667-001.zip?fid=1000271869&ttl=1535880895&ri=8192&rs=8192&setec=65edc02661f84b2fb20a227a667587f1"
    }
  ]
}