{
  "modId": 90678.0,
  "modName": "The Tools of Kagrenac (RU)",
  "summary": "Отправляйтесь на поиск, чтобы найти и восстановить легендарные инструменты Кагренака. Встречайте новых союзников и врагов, исследуйте огромное подземелье и добавьте новые мощные артефакты",
  "descriptionHtml": "Это локализованная на русский язык версия мода The Tools of Kagrenac. Оригинал мода смотрите на странице мода по [url=https://www.nexusmods.com/skyrim/mods/87590]ссылке[/url]﻿. Для того чтобы сыграть в этот мод вам потребуется оригинал со страницы автора.Здесь размещен только переведенный .esp файл, скрипты и текстуры заглавных букв. Перевод сделан под МГГ. Есть так-же перевод для [url=https://www.nexusmods.com/skyrimspecialedition/mods/16436?tab=description]Скайрим SE[/url]\n<br />\n<br />\n<br /> ПРЕДИСЛОВИЕ\n<br />\"Будучи преисполнен решимости использовать божественные силы сердца Лорхана для создания нового Бога на благо Двемеров, Лорд Кагренак создал три великих зачарованных артефакта, которые называются \"инструментами Кагренака\".\"Призрачный Страж — это волшебные перчатки, защищающие носящего их от повреждений, которые он может получить, работая с сердцем. Разделитель, или Разлучник — это волшебный молот, нужный для того, чтобы бить по сердцу и получать желаемую силу в необходимом объёме. Разрубатель — это волшебный клинок, который используется, чтобы собирать и фокусировать энергию, поднимающуюся от сердца. Когда Кагренак использовал эти инструменты на сердце в битве при Красной горе, никто не знает, что произошло, но Двемерская раса полностью исчезла из смертного мира..”- \"Инструменты Кагренака\" из Апографа Гилваса Барело\n<br />\n<br />ОПИСАНИЕ\n<br />Если вы играли в Морровинд, то вы знаете, что такое Разрубатель, Разделитель и Призрачный страж, и как невероятно сильны были эти артефакты. Если в Скайриме вы присоединялись к Гильдии магов, то вы вероятно видели Разрубатель в ходе прохождения побочных заданий Арнела Гейна. Но почему Разрубатель настолько слаб по сравнению с его версией в Морровинде? А где Разделитель и Призрачный страж и что с ними случилось?Этот мод добавляет остальные инструменты Кагренака в Скайрим и открывает весь их потенциал!\n<br />- Отправляйтесь на поиски, чтобы найти легендарные инструменты Кагренака!\n<br />- Полностью озвучено 300+ строк диалогов!\n<br />- Насладитесь часами нового геймплея с разветвленным новым подземельем для исследования  и новыми опасными противниками\n<br />.- Узнайте, что случилось с инструментами Кагренака после событий Морровинда,  и восстановите их былую славу. \n<br />- Получите много новых вещей, заклинаний и других сокровищ.Ваши поиски будут нелегкими, но награда и слава будет неизмеримой! \n<br />\n<br />УСЛОВИЯ ДЛЯ СТАРТА КВЕСТА\n<br />Вы начнете этот квест с получения Разрубателя. Для этого вам придется присоединиться к Гильдии магов и закончить несколько побочных квестов Арнела Гейна. Вы также должны иметь законченным квест Дракон в небе, основной сюжетной линии.Через пару дней после того, как вы завершите квест Проект Арнела и получите Разрубатель курьер доставит вам письмо и квест начнется.Убедитесь, что Разрубатель есть в вашем инвентаре, когда квест начнется он превратится в квестовый предмет! Если этого не произошло, попытайтесь выбросить Разрубатель в интерьере какой-либо ячейки, оставьте это место, а затем вернитесь и подберите его снова. Когда Разрубатель станет квестовым объектом, он не может быть выброшен, так вы узнаете, что квест работает правильно!\n<br />\n<br />УСТАНОВКА МОДА\n<br />1. Первым делом скачать полный мод со страницы автора вкладка FILES\n<br />2. Установить все файлы из архива в папку Data в игре, если устанавливаете вручную,  либо используйте NMM.\n<br />3. Далее на этой странице скачать архив с переведенными .esp файлом, скриптами, текстурами и установить в игру с заменой файлов.\n<br />\n<br />ВОПРОСЫ И ПОДСКАЗКИ\n<br />Курьер не появляется!\n<br />Убедитесь, что вы отвечаете всем требованиям квеста, как подробно описано выше в разделе УСЛОВИЯ ДЛЯ СТАРТА КВЕСТА!\n<br />Где кольцо в Арканеуме?\n<br />Ответ: Это в районе стола Урага Гро-шубаЕсли Вы не найдете там кольцо, посмотрите, есть ли у вас какие-либо моды, которые изменяют Арканеум, и конкретно эту область.Попробуйте переместить модуль вниз вашего порядка загрузки или отключите на время другие моды.\n<br />Как мне решить головоломку в хранилище Разделителя?\n<br />Смотрите СПОЙЛЕР в архиве!\n<br />Этот мод конфликтует с модом(Х)?\n<br />Этот мод не должен иметь конфликтов с модами, которые не редактируют Разрубатель и места затрагиваемые модом.\n<br />Будете ли вы создать патч к моду(Х)?\n<br />Зависит от того, насколько сложным будет создание этого патча.\n<br />Я могу перевести ваш мод на другой язык?\n<br />ДА! Пожалуйста, поделитесь своим переводом с нами, чтобы мы добавили его на страницу и больше людей могут найти его.\n<br />Могу ли я использовать ресурсы с вашего мода для моего собственного проекта?\n<br />Зависит от активов, поскольку не все в этом моде было сделано нами.\n<br />\n<br />БЛАГОДАРНОСТИ\n<br />TitansBane: игровой дизайн / дизайн уровней\n<br />PrivateEye: Арт-активы / дизайн уровней / История\n<br />Ben Britton: озвучка\n<br />Большое спасибо следующим моддерам, которые поделились своими активами:\n<br />lifestorock - захватывающие существа\n<br />lautasantenni - Броня и оружие из этерия\n<br />Skyrimlazz / jgreybear - Айлейдские ресурсы\n<br />Varlaisaran - Айлейдские камни\n<br />Urbansiv - Базовая модель и текстуры Призрачного стража\n<br />Leanwolf - модель улучшенной формы Разрубателя\n<br />\n<br />От переводчика: Не забудьте пожалуйста поблагодарить [url=https://www.nexusmods.com/skyrim/mods/87590]PrivateEye[/url]﻿ за предоставленную нам возможность поиграть в этот замечательный мод!",
  "categoryId": "35",
  "version": "1.0",
  "author": "MF89",
  "createdUnix": "1523432950",
  "updatedUnix": "1523432950",
  "containsAdultContent": false,
  "uploadedBy": "MF89",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000270493",
      "name": "The Tools of Kagrenac LE V 1.0 RU",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "593",
      "fileName": "The Tools of Kagrenac LE V 1.0 RU-90678-1-0.7z",
      "uploadedUnix": "1523432318",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f141183a09160528342856fe899486dfedc372b86f8146f39429d3d16221618c/analysis/1523432407/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Tools%20of%20Kagrenac%20LE%20V%201.0%20RU-90678-1-0.7z?fid=1000270493&ttl=1535880905&ri=8192&rs=8192&setec=449bdcc194381503255747a4ee9d1084"
    }
  ]
}