{
  "modId": 9070.0,
  "modName": "Gabby the Cute Pastry Chef Companion",
  "summary": "Adds a cute half Dark-Elf npc with a thing for sweets, found in Windpeak Inn at Dawnstar.\r<br />Includes personal quest, custom voiced dialogue and can dance for you.\r<br />She is a potential wife and/or follower after completing her personal quest.",
  "descriptionHtml": "NOTE from squ1g9y\r<br />6/14/2012: I will no longer be supporting this mod. Thanks everyone for your support.\r<br />\r<br />\r<br />\r<br />==========================================\r<br />\r<br />[b]GABBY THE CUTE PASTRY CHEF COMPANION by: squ1g9y & Lady Karrakaz[/b]\r<br />\r<br />==========================================\r<br />\r<br />\r<br />Please, read the description, especially the troubleshooting section before reporting any issue in the comments. Thanks & enjoy your new companion&#33; \r<br />\r<br />\r<br />\r<br />\r<br />============================\r<br />\r<br />[b]DESCRIPTION[/b]\r<br />\r<br />============================\r<br />\r<br />\r<br />[b]COMPANION GABBY FEATURES:[/b]\r<br />\r<br />- Fully voiced dialogue, including a unique personal quest ;\r<br />\r<br />- She is also a potential follower and wife after completing her personal quest ;\r<br />\r<br />- Her level scales with the Dragonborn, the stronger you get the stronger she gets ;\r<br />\r<br />- Doesn&#39;t effect stealth or trigger traps ;\r<br />\r<br />- Specializes in either bows or one-handed sword depending on what you give her ;\r<br />\r<br />- Essential, so she can take the extra friendly fireball or arrow to the back of the head ;\r<br />\r<br />- Get some special sweetrolls as a reward, or buy it from her ;\r<br />\r<br />- Gabby has some custom dialog about her life in Dawnstar ;\r<br />\r<br />- She&#39;ll dance if you ask her to ;\r<br />\r<br />- The player can ask her to change her default outfit and remove her chef hat. \r<br />\r<br />\r<br />Location: Gabrielle can be found at the Windpeak Inn in Dawnstar. After completing her first personal quest, she will be your friend and reward you with her ooey gooey sweetness. She can then be married or asked to follow you.\r<br />\r<br />\r<br />[b]GABBY&#39;S BACKGROUND STORY:[/b]\r<br />\r<br />Gabrielle Bahrae-ventos is half dark elf born into Skyrim in troubled times. Her parents died at an early age due to tensions of an interracial relationship. She and her brother were left to the care of her aunt. \r<br />\r<br />At the age of 17, the young Gabby decides to run away in hopes of finding a better life and a way to provide for her few remaining family members. Her reluctant aunt eventually agreed that there was no future for her in Windhelm and decided to help smuggle Gabby out of the Grey Quarters. Gabby&#39;s small and thin figure made it an easy task.\r<br />\r<br />Gabby decided to make her start in Solitude. However, the journey across Skyrim was a long one, and not cheap either. So midway and running out of money, she decided to take a part time job at the Windpeak inn, eventually, hoping to save up enough gold to make her trip to Solitude. \r<br />\r<br />A month passed and while working, Gabby discovers that she has a natural talent for baking sweets. Her sweetrolls quickly became a sensation around Dawnstar and gave Gabby quite a reputation. Coming into her new shoes, Gabby decided to further develop her talent and to use her abilities to spread sweetrolls all over skyrim. \r<br />Even til this day Gabby still works at the Windpeak Inn, hoping to save up enough gold to start her adventure.\r<br />\r<br />The young and friendly Dunmer will soon get much more adventure than she has ever expected.\r<br />\r<br />\r<br />\r<br />\r<br />==============================\r<br />\r<br />[b]RECOMMENDED MODS[/b]\r<br />\r<br />==============================\r<br />\r<br />\r<br />[b]MODS USED TO MAKE GABBY LOOK LIKE THE SCREENSHOTS:[/b]\r<br />\r<br />\r<br />mrLenski&#39;s Coverwomen VERY HIGHLY RECOMMENDED\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=3563\r<br />\r<br />Xenius&#39; High Quality Eyes v1.2 Darker&Desaturated version\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=498\r<br />\r<br />Dimon99&#39;s UNP Body replacer.\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=6709\r<br />\r<br />Please note that these 3 mods are only cosmetic and can be replaced by other mods, for instance, people who use Bella&#39;s popular face textures will see a different Gabby appear than on the author&#39;s screenshots.\r<br />\r<br />Optional: if you want Gabby to look exactly like the screenshots, the black armor with skirt she wears is [url=http://skyrim.nexusmods.com/downloads/file.php?id=7681]Karliah armor[/url] by Hentai. \r<br />\r<br />\r<br />[b]COMPATIBILITY WITH OTHER MODS:[/b]\r<br />\r<br />\r<br />Gabby should be pretty much compatible with any mod changing the default vanilla follower or spouse AIs. The way gabby mod is made does not change in any way the vanilla system and uses the default AI. If you have mods overhauling the follower system, load Gabby first and then the big follower mod. \r<br />\r<br />[b]Here are a few mods that could improve your follower experience:[/b] \r<br />\r<br /> - [url=http://skyrim.nexusmods.com/downloads/file.php?id=9504]Followers can relax mod[/url]. \r<br /> - [url=http://skyrim.nexusmods.com/downloads/file.php?id=11370]Spouses can live everywhere[/url] Gabby will be able to live in modded houses...   \r<br />- [url=http://skyrim.nexusmods.com/downloads/file.php?id=14037]UFO - Ultimate Follower Overhaul[/url]  - Be sure to load Gabby before UFO or you won&#39;t be able to hire multiple followers. \r<br />- [url=http://skyrim.nexusmods.com/downloads/file.php?id=4020]Move it &#33;[/url] ;\r<br />- [url=http://skyrim.nexusmods.com/downloads/file.php?id=11609]Follower Trap Safety[/url] ;\r<br />- and certainly many others...\r<br />\r<br />In any case, try using [url=http://skyrim.nexusmods.com/downloads/file.php?id=6]BOSS[/url] to manage your load order. It helps a lot when playing with many mods. \r<br />\r<br />\r<br />\r<br />\r<br />============================\r<br />\r<br />[b]CHANGELOG[/b]\r<br />\r<br />============================\r<br />\r<br />\r<br />v1.3a \r<br />Set Gabby&#39;s level multiplier to 1, removed Hentai Karliah Armor.\r<br />\r<br />v1.3 \r<br />Fixed Innkeeper AI Package small conflict. Biggest additions are the voiced dialogues, including scripts to change her default outfit or take off her hat.\r<br />Gabby now dances&#33; You can ask Gabby to show you her moves after some interaction (This is mostly a place holder until we add more quests).\r<br />Allowed her to be married after her personal quest again (Again another place holder until more quests can be added)\r<br />Fixed some typos in the quest log and speech. Thanks to everyone who pointed them out.\r<br />\r<br />v1.2\r<br /> Adds voice acting for Gabby&#39;s quest and general bug fixes and follower AI enhancement. Moved Sweetrolls from the barrel to the counter. Added Inn Server AI package, Set Thoring as her boss.\r<br />\r<br />v1.1 \r<br />Fixed fast flowing dialogue text\r<br />\r<br />v1.0 \r<br />First release\r<br />\r<br />\r<br />\r<br />\r<br />==============================\r<br />\r<br />[b]TROUBLESHOOTING[/b]\r<br />\r<br />==============================\r<br />\r<br />\r<br />[b]The mod itself has no known bug we are aware of.[/b] \r<br />\r<br />Just please take note that: \r<br />\r<br />- At the moment, no mod has found a way to replace vanilla follower dialog with custom voice. Once this will be done without affecting compatibility, the vanilla lines will hopefully be replaced by her custom voice. This includes also replacing marriage dialogue with custom voiced scripts. Meanwhile, Gabby will have 2 different voices, once for the vanilla lines, one for her custom lines. \r<br />\r<br />-  If you want the dancing animation to display properly when asking Gabby to dance, you have to talk to her and remain still. Don&#39;t move your character or Gabby will try to follow you (her follower AI stops the animation), and the animation won&#39;t display even if you&#39;re able to hear the music. Just ask her to dance and stand still for watching ;)\r<br />\r<br />- Some rare users have reported that for some reason, their quest log does not update when looting the basket of sweetrolls from Charlsdam. Try dropping the basket and taking it again, it solves the issue. It&#39;s a glitch reported for some other quest mods, must be engine related.\r<br />If you really are unable to complete the quest, use this console command: &#34;player.completequest gtn01 &#34; without &#34;&#34;.\r<br />\r<br /> - If you use a version of the game other than English, this mod might translate a few items name into English. If you want to provide translations for other language versions, please feel free to do so.\r<br />\r<br />\r<br />[b]There are frequent vanilla issues you can encounter with any follower or spouse because the vanilla follower AI and marriage system has a few flaws.[/b]\r<br />\r<br />Until this is fixed by Bethesda or other mods, Gabby could suffer from these problems. Here are some of the most common issues and how to fix them: \r<br />\r<br />- Follower tends to revert to their default outfit after being dismissed for a while. Though they normally don&#39;t lose what was in their inventory. But it&#39;s a vanilla feature. Now since version 1.3, the player can ask Gabby to change her default outfit. Just be sure to tell her to wear her chef outfit before dismissing her. \r<br />\r<br />- Also a vanilla/original game bug, if you give Gabby a bow, she&#39;ll switch for a default bow in the middle of fight. There are many follower mods around the Nexus that fix this problem already. If you use any of them, Gabby should be fixed.\r<br />\r<br />-  The Marriage system is bugged in Skyrim, so be sure to save before entering the Temple of Mara and beginning the ceremony. As some other vanilla spouses, Gabby sometimes rushes through the Temple at the end of the ceremony and can be found nowhere else. This is because sometimes, the newly wed spouses leave the Temple before the player gets the dialog to choose the default home location for the spouse. Some solutions you can try:\r<br />* Wait and go back to the temple of Mara, Gabby should show back there eventually as this is the default living place location for spouses ;\r<br />* If it doesn&#39;t work, reload your save before the marriage and rush to her before she exits the Temple of Mara. \r<br />\r<br />\r<br />\r<br />\r<br />==============================\r<br />\r<br />[b]CREDITS[/b]\r<br />\r<br />==============================\r<br />\r<br />\r<br />Squ1g9y - Original mod creator\r<br />Karrakaz - Voice actress for Gabby and whimsical muse\r<br />\r<br />Help from other modders and resources used:\r<br />RSV -  for the Galaxias Dance Animation Gabby uses",
  "categoryId": "66",
  "version": "1.3a",
  "author": "squ1g9y",
  "createdUnix": "1329015447",
  "updatedUnix": "1336770266",
  "containsAdultContent": false,
  "uploadedBy": "squ1g9y",
  "primaryFile": null,
  "files": [
    {
      "fileId": "60575",
      "name": "Gabby the Cute Pastry Chef Companion",
      "version": "1.3a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40067",
      "fileName": "Gabby the Cute Pastry Chef Companion-9070-1-3a.rar",
      "uploadedUnix": "1336770266",
      "modVersion": "1.3a",
      "virusScanUrl": "https://www.virustotal.com/file/5e4ed1666dd7c9b9420b70acdf47bae95c1be4700833dcbf8778e8a5f147ac16/analysis/1406885830/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gabby%20the%20Cute%20Pastry%20Chef%20Companion-9070-1-3a.rar?fid=60575&ttl=1535768315&ri=8192&rs=8192&setec=f1ce97f75d2f57d80d47c18f2cd8be9b"
    }
  ]
}