{
  "modId": 90729.0,
  "modName": "Saint Ruth Empress edition",
  "summary": "A beautiful black and white armor. Available for anyone, but especially gifted to practical female characters",
  "descriptionHtml": "OPTIONAL PLUS WARNING. The second file contains everything needed to make this armor standalone. Trouble is, I'm not sure how to label the folders and esp. If someone would be kind enough to download the second file and tell me what I need to do, we can get the standalone version up. Otherwise you need the original gothic plate armor plus my texture. Technically, the second file contains all of that, but I want to make a version that doesn't overwrite the original gothic plate. Now on to the mod\n<br />\n<br />Skyrim is cold. proper protection is important. Need to look good while slaying thalmor scum? Want to make Elenwen lime green with jealousy on the FashionSouls catwalk? This is the armor for the discerning lady. \n<br />\n<br />Special thanks for those who use \"practical female armory\" and similar mods. This mod and all my mods are especially treated for you happy few. Nothing wrong with the other style, I'm just trying to add a few to the other pile. To each there own choice. 'Merica, yea\n<br />\n<br />I just got a brand new computer and thought I'd redo my first mod, which was to bring the excellent \n<br />Gothic Plate Armor\n<br />https://www.nexusmods.com/skyrim/mods/83507\n<br />\n<br />in line with my personal characters preferences. This time I went even further to not only customize it to her style, but to also achieve a brand new look for the armor.\n<br />\n<br />The purple plant on the back of the shoulder is an artichoke. Go see what an artichoke flower looks like, its incredible. The artichoke is the family crest of many citizens of Gethesmain. Much like variations of an eagle or lion are used as heraldry.\n<br />\n<br />The Sallet helmet, if you look very very closely has the same kind of \"Teeth\" imprint as the helmet from the Elite Knight set. It didn't come out bright enough, so the next release, which will be separate, will have more defined textures. Spooky scary skeletons\n<br />\n<br />I'm on Dark Souls 2 and 3 for anyone who wants to challenge a poison build. I would really like to have any feed back whatsoever. I'd be very interested in ideas of what to do with the Tasset (front skirt part) as well as the upper Cuisse (upper thigh armor). I plan to add the sun burst texture again to the vambrace (forearm protection).\n<br />\n<br />Thanks for looking. I am very interested in your comments and ideas. I'm even willing to take on new retextures if the armor is interesting.\n<br />\n<br />Lastly: No boob plate version ever, though I'm willing to talk about a Chaps version. this is already set to fit the CBBE body. My character Shiragiku Ruthuyla uses a unique hair style that is no longer found on the internet. I was very very fortunate to have downloaded a hard copy when I had the chance. If someone can find out why Hepsy Hairr CC was taken down, and whether or not I can reupload it then MAYBE I will release Ruthula as a follower. She's not a child, but she's about as tall as Braith. I hope someday to give her a voice. It will not at all sound like some anime girl. Ruthula is like... 30. actually, here: this is her voice.\n<br />Exist Trace: Water. Draw your SWORDS!\n<br />https://www.youtube.com/watch?v=futhRKUIxig",
  "categoryId": "54",
  "version": "1",
  "author": "gethesmain aka Michael Smith",
  "createdUnix": "1523700551",
  "updatedUnix": "1523847944",
  "containsAdultContent": false,
  "uploadedBy": "Gethesmain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000270663",
      "name": "Saint Ruth Empress edition",
      "version": "1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "27089",
      "fileName": "Saint Ruth Empress edition-90729-1.7z",
      "uploadedUnix": "1523700377",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d47c91cd8176a10f826061b71fd1a626c3acfbd8333f872cf8e77686dcb0e9e0/analysis/1523700639/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saint%20Ruth%20Empress%20edition-90729-1.7z?fid=1000270663&ttl=1535880996&ri=8192&rs=8192&setec=e44585085d9a35606939bb4d115faa22"
    },
    {
      "fileId": "1000270668",
      "name": "Saint Ruth Empress edition",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24606",
      "fileName": "Saint Ruth Empress edition-90729-2.7z",
      "uploadedUnix": "1523706386",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/aca0227be327743caecaa65621dc17d20e85727baa69717daa37a132603c56ca/analysis/1523706577/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saint%20Ruth%20Empress%20edition-90729-2.7z?fid=1000270668&ttl=1535880997&ri=8192&rs=8192&setec=b52d00847cf9ffd122b1abbf111b9846"
    },
    {
      "fileId": "1000270795",
      "name": "Standalone NOT WORKING RIGHT",
      "version": "0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50757",
      "fileName": "Standalone NOT WORKING RIGHT-90729-0.7z",
      "uploadedUnix": "1523847944",
      "modVersion": "0",
      "virusScanUrl": "https://www.virustotal.com/file/410fbbe22f665331df9c5dcb099e1665ea4afc6e8a2452181341723d53750413/analysis/1523848029/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Standalone%20NOT%20WORKING%20RIGHT-90729-0.7z?fid=1000270795&ttl=1535880997&ri=8192&rs=8192&setec=b55f937bd640d4255b7229ab86b7938e"
    }
  ]
}