{
  "modId": 9073.0,
  "modName": "Shadowscales -CMR-",
  "summary": "The Shadowscales? They were all killed off, right? No. Not at all. This mod immerses you in the world of shadowscales. Although still a WIP, it will eventually add hours of gameplay, as the \\\"Dark Brotherhood I wish we had\\\". ",
  "descriptionHtml": "This Mod is currently still in ALPHA, meaning we are still working on interior cell issues such as lighting, scripting, and so on. Bear with us while we work these issues out, it shouldn\\'t take us very much longer. We do appreciate feedback, but please do so in a appropriate manner, please be respectful to the mod team and the other people who are leaving and reading these comments.\r\n\r\nDescription:\r\nTake control of the destiny of the Shadowscale, a lost Elite cell of the Dark Brotherhood, as they battle their way through the Darkness they have immersed themselves in. Unearth the lore and history behind the shadowy past of what led this Elite cell underground, and learn what they have to teach as you battle your way through their dark past and shady present. Your darkest dreams and most terrible nightmares wont even begin to touch what you will discover as you unearth what they have awoken from an eternal sleep.\r\nThis mod will add hours of intense gameplay with 4 Main Storylines and several Branching Storylines, these will be constantly updated and added upon, making it a constantly evolving ultimately a massive mod that we hope you will enjoy.\r\n\r\nWe have a website for CMR currently in production. A link will be available soon.\r\n\r\nThe current expansions for shadowscales are:\r\n -Undercity (a town in a completely new mod that Anstilles is heading up), a work in progress.\r\n\r\n",
  "categoryId": "25",
  "version": "0.5.0",
  "author": "ClaneModdingResources",
  "createdUnix": "1329017202",
  "updatedUnix": "1330983514",
  "containsAdultContent": false,
  "uploadedBy": "hlane",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40539",
      "name": "Shadowscale 0_5_0",
      "version": "0.5.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "220",
      "fileName": "Shadowscale 0_5_0-9073-0-5-0.zip",
      "uploadedUnix": "1330983514",
      "modVersion": "0.5.0",
      "virusScanUrl": "https://www.virustotal.com/file/b5ea0f885d60b113f1ee8e762ddd55567e0befc6adf1f211fcd657f6a7729e30/analysis/1406733455/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shadowscale%200_5_0-9073-0-5-0.zip?fid=40539&ttl=1535768318&ri=8192&rs=8192&setec=1c278b2d6caee21bb6ea26d1f9df011e"
    }
  ]
}