{
  "modId": 90760.0,
  "modName": "Chest of the Lost Heroes",
  "summary": "This mod adds vanilla and DLC items that were either not added in the game, selected as unplayable,  were not possible to get even if they were playable, or in the CW and could not be taken if you chose the Imperials.",
  "descriptionHtml": "[center]Welcome to my mod, Lost Chest of the Heroes. Let's begin with what this is about.\n<br />\n<br />Description: I have gone through the CK and found both vanilla and DLC items that were not implented in the game, made unplayable, or weren't possible to get. All items are Bethesda's creations and nothing has been recreated or modelled. The chest that holds the armor and weapons can be found behind the Abandoned Shack between Morthal and Solitude (The same shack Astrid kidnaps you to, but on the outside and behind the shack, it's a big chest you won't miss it.). Here are the items that I have gone through and added along with some footnotes. I have changed all the armor to either light or heavy so you can actually wear it if you wish. There is a little book in front of the chest, hard to see a little that tells a small note of who put it there and why. Two mysterious strangers.\n<br />\n<br />These are all the known items so far, if I have missed anything, please do let me know and I will attempt to add an update with it. You should able to enchant them and possibly improve on them.\n<br />\n<br />                                                                                ~~~~~~~~~~~~~~~~~\n<br />\n<br />\n<br />[b]Updates: [/b]\n<br />Adds the Blindfold model to the races who couldn’t wear it.\n<br />Orcs and the beasts races look rather bad with them, so not recommended for them. It does work on elves, but clips a little above one of their eyes.\n<br />Nightingale and Blade of Woe along with Ancient Shrouded Armor have been included, for RP purposes, for anyone who do not wish to do the TG questline but wants the Nightingale Armor set, and for those who do not want to kill or join the Dark Brotherhood (If you are like me and like all the members, so on my good guy characters I ignore them). However given they can be powerful items, I have chosen to put them in with the enchanted stuff. You can pick it off the enemies guarding them.\n<br />\n<br />Adds a new part to the book found outside of the Chest of Heroes and explains where you can get enchanted version of these armor.\n<br />\n<br />Several enemies have been added to the dungeon of Fahltharz on Solstheim, on the last level. Be warned they are high level (Highest is 30), and there are other enemies in the room, the ruin’s natural enemy. Tip, sneak before going through the door and be wary of your surroudings. The weaker ones are aleast level 20-30, the two bosses are a little higher. Bring plenty of potions and one or two companions. Think about what’s around you. I will add an tip section and keep it covered as an spoiler for those who wishes to try and do it on their own. \n<br />The Dwarven ruin itself does have 4 floors, the end part where the enemies are does have a small mechanism to open up the last room (But it’s easy, will be spoiled in the spoiler section) The spoiler section will be at the bottom of the mod page, for those who do really want an challenge and not know what is ahead.\n<br />One advice, is to just grab many potions as possible, this won't be an easy fight unless you are decked out in echanted gear. And bring a few allies too. (You will want to share the loot with them)\n<br />\n<br />It will be a hard part of the dungeon (Which granted, the Dragonborn DLC already had tough enemies, so by the time you get there, you should be ready), so if you wish to just skip all of that and not have to fight, there are a few options.\n<br />1. Use console command and type TGM, you can still fight them and get what you want.\n<br />2. Use console command and type Skinwalker, this will bring the chest up that has the items in it, type in the ID and the chest will appear at your feet.\n<br />3. Bring lots of companions and mow them all down.\n<br />\n<br />The enchanted set of Ivory Armor has been renamed from Falmer to Elite Snow Elf Armor, to allow it to sound higher.\n<br />All the enchanted items will be stronger then Daedric items, why? To make it worth it to fight through the enemies and reach the items, plus so it is possible for you to change the armor you are wearing to something stronger. (Items not made stronger are the Blindfold and the bandages but will be enchanted.)\n<br />Also for your followers to wear, have a mod that allows you to recruit the DB or TG members? The Blades or anyone with high level items? This will help to get them to change into the new armor sets.\n<br />Sheogorath and Nocturnal have more enchantments due to the fact they are Daedra Princes, and thought it would be nice to give an similar sort to these armors.\n<br />Herebane’s set and Ash Spawn weapons were not included in the chest, as they were already enchanted. Herebane’s set is basically Elven as well.\n<br />\n<br />You can now craft and improve your own weapons and armor, including the Arm bandages and blindfolds. \n<br />\n<br />\n<br />[b]\n<br />[/b][b]Recommended mods: (Not needed but helpful for the trial ahead)[/b]\n<br />Sneak Tools is an useful mod that can help you if you are an assassin/thief in high perks, knock the first enemy out on the ground and sneak right underneath the three, use your archery skills to attack them with poision or use Unrelenting shout to knock them off. Sneak Tools will let you knock an NPC out (\n<br />Sleep Spells- Spells that will allow you to put the enemies to sleep, if you are careful you could potentially put everyone to sleep and take the spoils right out of the place.\n<br />The more companion mods you have the better and fair the fight can be (Unless everyone is in Dragonborn armor, then it would just be too easy). I suggest Recorder, Sofia, Arissa, Inigo, or Vilja. Anna NPCS can be a great companion mod to grab good warriors from. Also Share and Recruit will let you recruit any NPCS.  Pick an long range ally and a close range so they can help, think what you would do if you were facing enemies with a group. (I definitely recommend this, as it gives a more feel of an party, and able to spread loot to your allies helps).\n<br />Mods that make gameplay harder, the armor and weapons will be strong as the Daedric ones, give them to your followers and find the mods that give harder enemies, so all that can be for a good cause. \n<br />\n<br />\n<br />\n<br />\n<br />                                                                                       ~~~~~~~~~~~~~~~~~~~~~~~\n<br />\n<br />Nord Hero Arrow- 50x (The end of the arrow has different textures)\n<br />\n<br />Spectral Arrow (Spelltome, it's an conjuration item that allows you to shoot arrows from both hands and without using an bow. A little OP but worth it. Unforuently the arrows are hard to see, as you cannot see them in the photo I tried to showcase them in. The Noctural Photo that my character Noir is wearing.)\n<br />\n<br />Arm Bandages\n<br />\n<br />Executioner's Robes set (Male only, females will end up with the DB robe set.)\n<br />\n<br />Embroidered Garment- (Worn by Torygg and impossible to get)\n<br />\n<br />Herebane Courage and Fortress= (Photo left out, other youtube videos have suggested the models are Ebony textures, however mine look vastly different, unsure what mod has made it look like, let me know if it's the same in your game.\n<br />\n<br />Arm and head bandage\n<br />\n<br />Greybeard set (Light. Note Male and Female models exist strangely for an all male group)\n<br />\n<br />Psiijic set- Light set (Actually playable but could not be obtained as the only ones who wear it are the ghosts of the Psiijic order. I have also added the Light armor outfit)\n<br />\n<br />Moth Priest Blindfold (Light) )Works fine on male, my female Breton had a little bit of an clipping issue on her right eyebrow. And my male High Elf won't wear it, so it is possible that only Nords, Redguards, and Bretons are able to wear this.\n<br />\n<br />Ulfric Clothes/gag- Heavy/Light (Ulfric's clothes are male only unless you have the mod that lets it stay the same as a female. Another set has been put in the chest for those who chose the Stormcloaks, and want Ulfric's clothing.\n<br />\n<br />Ivory Set- Two curiass exist and are put in the chest, I am unsure why this is as they look exactly the same on my female character. The crown is included.)\n<br />\n<br />Giant Fishman Weapon- (Turned into test 2. It looks like the Giant's club but referenced as Fishman weapon.)\n<br />\n<br />Ash Spawn weapons- Renamed to Molten Lava and Flamebringer, while leaving the originals alone, for whatever reason the models show up in the chest and on the player after doing so.\n<br />\n<br />Giant Club\n<br />\n<br />Stormcloak Sleeves- \n<br />\n<br />Tsun armor/axe set (Male only) Light (Axe not seen in the photo, but exists in the chest.)\n<br />\n<br />Summerset shadows armor set\n<br />\n<br />Cyclone spell- (Spell used by Ash spawns, I want to give an special thanks to an Youtube known as Epicnate315, didn't know this spell existed if it wasn't for his videos. Only appears on the right hand.\n<br />\n<br />Sheogorath set  (Light)\n<br />\n<br />Nocturnal (Both genders can wear it, but the males may look strange. I have added the skimpy tag because of the Nocturnal outfit.)\n<br />\n<br />Vorpal Blade (Renamed to Vorpal Sword of the Immortal, use as an joke)\n<br />\n<br />Phantom Blade (Renamed to Phantom Blade 2, only spawn by console, I think it's more of a joke sword that was intended for an phantom)\n<br />\n<br />                                                                                                  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n<br />\n<br />[b]Requirements:[/b]\n<br />Dragonborn\n<br />Dawnguard\n<br />\n<br />Sorry, but they do add items from these two DLCs, but everyone usually has them by now.\n<br />\n<br />                                                                                          ~~~~~~~~~~~~~~~~~~~~~~~~~\n<br />\n<br />[b]Footnotes:[/b] The weapons that were difficult to get working.\n<br />\n<br />I have enabled the Fishman weapon to be playable, it can spawn via the console however you will not see the item. \n<br />It appears the Fishman is just an stronger verison of the Giant’s club, whatever it was intended for, I managed to rename it and put it in the chest for anyone who wants to use it just because, the club will indeed appear.\n<br />\n<br />There exists an sword known as the Phantom Sword, I am not sure who is supposed to carry this as there is no known NPC, it is however listed as MQ105, whether it is actually in the game and I have failed to notice, or it was cut from the main quest I am unsure. The model does not exist, so I have removed it from the chest. I have made an test form of it, what happens is there is no real model, which may be intended as it is called Phantom. If you wish to try it as an joke playthrough, then they are called Phantom Sword and Phantom Sword 2, I used it and the NPC still got damage (As I changed the damage rate, previously at 1), there was no CTD but it could happen. Feel free to use at your risk.\n<br />\n<br />The Ash Spawn weapons would not be added on it’s own, so I just renamed the ID and weapon, so it is still the Ash Spawn’s weapons but has an cooler name. Leaving one Molten Lava (The Battleaxe) and Flamebringer (Two one hand axes) so it can be unique, if you wish to have more, then the chest will respawn.\n<br />\n<br />Another sword that exists is known as the TestVorpal Sword, it has the model of the Ebony Blade (The two hander), this may just be another joke sword as damage is over 9000 (10000 to be exact). I have renamed it to the Vorpal Sword of the Immortal for those who do not wish to use this OP sword that kills anything in one shot.\n<br />But for those who want to mess around with it, just go to the console ~ and type in Vorpal, choose the one that says Vorpal Sword of the Immortal and go crazy.\n<br />\n<br />Last but nothing serious, the Herebane Courage sword and shield seems to have it’s model changed, I am unsure if a mod has done this (Possible Cutting Room as it adds the sword back to the game), it has two splits between the inner of the blade, so I haven’t posted a photo of it as I do not want someone to mistake the model as something I did. If someone can upload another photo of it in their game to show what model it is (It may be the same, I saw the same blade in a youtube video and looked different).\n<br />\n<br />\n<br />\n<br />\n<br />~~~~~~~~~~~~~~~~~~~~~~~~~~\n<br />Only read if you wish to know how to kill the enemies ahead and know their identities. \n<br />\n<br />[Spoiler]﻿\n<br />[b]Spoilers-[/b]\n<br />There are 4 Skinwalkers in the room, three are on top of an ledge and will \n<br />less likely to see you, one will patrol close to the door so be wary of \n<br />him as he can set off the alarms for the others. Once you are done with \n<br />them, go to the stairwell and you will see two Dwarven Centurion that \n<br />shouldn’t have waken up yet, attack one first and then the other, take \n<br />the Dynamo item from the corpse and head up to where the Skinwalkers \n<br />were, you will see three stands, two are empty. Activate them and the \n<br />door will open to the last two bosses. Sneaky people can perhapd get \n<br />pass them, the big chest is by the rest of the spoils that will contain \n<br />the enchanted items. The last two bosses can use shouts and won’t be \n<br />easy.\n<br />\n<br />If you don’t care for the spoilers, are are the Skinwalkers the book mentions, of familiar faces. If you care about RP feel free to act\n<br /> surprise ingame and use whatever methods you want to do to try and stop\n<br /> them. Think your character is loyal to one to the end? Then try to put \n<br />them to sleep.\n<br />\n<br />The first one you will see, will wear the face of Balgruuf the Greater in \n<br />Nightingale gear and using a sword, he isn’t too hard to take down if \n<br />you got the level for it. Try to kill him first.\n<br />The weakest of the four will be Faendal, at lv20, he is the easiest to kill but like the \n<br />real Faendal, uses bows and will stay back. (Hint, Unrelenting shout can\n<br /> hurt if used on the three above).\n<br />The last two are Astrid and Aela the Huntress. Aela has an nightingale bow that will be difficult to use \n<br />but she hangs back too, try to avoid her.\n<br />The real challenge I have seen is actually Astrid, still as an assassin she will be fast and \n<br />weilds the Blade of Woe and the Dragonbone dagger (The BoW is an bonus \n<br />for those who don’t really care for doing the DB or killing the original\n<br /> Astrid). She is also immune to poison due to the Ancient Shrouded armor\n<br /> she ois wearing, and immune to paralysis. She can be taken down if you \n<br />are high enough, use whatever to slow her down.\n<br />Be wary, there is an Dwarven Ballista that will assist the Skinwalkers, but can be taken down. \n<br />Astrid can be taken out by Unrelenting force if you sneak close enough before \n<br />she sees you, she will either die being thrown off the platform or be \n<br />injured.\n<br />\n<br />In the final room you will come face to face with two more familiar faces that the Skinwalkers have taken of. Ulfric and \n<br />Elisif, the real challenge has truly begun. To make it interesting, \n<br />Elisif can now use the Unrelenting Shout and only uses elemental magic \n<br />(You fought an warrior, hunter, assassin, so you might as well fight an \n<br />Mage.). Use plenty of potions, try to stay out of range from Elisif (It \n<br />can be done) and remember now the door is opening, the whole room can be\n<br /> used. Ulfric will be similar to what you fought in the CW, remember \n<br />this is why we have companions. Sic someone like the original Aela onto \n<br />Elisif or make Lydia fight Ulfric while you take care of the rest. \n<br />Elisif will be weaker in health but Ulfric’s only true weapons is an axe\n<br /> and his unrelenting shout.\n<br />Another tip is if you stay where the controls are in the first room (That you used the Dynamo on) you can \n<br />actually sneak attack whichever one is sleeping on the bed, it’s hard to\n<br /> see but you will able to make them out. Stay on the platform, Elisif \n<br />and Ulfric will be easier to tke down.\n<br />\n<br />All of this will be an challenge, but a real trained warrior could easily take them, stealth \n<br />characters will have an nice time to get them.\n<br />[/spoiler]\n<br />\n<br />                                                                               ~~~~~~~~~~~~~~~~~~~~~~~\n<br />\n<br />[b]Credits[/b]\n<br />: None of these items belong to me. All vanilla and DLC assets belong to Bethesda, I have just made them playable and obtainable. Thank you Bethesda for making an amazing game.\n<br />Nothing in the photos used on the models belong to me, many of the extra stuff some characters are seen wearing or followers belong to the amazing modders that have made Skyrim far more a greater experience that there ever was. The photos were taken to showcase the weapons and armour you are now able to use.\n<br />\n<br />If anyone wishes to edit this mod, whether it's to add NPCS wearing the armor to make quests that allow someone to go obtain these items in an harder fashion, or even want to make an model out of the Fishman/Phantom weapons, then go for it. I am but a small time modder whom best efforts and knowledge in the CK, is able to transfer my character's faces from the savegames to NPCS and make them into basic followers with hairstyles that come from other mods. I wish I could expand even bigger on this, but until I can learn to make some epic, voice acted dialogue that makes you really want to go hunting for these items, then it's all I can do.\n<br />\n<br />The models used in the photos are the characters I am playing through Skyrim, yes I have a lot of them. Their names can be seen in the photos section on what they are doing.[/center]",
  "categoryId": "36",
  "version": "2",
  "author": "Umbren91",
  "createdUnix": "1523860205",
  "updatedUnix": "1524441439",
  "containsAdultContent": false,
  "uploadedBy": "Umbren91",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000270809",
      "name": "Chest of the Lost Heroes",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "29",
      "fileName": "Chest of the Lost Heroes-90760-1-0.rar",
      "uploadedUnix": "1523859870",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1e0879740b08f300189ec9c3c5e2f478781c5027e42fbed6245abc93eb86508f/analysis/1523859963/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chest%20of%20the%20Lost%20Heroes-90760-1-0.rar?fid=1000270809&ttl=1535881042&ri=8192&rs=8192&setec=fd625010702723eeb51f4d2d2d22dda5"
    },
    {
      "fileId": "1000270810",
      "name": "Chest of the Lost Heroes",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29",
      "fileName": "Chest of the Lost Heroes-90760-1-0.rar",
      "uploadedUnix": "1523859954",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1e0879740b08f300189ec9c3c5e2f478781c5027e42fbed6245abc93eb86508f/analysis/1523859963/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chest%20of%20the%20Lost%20Heroes-90760-1-0.rar?fid=1000270810&ttl=1535881042&ri=8192&rs=8192&setec=26731a1ab6a989aaee51f25902c64a39"
    },
    {
      "fileId": "1000271317",
      "name": "Chest of the Lost Heroes",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1131",
      "fileName": "Chest of the Lost Heroes-90760-2.rar",
      "uploadedUnix": "1524441439",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/b44756452cc75190955bd20416eda11efaf26f02ec2a4cd340090563903d9b24/analysis/1524441607/",
      "changelogHtml": " Adds Enchanted Set <br/> \n Adds a few hard foes to defeat <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chest%20of%20the%20Lost%20Heroes-90760-2.rar?fid=1000271317&ttl=1535881043&ri=8192&rs=8192&setec=0b4e7d52b9c6ba5c2aa3badb3258d774"
    }
  ]
}