{
  "modId": 90798.0,
  "modName": "Epic Elves race Teir'Dal Racemenu preset",
  "summary": "An Everquest 2 Teir'Dal preset for zzJay's Epic Elves race.",
  "descriptionHtml": "This represents the Dark Elf race as presented in Everquest 2, the Teir'Dal.  A  preset for Racemenu.\n<br />\n<br />UNP body.  Requires Racemenu by Expired, Epic Elves by zzJay.  Epic Elves has a CBBE option, but I've no clue if this preset will work ok with it.\n<br />\n<br />Not required but what I use, KS Hair, Women of Skyrim textures by zzJay.\n<br />\n<br />Eyes are in the Epic Elves mod, as are Women of Skyrim textures.  Every other feature (like Brows) is Vanilla.  \n<br />\n<br />In Everquest the Teir'Dal were created by Innoruuk, God of Hate, by corrupting High Elves  (Koada'Dal).   The  Queen of the Dark Elves on Norrath was Cristianos Thex.. formerly the firstborn Queen of the High Elf Dal, kidnapped by Innoruuk and twisted to serve hate.   A tiny bit similar to the Chimer daedra worship and their eventual transformation to Dunmer dark elves.\n<br />\n<br />Not  RASalvatore Drow, hair colors ranged from Black to White and white facial and body paint were not common.  They had magical aptitude, but were also notorious Assassins with an affinity for stealth and poisons.  As with the Dunmer, intense house rivalry, plotting, revenge and intrigue was part of everyday life.   They had nothing but contempt and hatred for what they deemed the \"lesser\" Elf races of Norrath. Teir'Dal were a short race, averaging 5' tall.\n<br />\n<br />(This more represents the SOGA char option in EQ2)  \n<br />\n<br />My second upload.  Apologies if I failed to credit properly, advice welcomed.",
  "categoryId": "26",
  "version": "1",
  "author": "TeofaTsavo",
  "createdUnix": "1523990556",
  "updatedUnix": "1523990556",
  "containsAdultContent": false,
  "uploadedBy": "TeofaTsavo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000270921",
      "name": "EpicElves Teir'Dal preset",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "EpicElves Teir'Dal preset-90798-1.7z",
      "uploadedUnix": "1523990495",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/fe571426d27a87739c3650b4903e61f7d5a67fece249871fe1e55fec6f04ca38/analysis/1523990583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EpicElves%20Teir%27Dal%20preset-90798-1.7z?fid=1000270921&ttl=1535881091&ri=8192&rs=8192&setec=68bc88293a6b2a848f4143ee196d2364"
    }
  ]
}