{
  "modId": 90921.0,
  "modName": "Children of Skyrim- Warriors in Training",
  "summary": "Makes children NPC now able to fight and use different ways to combat the enemy.",
  "descriptionHtml": "[center]In a world full of Dragons and Draughrs, where death happens constantly and Skyrim has more to fear. Where assassins are able to kill Emperors and thieves can leave you without a thing, a time where elders can fight with their bare hands against vampires and dogs have cunning minds to help fight against the enemies, but the children are left without a single protection and acting like children in the modern day.\n<br />Now, their parents or relatives have decided to help teach them, because who knows if someone will destroy the town one day. Places like Riverwood and Rorikstead are just there for the taking. \n<br />\n<br />No longer! The children have risen and become warriors in training. For this is\n<br />[size=4][b]Children of Skyrim- Warriors in Training.\n<br />\n<br />\n<br />[/b][size=3][size=4][b][u]Details:[/u][/b][/size]\n<br />\n<br />This mod now allows most children to fight with what is at their disposal. Some are still afraid to fight or couldn't learn to fight, such as Lucia and Sofie, among other street urchins. Those stuck at the Orphange Hall couldn't fight against an woman who tortured them if they used a knife wrong. Some urchins such as Alesan has learned how to fight and use his survivial skills. The children know Skyrim is not a safe place, so why wouldn't the parents train them? This isn't real life, most people never thought to pick up a sword or an crossbow.\n<br />Children are now placed on [b]Protected[/b] status, why the bold? Because I know some people don't like killable children, so it gives them the option not to use this mod. The reasoning behind this is because I didn't think it make sense if you accidentally attacked Sissel and couldn't aleast get her knocked down while she was attacking you with mage powers. You are the only one who can put the last hit. (This includes Babette, so if you are destroying the Dark Brotherhood, she is also killable.).\n<br />I feel like Bethesda may have plotted more with the children then we have, given the animations for magic and weapons run fine with these guys, (Possibly due to the cut quest for Balgruuf's children that would had them fighting each other). It seems they decided against it, but it is possible to make them fight.\n<br />\n<br />\n<br />Babette is now able to actually use vampire drain. Why she is a three hundred year old vampire and cowers like a 5 year old girl I don't know.\n<br />Some characters like Braith and Britte do not have weapons, but since they boast about hitting people, it was better for them to be brave and unarmed at the same time.\n<br />Kayd is now makes sense when he talks down to you, and is holding two swords.\n<br />Remember how Sissel talks to that one NPC about using magic? Now she can, and he has been teaching her well. \n<br />Lars is one child who remains the same, given he isn’t able to fight Braith off.\n<br />Skuli has a strong weapon due to the fact he helps runs an Inn in the middle of nowhere.\n<br />Ever wondered why Aeta barely had warm clothes on? Well, now she has fire spells that make it a little more sensible.\n<br />Some of the children, like Babette had their health and magicka raised up higher.\n<br />Some of the confidence on the children are different such as Average or Brave, the unaggressive/cowardly option is what prevented the children from doing anything.\n<br />Balgruuf’s kids have bigger weapons due to the cut quest they were meant to be involved in and actually fight, figure it might be cool to give them the weapons.\n<br />\n<br />This mod also adds a few extra kids who will roam Skyrim and fight. And it will also give some NPCS children as well. Nothing special about them, but they may carry special items for those who want to try and kill them and take the items. For now it's just a few. If someone wishes to expand on it and create different children NPCs with voice acting and quests, feel free to expand with my mod.\n<br />\n<br />Additional Kids-\n<br />Amber Firestone and Piper Kanniah, they will be travelling everywhere so you may only see a glimpse of them. What I like about getting NPCS travelling to different places is the chance you will meet them out on the road, makes Skyrim a little less lonely.\n<br />Children belonging to NPCS:\n<br />Astrid and Arnbjorn- Alexstraza (I made her use Babette's script after the end of DB, so she should go to Dawnstar.)\n<br />Drifa and Bersi (Of Riften)- Dristha\n<br />Hert and Hern of Half Moon- Hylia (Another vampire child)\n<br />Enmon and Mena of Karthwastern\n<br />Indara and Mathies of Falkreath.\n<br />\n<br />[u][b]Notes:[/b][/u]\n<br />Shields were unable to be used, I gave it to Assur but he never used it. Crossbows are likely able to be used, but I didn't include Dawnguard so I didn't test it.\n<br />Shouts cannot be used by a child, nothing happens.\n<br />Be wary what you fight now, since you will have children after you as well.\n<br />Dawnguard had no children so wasn't included. \n<br />If you have a mod that lets you take followers as children, then take the most of the two mods together. Even your adopted children (Depending who you adopted) will able to help defend against bandits in the homes.\n<br />\n<br />[b]Requirements.[/b]\n<br />Skyrim/Update\n<br />Hearthfires\n<br />Dragonborn (Because of Aeta.)\n<br />\n<br />[u][b]\n<br />Incompatible  Mods\n<br />[/b][/u]Immersive Skyrim Citizens- It will still work with this mod, however it will override the fear factor of the NPCS (So if you are too tough for the children, they will run away from you. Only affects the children NPCs that the ISC speaks of, Babette isn't affected and will still drain you of blood. Custom children NPCS that I created will work. ). I don't quite know how to use them both in harmony, but since ISC is supposed to do that, it would be likely that you wouldn't need this.\n<br />\n<br />\n<br />Any mod that heavily edits children runs the risk of conflicting. I have stranger danger, which is an killable children's mod, it appears to work correctly and will have the children die. \n<br />Any mods that adds custom children obivously won't be touched, however it is very easy to be fixed. (Go into the CK, change their AI to Brave and Aggressive). \n<br />\n<br />Immersive Children is compatible with this mod, it should be higher of course in the load order. \n<br />\n<br />[u][b]Installing:[/b][/u]\n<br />Manually- Download the file, go into the download and copy and paste the data file into Skyrim Data.\n<br />\n<br />[b]Credits:[/b]\n<br />Bethesda for making Skyrim and all of it's awesomeness. \n<br />Skyrim Nexus for allowing us to download all the mods to make the gaming experience even more fun.[/size][/size][/center]",
  "categoryId": "99",
  "version": "1",
  "author": "Umbren91",
  "createdUnix": "1524561483",
  "updatedUnix": "1524561483",
  "containsAdultContent": false,
  "uploadedBy": "Umbren91",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000271402",
      "name": "Children of Skyrim- Warriors",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50",
      "fileName": "Children of Skyrim- Warriors-90921-1.rar",
      "uploadedUnix": "1524561464",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8930700e5eaca0184e8388d95cbcb52512e08c0b44129f198bc26f3ac48c0ba8/analysis/1524561543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Children%20of%20Skyrim-%20Warriors-90921-1.rar?fid=1000271402&ttl=1535881269&ri=8192&rs=8192&setec=b08fdd58cfc0567ebb71901c01fa713a"
    }
  ]
}