{
  "modId": 91000.0,
  "modName": "Ace Blood Magic Deutsch v.1.3",
  "summary": "Ace Blood Magic Deutsch v.1.3",
  "descriptionHtml": "[b][color=#ea9999][size=6]Ace - [/size][/color][color=#ea9999][size=6]Die Blutmagie[/size][/color]\n<br />\n<br />\n<br />[color=#ffe599][size=5]Infos:[/size][/color][/b]\n<br />\n<br />Das ist die deutsche Version von \"[url=https://www.nexusmods.com/skyrim/mods/90834?tab=description]Ace Blood Magic[/url]\"\n<br />Wenn euch dieser Mod gefällt gebt bitte \"[url=https://www.nexusmods.com/skyrim/users/5050404]Elias555[/url]\" ein Endorse :)\n<br />\n<br />Alle Bilder Stammen vom originalen Modauthor\n<br />[size=3] \n<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/90834/90834-1524301975-1881353983.jpeg[/img]\n<br />[/size]\n<br />[size=4]Wie bei all meinen Mods wollte ich neue Klassen- oder Spielweise hinzufügen und Blutmagie stand als nächstes auf meiner Liste. Ich habe einen anderen Ansatz zu einigen der anderen Mods gewählt. Ich wollte, dass meine Blutmagier Vampire sind. Bei Vampiren stellt die Blutquelle die größte Kraftquelle dar und sorgt natürlich für Feinde. Im Laufe der Jahre haben Blutmagier neue Methoden gefunden, sich um ihre Feinde zu kümmern, und dieser Mod stellt diese Zauber bereit.\n<br />[/size]\n<br />[size=4]Einige Blutmagie-Zauber haben zusätzliche Auswirkungen auf Vampire. Andere Zauber sind direkt mit Vampiren verbunden, die während des Zauberspruchs getötet werden. Es gibt einige versteckte Kombinationen, die größere oder spezielle Effekte erzielen, versuchen sie zu entdecken. Die Kombinationen haben unterschiedliche visuelle Effekte, so dass Sie sie nicht auslösen können. Vergünstigungen und Verzauberungen, die Zauber billiger machen, senken auch die Kosten von Blutmagie. Sie stapeln sich mit anderen Buffs von diesem Mod. Das beinhaltet modifizierte Zaubersprüche und Verzauberungen. Ich habe versucht, so viele benutzerdefinierte Texturen möglich zu verwenden, von Projektilen bis zu Symbolen für Inventar-Symbole.[/size]\n<br />[size=4]Um die Sprüche zu wirken, musst du das Magicka-Äquivalent der Kosten haben. Sie werden nicht in der Lage sein, Ihren Magicka-Pool zu beenden und dann Ihren Pool zu leeren, so habe ich das nicht gestaltet. Es gibt eine steile Lernkurve am Anfang, aber sobald Sie einige Vergünstigungen und Verzauberungen bekommen, werden Sie eine lustige Zeit haben. \n<br />\n<br />[color=#f4cccc]Sie benötigen SKSE, DB und DG.[/color][/size]\n<br />\n<br />[color=#ffe599][size=5]Aneignung:[/size][/color]\n<br />\n<br />[size=4]Zauber können wie jeder normale Zauberspruch von Händlern gekauft werden. Zaubersprüche werden in Level-Listen eingefügt, du musst 48 Stunden warten, bis die Zaubersprüche von den Händlern aktualisiert werden.[/size][size=4] Wenn du sie effizient zaubern willst, musst du zuerst den Zauberspruch \"Blutmagier Wissen\" finden.. Damit können Sie die Zauber für die Hälfte der normalen Kosten wirken, wenn die Gesundheit unter 50% liegt. Bedeutung, eine [/size]Gesundheit[size=4] unter 50%  ist vorteilhaft. Gegner mit niedrigen Level werden ohne die entsprechenden Vorteile kämpfen. Vampire können Blutmagie nicht effizient wirken, sie werden beim zaubern immer ein wenig Gesundheit ausführen verlieren.   [/size]\n<br />\n<br />[size=5][color=#ffe599]Video:[/color]\n<br />[/size][size=5]\n<br />[youtube]g8rhJUSM2Y8[/youtube][youtube]e1mMX3sWsmQ[/youtube]\n<br />\n<br />[color=#ffe599]Zaubersprüche:[/color][/size]\n<br />\n<br />[size=4]Es gibt 30 Zauber, hier ist eine Beschreibung von einigen von ihnen und mit einigen zusätzlichen Informationen.[/size]\n<br />\n<br />[size=4]Blutmagier Wissen: Das Wirken von Blutzaubern ist effizienter. Wenn die Gesundheit des Zaubernden unter 50% liegt, kosten Blutzauber 50% weniger. Untote können Blutzauber nicht effizient wirken. Du musst das haben, wenn du dich primär auf Blutmagie spielen willst. Überprüfen Sie die Bilder für den Fundort.[/size]\n<br />\n<br />[size=4]Absorbieren: Ein Ball aus Blut, der einen Gegner X für Y Sekunden lang Schaden zufügt und einen Blutstropfen zum Zaubernden hin erzeugt. Eine Methode auf niedrigem Niveau, bei der man wieder Gesundheit bekommt und dabei Schaden verursacht. Er wurde so entwickelt, um nicht dauerhaft bereit zu sein, sonst könnten Sie ausstehen und ständig Ihre Gesundheit zurück bekommen, während Sie nichts ausgeben. Stehen Sie beim Schießen in einiger Entfernung.[/size]\n<br />\n<br />[size=4]Altes Blut: Kombiniere die Atronach-Essenz mit dem Zaubererblut, um eine Schadensreduktion gegen das selbe Element zu erhalten. Etwas Neues mit deinem Feuer, deinem Frost und deinen Leersalzen.[/size]\n<br />\n<br />[size=4]Bluten: Jeder Macht-Angriff auf das Ziel unter diesem Effekt verursacht 25 Sekunden lang zusätzlichen Blutungsschaden am Ziel. Vampire werden auch Magicka-Schaden nehmen. Ideal für Blutritter, die Magie einsetzen und dann Macht-Attacken nutzen wollen.[/size]\n<br />\n<br />[size=4]Verfluchter Tod: Wenn das Ziel innerhalb von X Sekunden stirbt, wird eine Blutkugel erstellt. Blutkugeln werden in einem späten Spiel verwendet, es ist ein guter Anfang, diese früh zu sammeln. Ich habe sie momentannicht in ein frühes Spiel eingefügt, ich hoffe sie werden das berücksichtigen.[/size]\n<br />\n<br />[size=4]Kranker Nebel: Während du krank bist, erzeuge einen Ball aus krankem Blut, der nach 5 Sekunden detoniert und diejenigen im Nebel schädigt. Sei sicher, dass du vom Ball weg läufst oder du wirst auch getroffen werden.[/size]\n<br />\n<br />[size=4]Lebenskugel: Benutze Blutkugeln, um Lebenskugeln um den Zaubernden herum zu erschaffen. Jede Kugel stellt die Gesundheit wieder her, wenn der Zaubernde in Gefahr ist. Es werden maximal 3 Orbs auf einmal um den Spieler gelegt. Jedes Mal, wenn der Spieler unter 20% fällt, wird der Zauberwirker im Austausch gegen eine Lebenskugel geheilt.[/size]\n<br />\n<br />[size=4]Blutpfütze: Ein Blutpool, der den Zauberwirker heilt, basierend auf der Anzahl der Vampire, die vom Pool absorbiert wurden. Das Töten eines Vampirs, der sich innerhalb der Reichweite des Pools befindet, erhöht die Menge, um die der Zaubernde geheilt wird. Es wird im Spiel Sinn machen, wirf den Spruch einfach neben Vampire und töte sie dann, bevor der Zauber endet.[/size]\n<br />\n<br />[size=4]Aufgewachsenes Blut: Formiere 5 defensive Kugeln vor dem Zaubernden. Großartig, um sicherzustellen, dass Feinde aufgehalten werden, bevor sie zu dir kommen.[/size]\n<br />\n<br />[size=4]Vitalisiere Blut: Ordne das Blut in einem Ziel neu an, was zu einer erhöhten Waffen- und Bewegungsgeschwindigkeit X Sekunden führt. Sehr nützlich, um einen schwachen Begleiter stärker zu machen. Vielleicht möchten Sie ja, dass ein rasender Feind ein paar ihrer Freunde leichter herausnimmt.[/size]\n<br />\n<br />[size=5][color=#ffe599]Andere:[/color]\n<br />[/size]\n<br />[size=4]Benötigt Dawnguard, Dragonborn, und SKSE.   [/size]\n<br />[size=4]Funktioniert mit allen Mods. Sicher zu jeder Zeit zu installieren.[/size]\n<br />[size=4]Vampire können die Zauber verwenden, aber jeder Zauberspruch kostet zusätzlich zu den Zauberkosten 50 zusätzliche Lebenspunkte.[/size]\n<br />[size=4]Gesundheit trifft zweimal auf Untote und ineffiziente Zauberwirker. Dies ist beabsichtigt.[/size]\n<br />[size=4]Konzentrationszauber kosten auch Magie. Sie sind die günstigsten Gesundheitskosten für das, was sie tun, nur sicher sein, ein Ziel zu haben.[/size]\n<br />[size=4]Der Anti-Vampir-Patch entfernt nur den zweiten Treffer aus Zaubern, der Mod hat immer noch Anti-Vampir-Zauber.[/size]\n<br />[size=4]Ich bin auf der Suche nach Verbesserungen, also sag mir was du willst.[/size]\n<br />[size=4]Ich hatte die Absicht, die Zaubersprüche viel interessanter zu machen, aber ich habe zu viel Zeit mit diesem Mod verbracht, da meine Festplatte gestorben (kaputt) ist und ich von vorne anfangen musste.[/size]\n<br />[size=4]Wenn Sie einen Patch oder etwas anderes machen möchten, kontaktieren Sie mich bitte zuerst.[/size]\n<br />[size=4]Schau dir [url=https://www.nexusmods.com/skyrim/users/5050404?tab=user+files]meine anderen Mods[/url] an, die erstellt wurden, um Builds und Spielstile zu verbessern[/size]\n<br />\n<br />[b][color=#ffe599][size=5]Installation:[/size][/color][/b]\n<br />\n<br />Für diese Mod wird die originale Datei Benötigt und muss überschrieben werden.\n<br />\n<br />[b][u][size=6][url=https://www.nexusmods.com/skyrim/mods/91097/]Andere Übersetzungen von mir[/url]﻿[/size]\n<br />[/u][/b]\n<br />[b]-&lt;(Start der Übersetzung´s Serie 25.04.2018)&gt;-[/b]",
  "categoryId": "24",
  "version": "1.3",
  "author": "Teraneck",
  "createdUnix": "1524870622",
  "updatedUnix": "1526211772",
  "containsAdultContent": false,
  "uploadedBy": "Teraneck",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000271669",
      "name": "Ace Blood Magic Deutsch v.1",
      "version": "v.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "Ace Blood Magic Deutsch v.1-91000-v-1.rar",
      "uploadedUnix": "1524870590",
      "modVersion": "v.1",
      "virusScanUrl": "https://www.virustotal.com/file/7258df0dc9ff81afd6656fac87557388e584d7d4a42ed20354a29383508c1f2e/analysis/1524870676/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ace%20Blood%20Magic%20Deutsch%20v.1-91000-v-1.rar?fid=1000271669&ttl=1535881379&ri=8192&rs=8192&setec=aa5b620ca52eacdf8449ac3967a98f41"
    },
    {
      "fileId": "1000271935",
      "name": "Ace Blood Magic Deutsch 1.1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "35",
      "fileName": "Ace Blood Magic Deutsch 1.1-91000-1-1.rar",
      "uploadedUnix": "1525136466",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0e85a775f698b2d509cde3844628f34d2a43cd5bffb228b92910d9055dfafdcb/analysis/1525136544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ace%20Blood%20Magic%20Deutsch%201.1-91000-1-1.rar?fid=1000271935&ttl=1535881380&ri=8192&rs=8192&setec=aad8e457639702ddb1e4cb7aed439b9b"
    },
    {
      "fileId": "1000272894",
      "name": "Ace Blood Magic Deutsch 1.3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "Ace Blood Magic Deutsch 1.3-91000-1-3.rar",
      "uploadedUnix": "1526211772",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/dcd30eaef1098e40f3cd8be154cc2f468c60e7148f275ba4cecc52906a794acb/analysis/1526211864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ace%20Blood%20Magic%20Deutsch%201.3-91000-1-3.rar?fid=1000272894&ttl=1535881380&ri=8192&rs=8192&setec=200f7c521f2d9b9c8fb4b01a0b7def62"
    }
  ]
}