{
  "modId": 91086.0,
  "modName": "Skyrim Supplemental Patch - Castellano - DELETED",
  "summary": "Traducción de la versión 1.0",
  "descriptionHtml": "Necestas descargar e instalar el MOD ORIGINAL:  Skyrim Supplemental Patch by brytag.\n<br />                                                                                       Después instala esta traducción.\n<br />\n<br />                                                                             Descripción del mod hecha por su AUTOR: brytag.\n<br />\n<br />Un parche integral de corrección de errores que se centra casi por completo en la ubicación del object&#92;item (objeto/elemento) que corrige miles de errores relacionados con objetos extraviados. Este parche ha tardado años en compilarse, y con el final de USLEEP para Legendary Edition ahora aquí, pensé que sería un buen momento para ofrecer a la comunidad este parche auxiliar de Skyrim. Este parche está destinado a utilizarse junto con el parche USLEEP, aunque no requiere USLEEP.Se puede considerar que este parche tiene un énfasis casi completo en la colocación de elementos y objetos, aunque hay otros errores que se corrigen más allá de la colocación de objetos, sin embargo, la colocación de objetos es el enfoque principal de este parche. El parche de USLEEP hace un trabajo increíble en la fijación de elementos extraviados, objetos y varios otros errores, pero a pesar de su alcance masivo todavía hay innumerables errores que aún necesitan ser reparados. De ahí que se haya creado este parche, y cada corrección en este parche es una solución que USLEEP no ha resuelto, por lo que es perfecto para estar de su lado.\n<br />\n<br />                                                                                                           COMPATIBILIDAD\n<br />\n<br />Como el  Skyrim Supplemental Patch en su mayor parte solo toca los registros de vainilla, debería ser compatible con cualquier otro mod. Todavía no estoy al tanto de ningún mod que pueda entrar en conflicto. Por lo tanto, debería ser seguro usar este parche junto con cualquier otra configuración de mod.\n<br />\n<br />                                                                                                          ORDEN DE CARGA\n<br />\n<br />                     Si no sabe a dónde va esto en tu orden de carga, te sugiero que lo coloques lo más alto posible en tu orden de carga.\n<br />\n<br />Si te gustó el mod, no olvides dar ENDORSE en la página de descarga del AUTOR: brytag.",
  "categoryId": "84",
  "version": "1.0",
  "author": "joe1984ace",
  "createdUnix": "1525208305",
  "updatedUnix": "1525208305",
  "containsAdultContent": false,
  "uploadedBy": "joe1984ace",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000272027",
      "name": "Skyrim Supplemental Patch - Castellano",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "284",
      "fileName": "Skyrim Supplemental Patch - Castellano-91086-1-0.7z",
      "uploadedUnix": "1525207966",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9b22392f36c372494fbf150416e49467d92593f26c7ebd12ce36000fbed36626/analysis/1525208044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Supplemental%20Patch%20-%20Castellano-91086-1-0.7z?fid=1000272027&ttl=1535881495&ri=8192&rs=8192&setec=714a1b77b192d3900933dc57c6939f43"
    }
  ]
}