{
  "modId": 91103.0,
  "modName": "Lyari - A Standalone Follower",
  "summary": "This mod adds a new standalone wood elf follower to the game.",
  "descriptionHtml": "[center]﻿[/center][center][font=Arial][color=#93c47d][size=5]Lyari﻿[/size][/color][/font][/center]\n<br />[center]Lyari is a wood elf follower. You can found her in Falkreath at the Dead Man's Drink. You can marry her. She is an archer but she can handle a one-handed sword too. She prefers light armor and stealth. [/center][center]\n<br />[color=#93c47d][size=5]Backstory[/size][/color][/center]\n<br />[i]Lyari and his father moved in Skyrim five years ago. Her mother died in Valenwood. After the mothers death they decided to move in skyrim becouse it's safer. Said the fater. The girl agreed. They traveled and traveled. After they arrived in skyrim the first city was Falkreath they found themselves in. It was a good place to settle because of the forest and the woods. It was like at home just smaller. They went to the jarl to ask him if there is  a home they can purchase. Te jarl said that there is no home for sale. Thay said thank you and left. After that they went to the inn where you can found the most information on the way to the inn the father said that if they don't find a home they are gonna build it themselves. They entered the inn there was a few people but not to much like five or six. The father asked the innkeeper that maybe he knows something about houses. But unfortunatly no. Some men overheatd the talk. \n<br />  -Are you two searching a place to settle? \n<br />  -The father said yes.\n<br />  -We have a house for sale. \n<br />The father went closer. \n<br />The girls stayed at the fireplace. It was a rainy day. So she needed to dry a little. After a while the father came back to his daugther and said that a man is selling his house and he marked the place on the map. \n<br />They asked the innkeeper for a room. \n<br />In the morning they  set off to the place. They walked and walked and when they stopped for a break the father teached the girl how to shoot with the bow. The girl was pretty good. It went like this until they finally get to the marking on the map. But they saw nothing. The girl didn't knew what's going on. But the father knew. They set them up. After a minute they heard noises from the bushes and branches. It was and ambush. The dad draw his bow and started shooting. But the bandits were overpowered. There was like five of them against a dad and a girl. The dad threw a dagger to the girl and said to run. Look for the road where we came! Just run. The girl started running. She was scared and she cried. The girl didn't look back. But it was horrible for her to hear his father shouting. After a while running the girl found the road. She sat and waited. The girl started losing hope. She didn't know what to do. But then somebody showed up. It was Elrindir from the drunken huntsman. He brought the girl to his shop. After five years the girl was trained enough to venture out. She wanted revenge. Then she met the Dragonborn..[/i] \n<br />[center][color=#93c47d][size=5]Credits:[/size][/color][/center][center][url=http://www.nexusmods.com/skyrim/mods/6709/]Dimonized UNP Female Body by: dimon99[/url]﻿[/center][center][url=http://www.nexusmods.com/skyrim/mods/24273]Ethereal Elven Overhaul by: nuska[/url]﻿[/center][center][url=http://www.nexusmods.com/skyrim/mods/13722]The Eyes of Beauty by: LogRaam[/url]﻿[/center][center][url=http://www.nexusmods.com/skyrim/mods/68311/]KS Hairdos Renewal by: Kalilies and Stealthic[/url]﻿[/center][center][url=http://www.nexusmods.com/skyrim/mods/58989/]CITRUS Heads by: blabba[/url]﻿[/center][center][url=http://www.nexusmods.com/skyrim/mods/29624/]RaceMenu by: expired6978[/url]﻿[/center][center][url=http://www.nexusmods.com/skyrim/mods/35327]SG Female Eyebrows by: hellosanta[/url]﻿[/center][center][url=http://www.nexusmods.com/skyrim/mods/27783]HN66S LOng Eyelshes by: humannature66[/url]﻿[/center][center]﻿[/center][center][color=#93c47d][size=5]Special Thanks:[/size][/color][/center][center][url=http://www.darkfox127.co.uk]\n<br /> Darkfox127[/url]﻿ and [url=https://www.nexusmods.com/skyrim/users/7106389]SkylaSkyrim[/url]﻿ for the amazing tutorials![/center]",
  "categoryId": "96",
  "version": "1.0",
  "author": "Mandarics",
  "createdUnix": "1525280910",
  "updatedUnix": "1525280910",
  "containsAdultContent": false,
  "uploadedBy": "Mandarics",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000272091",
      "name": "LyariFollower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24196",
      "fileName": "LyariFollower-91103-1-0.rar",
      "uploadedUnix": "1525280511",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/23635911789edfc2f818777c7ae6d2e97ee015428c1114e962e991ed27354c00/analysis/1525280664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LyariFollower-91103-1-0.rar?fid=1000272091&ttl=1535881523&ri=8192&rs=8192&setec=787770985a99b3a70181902c1418fa27"
    }
  ]
}