{
  "modId": 91143.0,
  "modName": "Oblivion Artifact Pack Deutsch V6.1",
  "summary": "Oblivion Artifact Pack Deutsch V6.1",
  "descriptionHtml": "[b]Infos:[/b]\n<br />\n<br />Das ist die deutsche Version von \"[url=https://www.nexusmods.com/skyrim/mods/24806]Oblivion Artifact Pack V6[/url]\"\n<br />Wenn euch dieser Mod gefällt gebt bitte \"[url=https://www.nexusmods.com/skyrim/users/1305085]Watcherzero[/url]\" ein Endorse :)\n<br />\n<br />[b]Zum Mod:[/b]\n<br />\n<br />Diese Mod fügt viele Artefakte von Oblivion ein, die in Himmelsrand verteilt wurden.\n<br />\n<br />[b]Wichtig:[/b]\n<br />\n<br />Bei der Übersetzung kann es sein das viele Gegenstände nicht ihre original Namen haben,\n<br />das liegt daran das ich Oblivion kaum gespielt habe.\n<br />Das übersetzen der Bücher hat sich als schwieriger herausgestellt als ich anfangs gedacht habe\n<br />ich musste viele Bücher umschreiben (mit Vorlage diverser Oblivion Foren), die Texte sind nun \n<br />verständlich aber nicht 100% Grammatikalisch richtig.\n<br />\n<br />Die Liste mit den Fundorten aller Gegenstände habe ich nicht übersetzt da ich keine Fehler bei \n<br />der Übersetzung machen wollte und ihr dann an den Falschen Orten sucht. ich werde die Liste \n<br />nach und nach übersetzen wenn ich selber Testen kann oder mir Member schreiben.\n<br />\n<br />[b]Hier die Liste:[/b]\n<br />\n<br />Escutcheon of Chorrol - Peak's Shade Tower, Southeast Falkreath.\n<br />Redwave - Redwave Ship, Solitude Port.\n<br />Witsplinter - Alva's House, Morthal.\n<br />Frostwyrm - Ivarstead Mill, Added a small new Storage cell owned by Temba Wide-Arm.\n<br />Amelion Set - Lost Echo Cave.\n<br />Eye of Sithis - Dawnstar Sanctuary, before torture room.. or before finding Cicero.\n<br />Ring of the Gray - Riften Jail Sewers, Its a 'coin purse' on the ground.\n<br />Blackwood Ring of Silence - Argonian Assemblage, a 'coin purse' on a shelf.\n<br />Jewel of Rumare - Crabber's Shanty on a shelf.\n<br />Circlet of Omnipotence - Mara's Eye Pond on an end table.\n<br />Helm of Ferocity - Dushnik Yal Longhouse on a shelf.\n<br />Ring of Transmutation - Silent Moons Camp its a 'coin purse' on a chest next to the ladder at the end.\n<br />Antique Cutlass - Helgen Keep on a shelf.\n<br />Draconian Madstone - Riverwood Sleeping Giant Inn in the hidden room on a shelf.\n<br />Tower of The Nine - Solitude Temple basement area before Potema's Catacombs\n<br />Ring of Wortcraft - Whiterun Arcadia's Cauldron a 'coin purse' on a shelf.\n<br />Hands of the Atronach - Winterhold College Midden on the Atronach Forge.\n<br />Akaviri Sunderblade - Ancestor Glade Next to a rock near one of the higher up trees.\n<br />Aegis of the Apocalypse - Bloated Man's Grotto next to the Oathblade.\n<br />Hands of Midnight - Hag's End next to the Assassin of old.\n<br />Birthright of Astalon - Northwatch Keep on a shelf.\n<br />Calliben's Grim Retort - Thalmor Embassy on a bookshelf in a bedroom.\n<br />Sinweaver - Thalmor Headquarters upstairs on a wall.\n<br />Battleaxe of Hatred - Embershard Mine on a shelf.\n<br />Captain Kordan's Saber - Dainty Sload at the end on a table.\n<br />Dagger of Discipline - Falkreath Sanctuary on a shelf.\n<br />Rasheda's Special - Riften Blacksmith's House over the fireplace.\n<br />Ring of Eidolon's Edge - Mehrunes Dagon's Shrine on a plate with some salts.\n<br />Cowl of the Druid - Boulderfall Cave on a shelf.\n<br />Veil of the Seer - Cragwallow Slope on an end table\n<br />Robe of Creativity - Darklight Tower at the end on a table with a troll skull.\n<br />Dondoran's Juggernaut - Raldbthar in the main room where the bandit boss is.\n<br />Apron of the Master Artisan - Whiterun House Gray-Mane main bedroom.\n<br />Boots of the Swift Merchant - Bard College main bedroom\n<br />Quicksilver Boots - Thieves Guild Headquarters in Riften.\n<br />Black Band - Dawnstar Sanctuary on the table when you first enter it is a 'coin purse'\n<br />Honorblade of Chorrol - A small cave near Falkreath and Peak's Shade Tower, Be ready for a fight, and a good rock climb.\n<br />The Deciever's Finery - Solitude's Raidiant Raiment.\n<br />Rockshatter - Orotheim on a chest.\n<br />Sufferthorn - Redwater Den near the well.\n<br />Hatreds Heart - On a secluded Island near The Chill in Winterhold. Be ready for a fight.\n<br />Hatreds Soul and Soul arrows - On a secluded Island near The Chill in Winterhold. Be ready for a fight.\n<br />Ring of the Vipereye - Harmugstahl on a table next to the Alchemy lab.\n<br />Shadowhunt - In a small glacial cave near The Chill in Winterhold. Be ready for a fight.\n<br />Sorcerer's Ring - Hob's Fall Cave on the enchantment station.\n<br />Ring of Desiccation - Bleakcoast Cave.\n<br />Circlet of Verdure - Snapleg Cave.\n<br />Ring of the Oceanborn - Northshore Landing Solstheim\n<br />\n<br />[b]Installation:[/b]\n<br />\n<br />Für diese Mod wird die originale Datei Benötigt und muss überschrieben werden.\n<br />\n<br />[b]Nicht Kompatibel:\n<br />\n<br />[/b]In einer älteren Version war die Mod nicht kompatibel mit [url=https://www.nexusmods.com/skyrim/mods/25872/?%27]Der Schatten von Meresis[/url]\n<br />aber ich weiß nicht ob das geändert wurde\n<br />\n<br />[b][u][size=6][url=https://www.nexusmods.com/skyrim/mods/91097/]Andere Übersetzungen von mir[/url]﻿[/size]\n<br />[/u][/b]\n<br />[b]-&lt;(Start der Übersetzung´s Serie 25.04.2018)&gt;-[/b]",
  "categoryId": "36",
  "version": "6.1",
  "author": "Teraneck",
  "createdUnix": "1525451295",
  "updatedUnix": "1525451295",
  "containsAdultContent": false,
  "uploadedBy": "Teraneck",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000272220",
      "name": "Oblivion Artifact Pack Deutsch V6.1",
      "version": "6.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "125",
      "fileName": "Oblivion Artifact Pack Deutsch V6.1-91143-6-1.rar",
      "uploadedUnix": "1525451248",
      "modVersion": "6.1",
      "virusScanUrl": "https://www.virustotal.com/file/577affb9ca8e9831fdf8f399afedaf7e29982e03b8722ec05cedcc8cfdc86318/analysis/1525451292/",
      "changelogHtml": " new 6.1 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Oblivion%20Artifact%20Pack%20Deutsch%20V6.1-91143-6-1.rar?fid=1000272220&ttl=1535881599&ri=8192&rs=8192&setec=8607b755663acac64789d9243d46fe32"
    }
  ]
}