{
  "modId": 91170.0,
  "modName": "The Crafter's Crown",
  "summary": "Adds a circlet that provides maximised legit bonuses for all the crafting skills, so you don't have to keep swapping out 12 pieces of gear.",
  "descriptionHtml": "The Crafter's Crown - FAQ\n<br />\n<br />\n<br />Q: How is this \"Cheats and God Items\" AND \"Fair and Balanced\" ?!\n<br />\n<br />A: Because it's not really a cheat item at all, except for the huge Carry Weight bonus. The crafting bonuses are absolutely legit.\n<br />\n<br />\n<br />Q: +144% Alchemy and Smithing?! WTF?!\n<br />\n<br />A: That's what a full set of crafting gear genuinely gives you if you max out all the crafting skills. Really. 4 items at 36% each.\n<br />If your gear isn't that strong, you've missed a trick somewhere.\n<br />(If your gear's better than that and you HAVEN'T just used the Fortify Restoration exploit, let me know how you did it).\n<br />\n<br />\n<br />Q: +40% Enchanting?!\n<br />\n<br />A: Again, that's the bonus of a maximised potion in an unmodded game.\n<br />\n<br />\n<br />Q: So how do I use it?\n<br />\n<br />A: DON'T use potions when Enchanting.\n<br />The Enchanting bonus is there because potions continue to count down while you're using the Enchanter. If you're a slow typist or you do the steps in the wrong order or you change your mind halfway through, the potion expires and you have to start over. It's just petty and vindictive.\n<br />\n<br />A: DON'T use any additional +Smithing or +Alchemy gear when wearing it.\n<br />(unless you WANT to cheat, which is your choice)\n<br />\n<br />A: DO use potions when Smithing.\n<br />The main point of the mod was to avoid having to carry 12 pieces of gear around just for crafting. Since Smithing doesn't have the time issues caused by renaming items, the Crown just acts as the exact equivalent of a \"Crafting Gear Set\".\n<br />(Also, if I added in the bonus from a maxed potion the numbers would look even more ridiculous).\n<br />\n<br />\n<br />Q: +40% Enchanting is still too high, even if it's legit...\n<br />\n<br />A: I think so too, so the Crown only gives you +25% by itself.\n<br />To get the full +40% bonus, equip the Notched Pickaxe as well.\n<br />(Note: this mod does NOT modify the Pickaxe at all: it just uses it to adjust the Crown's bonus).\n<br />\n<br />\n<br />Q: How do I get the Crown?\n<br />\n<br />A: Console only. \"help crafter\" and go from there.\n<br />There isn't anywhere in the world I could put it that doesn't risk conflicting with another mod, and using a quest to give it to the player when they reach 100 in Enchanting or anything like that turns uninstalling it into a chore.\n<br />\n<br />\n<br />Q: Speaking of, how do I uninstall it?\n<br />\n<br />A: Just make sure you're not wearing the Crown, that's all.\n<br />\n<br />\n<br />Q: What else?\n<br />\n<br />A: This is the tweaked version that I personally use, which does a few extra things:\n<br />\n<br />The \"Fortify &lt;School&gt; and Magicka Regen\" enchantments have been fixed. They are CLEARLY intended to be \"Fortify +25% and Magicka Regen \n<br />+50%\" at max Enchanting, per the non-College NPC items, so now they are.\n<br />\n<br />The \"Resist Disease\" and \"Resist Poison\"  enchantments have been fixed. The values for those were hopelessly wrong, given that the \"Resist 100%\" items existed. They now peak at 80%, which is enough to have value, and can be pushed to 100% with the Crown at 25%.\n<br />Note that 100% is not \"Immunity\" despite the names of the stock items (see the UESP for details) but it does at least mitigate the Falmer Poison bugs a lot.\n<br />\n<br />Corpus Enchanter has been nudged down from 25% to 20%. This makes the stat bonuses peak at 60 points, or 75 points with the Crown.\n<br />\n<br />The Black Star has been renamed to \"Azura's Star (Black)\".\n<br />If you choose the Black path for the quest, this makes it sort to the top of the list. Without the rename, trying to use it for enchanting or recharging requires you to scroll down 30 or 40 times to get to it. Gets old REAL fast.",
  "categoryId": "40",
  "version": "1.1",
  "author": "tesnexus8",
  "createdUnix": "1525599262",
  "updatedUnix": "1525599262",
  "containsAdultContent": false,
  "uploadedBy": "tesnexus8",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000272383",
      "name": "The Crafter's Crown",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "The Crafter's Crown-91170-1-1.7z",
      "uploadedUnix": "1525599110",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/53c1d7cda9c36effdda15d23f0875678e07b0777e4154d957f41208ad4f363ce/analysis/1525599182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Crafter%27s%20Crown-91170-1-1.7z?fid=1000272383&ttl=1535881646&ri=8192&rs=8192&setec=f0e02cc943d60dffedd80388cc73452f"
    }
  ]
}