{
  "modId": 91181.0,
  "modName": "Oblivion Lightning",
  "summary": "Adds a new, end-game Master-tier Destruction spell to the game, which can be found on the corpse of a named Dremora miniboss that one can summon with the Atronach Forge.<br />The spell is a buffed up, purple Chain Lightning bolt that is equally devastating to friends and foes, and cannot be resisted, mitigated or absorbed.",
  "descriptionHtml": "This mod adds a new, Master-tier destruction spell to the game, designed to be the epitome of Shock Magic, brought to you straight from the depths of Oblivion.\n<br />You can get this spell by venturing down to The Midden of the College of Winterhold. There, on a table, you will find an old note with a cryptic recipe for the Atronach Forge. Gather the ingredients, use the Atronach Forge, defeat any obstacles in your way and the spell will be yours. \n<br />\n<br />The spell is, essentially, a purple-coloured blast of Chain Lightning that cannot be mitigated, absorbed or resisted (even by Storm Atronachs!), and does considerable damage. With high damage, however, comes a high mana cost, so unless you have mastered Destruction (and possibly have a few cost-reducing enchantments on your gear), it won't be a viable option. Keep in mind, due to functioning like Chain Lightning, the spell is rather volatile and hits friends and foes alike. \n<br />\n<br />[size=3][b]Features:\n<br />[/b][/size]- A new Master-tier spell, a new miniboss to fight, and a new Atronach Forge recipe.\n<br />- The spell, Oblivion Lightning, does 100 base damage, which is roughly x2.5 of the standard Chain Lightning spell and x1.7 of the Thunderbolt spell. Additionally, the spell will scale to 150 damage with Augemented Shock perks and even further if you have any Destruction Scaling Mods installed. Finally, the spell cannot be resisted, mitigated or absorbed in any way.\n<br />- The miniboss is a named, level 50 Dremora with high health and magicka, roughly twice as challenging to kill as a standard high-level Dremora.\n<br />\n<br />[b][size=3]Installation:[/size][/b]\n<br />Just place the .esp and .bsa files into your &#92;Skyrim&#92;Data folder and activate it through the Skyrim launcher or your preferred mod manager.\n<br />\n<br />[b][size=3]Detailed acquisition guide:[/size]\n<br />[/b]1. Gain access to the College of Winterhold and The Midden.\n<br />2. Find the old note on the table in the room with the Atronach Forge.\n<br />3. Collect a ruined book, a human heart, a [i]filled[/i] black soul gem and the Sigil Stone.\n<br />3b. You gain the Sigil Stone by doing the Conjuration Ritual Spell quest. To start it, speak with Phinis Gestor upon reaching Conjuration level 90.\n<br />4. Place the Sigil Stone into the pedestal, put the necessary ingredients in the offering box, and pull the activator.\n<br />5. Defeat the summoned Dremora.\n<br />6. Congratulations! Loot the Spell Tome off of the corpse.\n<br />\n<br />[b][size=3]Compatibility:[/size]\n<br />[/b]This mod will conflict with any mods that add Atronach Forge recipes, due to the way Bethesda made the script. If you have any mods that add Atronach Forge recipes, but you would still like to have this spell, make sure your recipe mods are [i]below[/i] this mod in the loading order (so that the recipes will work), then simply add the spell tome through console commands. To find the item ID of the spell tome, type \"help oblivion\", then use \"player.additem itemID 1\".\n<br />\n<br />[size=3][b]Other mods my me:[/b][/size]\n<br />[url=https://www.nexusmods.com/skyrim/mods/69235]Simple Destruction Magic Scaling[/url]﻿\n<br />[url=https://www.nexusmods.com/skyrim/mods/76081/?]Better Disarm Shout[/url]",
  "categoryId": "75",
  "version": "1.0",
  "author": "Comrey",
  "createdUnix": "1525620548",
  "updatedUnix": "1525620548",
  "containsAdultContent": false,
  "uploadedBy": "Comrey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000272411",
      "name": "OblivionLightning",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45",
      "fileName": "OblivionLightning-91181-1-0.rar",
      "uploadedUnix": "1525620249",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f235244fa40c5137424e6875bca28443cc40aab63a4790e377d13269fe536d27/analysis/1525620363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OblivionLightning-91181-1-0.rar?fid=1000272411&ttl=1535881661&ri=8192&rs=8192&setec=d1872c33127cc0bee377bc9d891fc7d2"
    }
  ]
}