{
  "modId": 91238.0,
  "modName": "Lake Haven - Deutsch (German)",
  "summary": "This is the German Version of Lake Haven, a player home mod by Cynndal.<br /><br />Dies ist die deutsche Fassung des Haus-Mods Lake haven von Cynndal.",
  "descriptionHtml": "Dies ist die deutsche Fassung des Haus-Mods [url=https://www.nexusmods.com/skyrim/mods/79756]Lake Haven[/url]﻿ von Cynndal. Ich habe nur die Übersetzung angefertigt, die [u]Originaldatei wird daher benötigt[/u]. Screenshots findet ihr ebenfalls auf der Seite des Originalmods.\n<br /> \n<br />[b]Installation:[/b]\n<br />1. Installiert zuerst Lake Haven in der Originalfassung. \n<br />2. Installiert dann die deutsche Fassung und ersetzt die .esp Datei.\n<br /> \n<br />Lake Haven (dt. Cottage am Seeufer) ist ein Lore-freundliches, Multiple-Adoptionen-Kompatibles Spielerhaus am Ilinaltasee, südöstlich der Halbmondmühle. Es hat sehr viel Stauraum, Platz für 6 Kinder (optional) und bis zu 8 Begleiter. Optional sind außerdem eine Waffensammlung und eine Galerie mit Vitrinen und Auslagen für alle einzigartigen Gegenstände. Das Haus kann für 10000 Gold erworben werden, ein entsprechendes Schild steht in der Nähe der Eingangstür. \n<br /> \n<br />[b]Eigenschaften:[/b]\n<br />[list]\n<br />[*]Stall für bis zu 2 Pferde\n<br />[*]20 Stellen mit Fruchtbaren Boden (9 draußen und 11 im Keller im Alchemie-Bereich\n<br />[*]Optionales Gästehaus mit kleiner Küche und 6 Betten.\n<br />[*]Feuerstelle im Garten (an- und ausschaltbar), Anlegestelle und Bienenstock\n<br />[*]2 Hühner und eine Kuh\n<br />[*]sehr viel Stauraum, viel davon benannt\n<br />[*]8 Bücherregale\n<br />[*]Alchemie, Verzauberer, Holzblock (außen)\n<br />[*]Entzauberer (Achtung –nur selbst verzauberte Gegenstände entzaubern!!!)\n<br />[*]Lichter im Außenbereich schalten sich automatisch an und aus\n<br />[*]mehrere Teppich- und Bettwäschefarben zur Auswahl (umstellbar im Schlafzimmer)\n<br />[*]auf dem Esstisch kann per Klick Essen serviert werden\n<br />[*]alle Feuerstellen können an- und ausgeschaltet werden\n<br />[*]große Küche mit Bar und Ofen\n<br />[*]Badewanne mit funktionierendem Wasserhahn und Automatischer Entkleidefunktion für NPCs\n<br />[*]Optionales Kinderzimmer mit 6 Betten\n<br />[*]Gästezimmer im Obergeschoss mit einem Bett\n<br />[*]Optionales Gästezimmer im Keller mit einem Bett\n<br />[*]Versteckter Vampirsarg im Keller\n<br />[*]Optionale Galerie mit Vitrinen für alle einzigartigen Gegenstände\n<br />[*]Optionale Waffenkammer mit Platz für alle Vanilla Waffen und Rüstungen\n<br />[*]Gesäubert mit TESVEdit\n<br />[/list] \n<br />[b]Anmerkungen:[/b]\n<br />[list]\n<br />[*]Optionale Räume könnenmit einem Knopf neben der Tür ein- und ausgeschaltet werden.\n<br />[*]Der Entzaubererfunktioniert nur mit selbst hergestellten Gegenständen.\n<br />[*]USLEEP (o.ä.) wird sehr empfohlen, ist aber nicht unbedingt nötig.\n<br />[*]Um mit Kindern und Ehepartnern einzuziehen, wird der Multiple Adoptions Mod von TMPhoenix benötigt.\n<br />[*]Begleiter können mitMods wie My home is your Home dem Gästehaus zugewiesen werden. Das Gästehaus\n<br />[*]sollte nicht deaktiviert werden, wenn ihm Begleiter zugewiesen sind.\n<br />[*]Das automatische Lichtim Außenbereich kann 24 benötigen, um sich richtig einzustellen.\n<br />[*]Wenn die Schriftrolle der Alten (Drache) nicht platziert werden kann, liegt das an einem Bug, durch den man die falsche Version der Schriftrolle hat. Wenn das passiert, kann man die falsche Schriftrolle mit Konsolenbefehlen entfernen und durch die richtige ersetzen:       \n<br />[/list]   ﻿   ﻿ &lt;Player.removeitem 0002D513 1&gt;\n<br />    ﻿   ﻿&lt;Player.AddItem030126DC 1&gt;\n<br />[list]\n<br />[*]Die Ausstellungsbereiche stammen aus dem Mod “Dosplays – Dragon Claw and others“. Laut der Modseite können die Schmiedeverbesserungen verloren gehen, wenn ein Objekt platziert wird. Platziert die Objekte daher am besten erst, wenn sie nicht mehr benötigt werden. \n<br />[*]Die Galerie ist so aufgebaut, wie der Modautor seine Sammlung präsentieren wollen. Einige einzigartige Waffen und Rüstungen gehören an bestimmte Puppen und bestimmte Waffenhalterungen. Natürlich kann trotzdem jedes Objekt an einem beliebigen Platz gestellt werden. Dennoch bietet der Modautor auf seiner Seite eine Datei an, in der alles so aufgelistet wird, wie es gedacht war. \n<br />[*]Die Hausarchitektur benutzt Weißlauf-Texturen, falls ihr also einen Mod benutzt, der diese Texturen verändert, wird davon auch das Haus betroffen sein. \n<br />[/list] \n<br />(Eigenschaften und Anmerkungen entstammen der Beschreibung der Englischen Fassung und wurden frei von mir übersetzt.)\n<br /> \n<br />Vielen Dank an Cynndal für die Erlaubnis, die Übersetzung veröffentlichen zu dürfen. Bitte lasst ein Endorsement beim Originalmod da, Cynndal hatte schließlich die Hauptarbeit damit ;)\n<br />\n<br />Cynndal, thank you for giving me permission to publish this translation! :)",
  "categoryId": "67",
  "version": "1.6.2",
  "author": "Senyachan",
  "createdUnix": "1525809979",
  "updatedUnix": "1525809979",
  "containsAdultContent": false,
  "uploadedBy": "Senyachan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000272587",
      "name": "Lake Haven GERMAN Cottage am Seeufer",
      "version": "1.6.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "359",
      "fileName": "Lake Haven GERMAN Cottage am Seeufer-91238-1-6-2.zip",
      "uploadedUnix": "1525809907",
      "modVersion": "1.6.2",
      "virusScanUrl": "https://www.virustotal.com/file/c7cf93b8e1bb3ea2898cc2e3e6af2fd479f4b4c25e187794dccf92e512a7b8ce/analysis/1525810047/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lake%20Haven%20GERMAN%20Cottage%20am%20Seeufer-91238-1-6-2.zip?fid=1000272587&ttl=1535881721&ri=8192&rs=8192&setec=8fbd2f3e191c07cef00a7328305ce95c"
    }
  ]
}