{
  "modId": 91249.0,
  "modName": "The Gemstone Prophecy",
  "summary": "A Book driven quest that has 4 followers, custom armor and weapons, amazing end mod payout and rich story told through 30 \"cut-scene\" books.",
  "descriptionHtml": "[url=https://flic.kr/p/25U51sm][font=Lucida Sans Unicode][size=5]Learn more about upcoming Gemstone Mods Projects at [color=#ffff00]https://www.facebook.com/groups/317176935377991/[/color]\n<br />and at my Youtube Channel at [color=#ffff00]https://www.youtube.com/channel/UCgheLAMTmjBXfxzykodh4NQ/videos?\n<br />\n<br />[/color][/size][/font]\n<br />[color=#00ffff][size=5]It has been months since the Shyeri warrior Rolonce' had become known in Skyrim by discovering the ruins of an ancient battle between the Bloodstone and The Gemstone Maidens, proving that the legends of lore were actually true. You have been given a tip of another set of ruins, and set out to discover them, and become famous as well.[/size][/color]\n<br />\n<br />[img]https://farm1.staticflickr.com/827/41283359384_eb7fd2c522_b.jpg[/img][/url]\n<br />\n<br />[font=Lucida Sans Unicode]\n<br />[size=5]From the Minds of The Lost Cavern of Prophecy and Hammet's Dungeon Packs comes... [color=#1155cc]The[/color] [color=#ff0000]Gem[/color][color=#00ff00]stone[/color] [color=#9900ff]Prophecy[/color], a quest style mod in the vein of the old school RPGs... The player learns of a great evil and must assemble a team to fight that evil while finding loot and upgrades along the way, while learning the story behind The Gemstone Prophecy.\n<br />\n<br />[color=#00ffff]This Adventure Includes- \n<br />\n<br />[/color][/size][color=#00ffff][size=5]- A set of Dungeons, Temples and Caves created by Venjhammet[/size][/color][size=5][color=#00ffff]\n<br />- 4 followers, with custom skin and eyes, all getting [/color][/size][color=#00ffff][size=5]Custom sets of armor and Custom Weapons with different enchantments throughout the game[/size][/color][/font][size=5][font=Lucida Sans Unicode][color=#00ffff]\n<br />- 1 set of Custom player armor  \n<br />- 1 custom NPC Boss character with Custom Armor and Weapon\n<br />(armor is hers but you can take the weapon...if you can kill her)\n<br />- TONS of items at the end - you will be good to go after finishing this\n<br />- 1 awesome Mansion with all the amenities and a shopkeeper\n<br />[/color][color=#00ffff]- 30 books detailing a rich storyline and lore of the Prophecy[/color][/font]\n<br />\n<br />[/size][font=Lucida Sans Unicode][size=5][color=#ffff00]How to Start your Journey - \n<br />\n<br />[/color][/size][/font][size=5]ATTENTION: This mod has books that point you where to go. This \"quest\" has NO quest markers that pop up (it's a book-driven quest), so don't think it isn't working if you do something and nothing pops up. Just follow the directions and read all the books and you'll be fine.[/size][font=Lucida Sans Unicode][size=5][color=#f4f4f4] The story is important to the quest. [/color][/size][size=5]The storyline for the mod is fleshed out over the course of the mod by over 30 gemstone prophecy \"lore\" books detailing the current timeline (as it unfolds) as well as a series of books that talk about  the maidens, the last gemstone battle and also the story of Bloodstone, all written by RipX.[/size]  [/font][size=5][color=#f4f4f4][font=Lucida Sans Unicode]READ ALL BOOKS! [/font]\n<br />\n<br />[url=https://flic.kr/p/JaAjdy][img]https://farm1.staticflickr.com/788/27675527808_29ab782a5d_z.jpg[/img][/url] \n<br />[/color][/size][size=5][color=#00ff00]\n<br />[font=Lucida Sans Unicode]The Story -[/font][/color][font=Lucida Sans Unicode] \n<br />\n<br />In the next of a repeating cycle that has occurred through time, Molag bal has once again decided that the world deserves to die, and has vowed to destroy it. He has been harvesting the evil of mankind and now has enough evil energy to summon his Bloodstone, destroyer of worlds... The Divines realize that they do not want to rule over a dead world, and, in secret, make the decision to create champions to defeat her. The divines have taken eight magical gemstones and from those have created Magical Armor and weapons to accompany 8 Gemstone maidens, who will challenge and defeat Molag bal's Bloodstone. But it will not be easy.  Molag Bal has resurrected the ancient architect Venj hammet, who has created four dungeons of incredible evil power. Molag Bal's Bloodstone has also created a four floor gauntlet dungeon, and these stand between the maidens and the destruction of the world. The dragonborn must find 4 of these maidens and take them through their dungeon, and then claim their magic armor and weapon. Then, with all four maidens together, you must go through the Bloodstones gauntlet and finally face and defeat the Bloodstone... who has her own secret. All this is done while learning the story of the maidens, The last time this happened, and even Bloodstone herself. The risk is great and the reward is fitting a mission of this magnitude. Are you ready to fulfill The gemstone prophecy?[/font]\n<br />\n<br />[url=https://flic.kr/p/25U51sm][img]https://farm1.staticflickr.com/827/41283359384_eb7fd2c522.jpg[/img][/url]\n<br />[/size][size=5][color=#00ff00]\n<br />[/color][font=Lucida Sans Unicode][size=5][color=#00ff00]Requirements - [/color]\n<br />[/size][/font][/size][font=Lucida Sans Unicode][size=5][color=#00ffff][size=5]\n<br />1.- A Follower framework mod, Like AFT or EFF, that will enable you to have 4 followers and enable you to manage their armor, weapons and inventory. I tested with AFT.\n<br />\n<br />[/size]2. -The regular same ol\n<br />\n<br />-SKSE\n<br />-Dragonborn\n<br />-Hearthfires\n<br />-Dawnguard[/color]\n<br />\n<br />[color=#00ff00]Q/A-\n<br />[/color]\n<br />Q - You looking for videos, reviews, or pics of the mod from players to put on the mod page?\n<br />A - Yes, please. Screenarchers, I'd LOVE it. Thanks in advance!\n<br />\n<br />Q- Any Conflicts?\n<br />A - Well there's not anywhere in skyrim that's NOT modded nowadays, so there's always a chance. You may need to disable a mod or 2 while you are playing this, but it'll be worth it.\n<br />\n<br />Q - Are either these versions of the maidens, the armor, or weapons going to be released separately? \n<br />A - Not at this time. Sapphire is exclusive to this mod, but may later be available in a pack with the other 3 new versions, with their gemstone armor and weapons. I wouldn't wait for it, though.\n<br />\n<br />[/size][size=5]\n<br />[color=#00ff00]Credits -[/color] \n<br />\n<br />This mod is truly a collaborative effort throughout many great modders.\n<br />[/size][/font][size=5]- [color=#00ff00]VenjHammet[/color], for providing the amazing dungeons and countless amounts of editing help throughout the course of development [/size][font=Lucida Sans Unicode][size=5]\n<br />- [color=#00ff00]Ashes2Asherz[/color], for so many things. He took the launch file (which had a lot of errors) and spent days fixing a million things .He also made many aspects of the mod better, including maiden combat and many others.\n<br />[/size][size=5][color=#00ff00]- MFeile1974[/color], This...NONE of this would even exist at all if it wasn't for this woman. For helping me bring the original Amethyst, Ruby, and Emerald to life, she helped create the very beginning of the Gemstone universe. Her original versions of Amethyst Ruby and Emerald are still very poular - [/size][size=5]\n<br />[/size][size=5]- [/size][size=5][color=#00ff00]BoneTounge[/color], For help with design, lighting, script, armor, follower creation and many other things[/size][size=5]\n<br />- [color=#00ff00]Pandorable[/color], for helping me re imagine the maidens and Bloodstone, with amazing presets and makeup work. \n<br />- [color=#00ff00]MassiveMaster[/color], for creating a custom version of her baby Doll X skin &amp; custom eyes for the maidens    https://www.nexusmods.com/skyrim/mods/87171 as well as creating Emerald's bow and Arrows\n<br />- [color=#00ff00]RavenDier[/color], for letting me use his fantastic Elven Chainmail Armor to create the Maiden's Armor    https://www.nexusmods.com/skyrim/mods/79664/\n<br />[/size][/font][size=5][font=Lucida Sans Unicode]- [color=#00ff00]Taoxue[/color], for working hard to try and get a courier and quests working, along with some tweaking help\n<br />- [color=#00ff00]Ronnie Magnum[/color], for the exclusive weapons created for Amethyst and Sapphire \n<br />- [color=#00ff00]LeonMalan[/color], for giving us a fantastic gift that the player will receive at the end of the mod.\n<br />- [color=#00ff00]Tiwaa44[/color], for letting me use the spice gear meshes[/font]\n<br />\n<br />\n<br />\n<br />[/size]",
  "categoryId": "35",
  "version": "2.0",
  "author": "RipX and Venjhammet",
  "createdUnix": "1525896035",
  "updatedUnix": "1525896035",
  "containsAdultContent": false,
  "uploadedBy": "TheWorldofRipX",
  "primaryFile": null,
  "files": []
}