{
  "modId": 91241.0,
  "modName": "Billyro Flamberge variants Saint tools",
  "summary": "I don't like brown leather. First variant changes that more on the way (flaming version, ice version)",
  "descriptionHtml": "Love the Flammenschwert class of Zweihander. There is much debate as to wether these swords were more effective at cutting than the straight blade version. I would point out that these blades, although wavy, are not serated, so what additional use they would have gained would likely be accidental. You must remember that Archangel Michael, the guardians of Eden as well as Christ himself are described as having flaming swords both literally and figuritively, it is this ones opinion that the design is because of religious purposes. I will also point out that many of these weapons did not see combat (though many did). \n<br />\n<br />Often the cut shape would have reduced weight so they could be easily carried through towns in parade procession with ease. Plus of course they have a neat shape, lending them further to parading. The Landskecht who wielded these weapons were known to be obsessed with f-f-f-fashionsouls just as much as this guy, so I simply can't leave the sword in a brown scabbard.\n<br />\n<br />If anyone wants unique textures for this or any other (historically accurate) weapon or armor (no boob plate, ever) just send me a text.\n<br />\n<br />There will be a few other variants over the next days. \n<br />\n<br />this first addition makes the handle a very deep but faint purple color, as always my mods are geared to the few practical female players.\n<br />\n<br />This does recolor the scabbard, but serious ditch it. large swords were never worn on the back. ever. you have horses for that, or simply carry the sucker and be impressive. Unless your Gutts. then do as you please.\n<br />\n<br />Fire and Ice versions are next. considering doing some landsknecht versions.\n<br />\n<br />\n<br />installation is easy. this requires Billyros flamberge first, and then you drop my texture file into the data folder and overwrite. \n<br />https://www.nexusmods.com/skyrim/mods/91168\n<br />\n<br />Make sure to endorse Billyro for his hard work, take it from me, this is very well made sword. In fact, the textures are completey two sided, meaning that one side of the blade will be unique to the other side. this will look especially cool with the flame and ice blades Me-thinks.",
  "categoryId": "55",
  "version": "1",
  "author": "gethesmain",
  "createdUnix": "1525831719",
  "updatedUnix": "1525831719",
  "containsAdultContent": false,
  "uploadedBy": "Gethesmain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000272605",
      "name": "Flamberge purple variant",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15431",
      "fileName": "Flamberge purple variant-91241-1.7z",
      "uploadedUnix": "1525831697",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f393c190bf00e76beb81b2461a1e751a4692271154d22efbe863d4a3c737a4a2/analysis/1525834436/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Flamberge%20purple%20variant-91241-1.7z?fid=1000272605&ttl=1535881724&ri=8192&rs=8192&setec=e48295318cd0d8865621c2bde6fd90a7"
    }
  ]
}