{
  "modId": 91268.0,
  "modName": "Zim's Falkreath Home",
  "summary": "The aim of this mod is to provide a player home that - instead of catering to all the needs of the player with crafting stations, display cases and so on - is designed to support an early-game character with and feels immersive, grounded and lore-friendly, while also providing some unique and interesting features.",
  "descriptionHtml": "Brief overview:\n<br />The aim of this mod is to provide a player home that - instead of catering to all the needs of the player with crafting stations, display cases and so on - is designed to support an early-game character with and feels immersive, grounded and lore-friendly, while also providing some unique and interesting features.\n<br />\n<br />[center][url=http://www.nexusmods.com/skyrim/mods/86470/?][img]http://www.imageupload.co.uk/images/2018/04/15/ZDI.png[/img][/url][url=http://www.nexusmods.com/skyrim/mods/81036/?][img]http://www.imageupload.co.uk/images/2018/04/15/ZIA.png[/img][/url][url=http://www.nexusmods.com/skyrim/mods/83444/?][img]http://www.imageupload.co.uk/images/2018/04/15/ZFE.png[/img][/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/90735][img]http://www.imageupload.co.uk/images/2018/04/15/ZASS.png[/img][/url][url=https://www.nexusmods.com/skyrim/mods/91268][img]http://www.imageupload.co.uk/images/2018/05/10/ZFH.png[/img][/url][/center]\n<br />\n<br />[font=Arial][center][img]http://www.imageupload.co.uk/images/2018/05/10/INTRODUCTIONae41d.png[/img]\n<br />[color=#f9cb9c][size=3][b]The aim of this mod is to provide a player home that - instead of catering to all the needs of the player with crafting stations, display cases and so on - is designed to support an early-game character and feels immersive, grounded and lore-friendly, while also providing some unique and interesting features.[/b][/size][/color]\n<br />\n<br />[size=3][b][color=#f6b26b]A New Player Home: Silverglade[/color][/b][/size]\n<br />Adds a new player home named Silverglade to Falkreath.\n<br />Comes with alchemy and blacksmith workbenches, a tanning rack, chopping block, grindstone, cooking apparatus, \n<br />x3 chests, x2 wardrobes, multiple additional storage options, x2 weapon racks, a mannequin and a safe.\n<br />\n<br />[size=3][b][color=#f6b26b]Unique Home Features[/color][/b][/size]\n<br />The new home has several unique features, including a lockable front-door, dynamic firewood storage, a chopping block with \n<br />a built-in woodcutter's axe, a functional archery range, toggleable lights and a fireplace that requires firewood to run.\n<br />Includes two new obtainable items: Karion's Bow and the Boots of Stagnation.\n<br />\n<br />[size=3][b][color=#f6b26b]A New Quest[/color][/b][/size]\n<br />A simple quest has been created allowing the player to obtain the house.\n<br />There are several ways to begin and complete this quest; see the New Quest section below.\n<br />\n<br />[size=3][b][color=#f6b26b]Requirements and Compatibility[/color][/b][/size]\n<br />No other mods or DLCs are required to use this mod, and it's fully compatible with all my mods.\n<br />It may be incompatible with other mods that amend Half-Moon Mill and the surrounding area.\n<br />It may appear to clash with mods that change the Tamriel worldspace. For example, TES5Edit will display a clash between this mod and USLEEP; this is because both mods edit areas in the Tamriel worldspace, but actually these changes will not clash.\n<br />Place this mod lower in your load-order than any mods that might clash with it to avoid any issues.[/center]\n<br />\n<br />\n<br />[center][img]http://www.imageupload.co.uk/images/2018/05/10/HOUSE11d1f.png[/img][/center]\n<br />[color=#f6b26b][b][size=3]What the house has...[/size][/b][/color]\n<br />The player home is named Silverglade. There are three areas to it: the exterior, the main room and the cellar. The house has been designed to resemble a hunter's home and uses Skyrim-vanilla assets only. I recommend downloading the Static Mesh Improvement Mod if you haven't already.\n<br />\n<br />In the exterior area, you will find:\n<br />- A shack containing x1 chest, x3 barrels, x3 sacks, x1 alchemist's satchel, and an alchemy workbench\n<br />- An additional x1 barrel and x3 sacks\n<br />- A tanners rack\n<br />- A blacksmith's workbench\n<br />- A grindstone\n<br />- A functional archery range that will level up your Archery skill when fired at\n<br />- A wood chopping block with a built-in woodcutter's axe (so you won't need to carry one with you)\n<br />- An option to lock Silverglade's front door, provided you have the key\n<br />\n<br />In the main room, you will find:\n<br />- x1 bed\n<br />- x1 chest, x3 barrels, x13 sacks, and x3 draws\n<br />- Cooking equipment\n<br />- x2 weapon racks, x1 shield plaque\n<br />- x4 toggleable candles\n<br />- A buildable fireplace which will light up the room and allow cooking for a set time (requires x2 firewood)\n<br />- A dynamic wood pile, which will grow or shrink depending on how much firewood is stored in it\n<br />\n<br />In the basement, you will find:\n<br />- x1 chest\n<br />- x1 mannequin\n<br />- x1 safe (this is unlocked with the Silverglade home key and will automatically lock itself when closed)\n<br />- x2 cellar storage piles (these are for storage of random loot you'd prefer not to store upstairs)\n<br />- x1 toggleable candle\n<br />\n<br />[color=#f6b26b][b][size=3]What the house doesn't have...[/size][/b][/color]\n<br />Initially, Silverglade is owned by a hunter (see the New Quest section below). As such, the house is decorated with hunting trophies and contains everything a hunter would need. It does not contain some of the usual things one sees in player homes that are designed for the player's convenience. It is particularly noteworthy that the mod doesn't contain:\n<br />- A forge or anvil\n<br />- A smelter\n<br />- An enchanting bench\n<br />- Display cases\n<br />- Stables\n<br />- Book shelves\n<br />- Shrines\n<br />- A bakery\n<br />- Farming, fishing and beekeeping options\n<br />- A spare bed\n<br />- Scripting to allow spouses or adopted children to live here\n<br />\n<br />There's a good reason I've left these things out. Silverglade is not meant to be an end-game player house where the Dragonborn can settle down with everything he/she needs. This house is designed to be temporary. It is for early characters who need a place to live before having access to any of the other houses available.\n<br />\n<br />[color=#f6b26b][b][size=3]Location[/size][/b][/color]\n<br />Silverglade can be found near the southern border of Lake Ilinalta in Falkreath. It is close to Half-Moon Mill. See the screenshot in the images above for an exact map location.\n<br />\n<br />\n<br />[center][img]http://www.imageupload.co.uk/images/2018/05/13/QUEST.png[/img][/center]\n<br />When this mod is first loaded, Silverglade will be owned by a hunter named Karion Dul.\n<br />There are three ways to begin a quest that will end with you owning Silverglade:\n<br />\n<br />[color=#f6b26b][b]Option 1[/b][/color]\n<br />If you're role-playing a good character, this is the only option. You will need to obtain one of four items:\n<br />- Kyne's Tokem\n<br />- The Savior's Hide\n<br />- The Ring of Hircine\n<br />- The Boots of Stagnation (these are a new item that can be found in the boss chest in Moss Mother Cavern)\n<br />When you acquire one of these, wait 24 hours and you will receive a letter which begins the quest.\n<br />If you already have one of these items, you may need to drop it from your inventory and re-acquire it.\n<br />\n<br />[color=#f6b26b][b]Option 2[/b][/color]\n<br />Find Karion and murder him. Karion will hunt through Falkreath in the day and go to Dead Man's Drink most evenings.\n<br />He will also do jobs around Silverglade's exterior in the early morning.\n<br />\n<br />[color=#f6b26b][b]Option 3[/b][/color]\n<br />Pickpocket the key to Silverglade from Karion. If you do this, Karion will hunt you down and try to kill you.\n<br />\n<br />[center][b][size=3][color=#f6b26b]PRESS THE SPOILER BUTTON BELOW TO VIEW\n<br />A FULL QUEST GUIDE[/color][/size][/b][/center]\n<br />\n<br />[spoiler]\n<br />[b][size=5]Silverglade[/size][/b]\n<br />\n<br />[b]Quest Giver:[/b] Read the [i]Warning Letter[/i], or kill Karion Dul, or steal the Silverglade Key from Karion Dul\n<br />[b]Location(s):[/b] Falkreath, Silverglade\n<br />[b]Reward:[/b] Silverglade player home, Karion's Bow (optional)\n<br />[b]ID:[/b] ZFH_Quest\n<br />\n<br />[size=4][u]Quick Walkthrough[/u][/size]\n<br />1. Acquire Kyne's Token/the Savior's Hide/the  Ring of Hircine/the Boots of Stagnation\n<br />2. Wait 24 hours to receive a [i]Warning Letter[/i]\n<br />3. Wait another 24 hours for the hunt to begin\n<br />4. Survive the hunt and kill Karion Dul\n<br />5. Loot Karion's body and read [i]Karion's Letter[/i]\n<br />6. Take the Silverglade Key from Karion's body\n<br />7. Access Silverglade to claim it for your own\n<br />OR\n<br />1. Kill Karion Dul\n<br />2. Loot the Silverglade Key from his body\n<br />3. Access Silverglade to claim it for your own\n<br />OR\n<br />1. Pickpocket the Silverglade Key from Karion Dul\n<br />2. Access Silverglade to claim it for your own\n<br />\n<br />[size=4][u]Detailed Walkthrough[/u][/size]\n<br />[b][size=3]Acquiring a Hunter's Prize[/size][/b]\n<br />The first way to begin this quest is to acquire one of the following items: Kyne's Token, the Savior's Hide, the  Ring of Hircine, or the Boots of Stagnation. If you already have one of these items when first loading the mod, you may need to drop it from your inventory and pick it up again to trigger the events that will continue the quest. Once once of these items has been acquired, wait 24 hours and you will receive a [i]Warning Letter[/i]. Reading this letter will start the quest.\n<br />\n<br />The Boots of Stagnation are a new item added by this mod. They have a unique enchantment called Stagnation, which will muffle your movement and allow you to walk on water. This enchantment can be learned by disenchanting the boots, which can be found in the boss chest in Moss Mother Cavern.\n<br />\n<br />[b][size=3]The Hunt[/size][/b]\n<br />The [i]Warning Letter[/i] you receive will come from a courier. On reading the letter, the quest will begin. The letter will explain that someone named Karion intends to kill you and gives you 24 hours to prepare yourself for a fight.\n<br />\n<br />Once 24 hours have passed, the quest will update and the hunt will begin. During this time, Karion Dul will track you down and try to kill you. You can continue to play as normal and wait for Karion to turn up, or you can follow your compass marker, which will point to Karion's location. To survive the hunt, kill Karion.\n<br />\n<br />[b][size=3]Finding Silverglade[/size][/b]\n<br />On Karion's body, you will find a note explaining his actions and his reasons for wanting you dead. You will also learn of the location of his home, and you will be able to loot the Silverglade Key from his body. Once you have the key, you can gain access to Silverglade to complete the quest.\n<br />\n<br />[b][size=3]The Murderer's Option[/size][/b]\n<br />If you haven't yet acquired one of the four items to start the quest, you can simply kill Karion and take the key from his body. Karion will hunt through Falkreath in the day and go to Dead Man's Drink most evenings. He will also do jobs around Silverglade's exterior in the early morning.\n<br />\n<br />[b][size=3]The Thief's Option[/size][/b]\n<br />If you haven't yet acquired one of the four items to start the quest, you can also pickpocket the key to Silverglade from Karion. This can be very difficult to do as Karion has exceptional powers of detection and is hard to steal from. Even if you do successfully steal the key, Karion will soon figure out you've taken it and track you down to kill you and claim the key back.\n<br />[/spoiler][/font]",
  "categoryId": "67",
  "version": "V1",
  "author": "Zim",
  "createdUnix": "1525970802",
  "updatedUnix": "1525970802",
  "containsAdultContent": false,
  "uploadedBy": "Zimmermjaz",
  "primaryFile": null,
  "files": []
}