{
  "modId": 91320.0,
  "modName": "Enderal - Ark Playerhomes",
  "summary": "Makes changes to both of the official player homes in Enderal. The cheap one at the Marketplace only has some minor additions and furniture changes, but the expensive one in the Nobles Quarter has been rebuilt from the ground up to make it somewhat architecturally correct and add functionality and clutter. Four price options available.",
  "descriptionHtml": "[color=#f1c232][size=5][b]Requirements[/b][/size][/color]\n<br />\n<br />Requires [url=https://www.nexusmods.com/skyrim/mods/77868/]Enderal[/url]. Follow the instructions [url=https://enderal.com/]here[/url] to get it - it's absolutely amazing.[b]\n<br />\n<br />\n<br />[color=#f1c232][size=5]Description[/size][/color][/b]\n<br />\n<br />As much as I love pretty much everything about Enderal, I was somewhat disappointed by both of the available houses. The Marketplace home has weirdly placed furniture and lacks a cooking pot, the Nobles Quarter home looks pretty but has NO storage whatsoever except for the Secure Chest and some bookshelves - even though all of those static barrels, chests and sacks are also available as containers. Additionally, its interior layout doesn't match the exterior at all.\n<br />\n<br />So I slightly changed the Marketplace home (time put into it: about 5 hours) to make it more logical and functional, and I completely rebuilt the Nobles Quarter home, mostly because I felt like doing it. As a result, it is now somewhat architecturally correct (i.e. the interior matches the exterior as closely as the building kit allows, including windows), and a LOT more detailed. I've added literally thousands of clutter items and tons of storage options, both generic and named. Check the Images tab for some impressions.\n<br />\n<br />\n<br />[color=#f1c232][size=5][b]Features[/b][/size][/color]\n<br />\n<br />- Four price options for the mod as a whole - download the one you feel most comfortable with but DO NOT try to use more than one at a time (the one you've installed last will take precedence). \"Cheapest\" is still slightly more expensive overall than \"Vanilla\" Enderal, \"Expensive\" will cost you about 10k for the Marketplace home and 48k for the Nobles Quarters home (high Rhetorics can slightly lower the price of the deed but not of the interior furnishings). I play with the \"Expensive\" option because I like having gold sinks in my game (even in Enderal with the expensive Master skill books).\n<br />- Navmeshed interiors (because ... I have no idea, there are no regular NPCs who ever enter your house, but maybe you've got a follower mod).\n<br />- Build Mode is still available in both houses. This may help you bridge the time between first buying the deed to the house and actually being able to afford the furnishing options, especially with more expensive options.\n<br />\n<br />[color=#ffe599][b][size=4]Marketplace Home[/size][/b][/color]\n<br />[b][color=#ff0000]\n<br />Note:[/color][/b] I already released this as a [url=https://www.nexusmods.com/skyrim/mods/90621]separate mod[/url] some time ago. That mod is now [b][color=#ff0000]obsolete[/color][/b] because it is incorporated here - do NOT use both at the same time!\n<br />\n<br />[list]\n<br />[*]All the old crafting stations (Alchemy, Enchanting, Workbench) plus Cooking Pot\n<br />[*]A table you can actually eat at\n<br />[*]More storage, especially upstairs\n<br />[*]More clutter for immersive purposes of immersion into the Prophet's daily life\n<br />[/list]\n<br />[list]\n<br />[*]No more display cases. I hate display cases without activators (Hearthfire style).\n<br />[*]No Mannequins. If you want one, craft a placeable one and put it next to the bedroom door.\n<br />[*]Unchanged exterior with everything you need for smithing.\n<br />[/list]\n<br />[color=#ffe599][b][size=4]Nobles Quarter Home[/size][/b][/color]\n<br />\n<br />[list]\n<br />[*]Buy options for interior furnishing divided into three parts: Ground Floor - Top Floor - Crafting Wing. This is because you probably won't have enough cash to afford everything right away. Use Build Mode to put some storage or crafting stations in until you can afford the proper furnishing, but be sure to REMOVE all placeable items before buying it. Otherwise you'll have overlapping objects, guaranteed, because there's clutter and stuff EVERYWHERE.\n<br />[*]GROUND FLOOR: Entryway, study, kitchen, dining with fireplace.\n<br />[*]TOP FLOOR: Master bedroom, lounge with reading area, bathroom.\n<br />[*]CRAFTING WING: Smithy, library, shrine, painting studio, alchemy, enchanting. More weapon racks and plaques. Functional bookshelves like in Vanilla (I've had to add them back in because the markers had been deleted from Enderal).\n<br />[*]A Home Decorating Guide to immersively give you and immersive ingame explanation of what you're gonna get when you upgrade.\n<br />[*]Light switches to turn the lights for the GROUND FLOOR and the CRAFTING WING on and off.\n<br />[*]Separate buttons to light and extinguish the KITCHEN and FORGE FIRES. This is important because those two lights are SHADOW CASTERS, and in conjunction with the TONS and TONS of CLUTTER (TM) I've added, they eat performance. So much performance. I've got a GTX1070 and each of the shadow casters drops my FPS by 10-20, depending on the angle, which means they drop from 60 to as low as 15 if I look from the stairs all the way across towards the Crafting Wing. This is due to an engine limitation and probably can't be fixed any other way than culling the shadow casters.\n<br />--&gt; Turn the fires ON if you want to use the Cooking Pot or Forge, and turn them OFF when you're done using them. You won't be able to use those crafting stations as long as the fires are off.[*]SO.MUCH.CLUTTER. Seriously. Mostly static, some of it pickuppable.\n<br />[/list]\n<br />[list]\n<br />[*]No more display cases (see above)\n<br />[*]No mannequins (see above - maybe you'll find a spot to place one, maybe not)\n<br />[*]Slightly adjusted exterior to account for windows and ventilation I had to place.\n<br />[/list]\n<br />\n<br />[color=#f1c232][size=5][b]Known Issues and Limitations[/b][/size][/color]\n<br />\n<br />[list]\n<br />[*][b][color=#e06666]Performance.[/color][/b] As outlined above, the house in the Nobles Quarter has NOT been optimized for performance, like, at all. So if you've got a weak rig that can barely run Enderal, I strongly suggest only turning on the two shadow casting lights if absolutely necessary.\n<br />[*][b][color=#e06666]Weapon Racks and Plaques.[/color][/b] There is a reason why there are no player-activatable Weapon Racks or Plaques in Enderal. This is because Enderal has changed some animations and therefore some weapon meshes, as well as included new weapon meshes that have not been created with Weapon Racks and Plaques in mind. This means that not all weapons work well on all racks / plaques - you'll have to try it for each weapon and each rack because depending on the orientation / rotation of the rack / plaque, some weapons will look great while others will look completely bonkers. Use your own good judgment on that - or ignore the racks / plaques altogether.\n<br />[*][color=#e06666][b]Bookshelves.[/b][/color] Like with Weapon Racks and Plaques, there is a reason why player-activatable bookshelves (i.e. bookshelves on which you can place your on books and they'll be visible) as we know them from regular Skyrim don't exist in \"Vanilla\" Enderal. This is, I imagine, because there are some books that can be found OPEN in the game world, which means their mesh (3D model) is that of an OPEN book, not a CLOSED one. Placing one of those books on a shelf works but looks really weird. Again, use your own judgment and remove those books from the shelves. You can still store them in other containers.\n<br />[/list]\n<br />\n<br />[color=#f1c232][size=5][b]Future Plans[/b][/size][/color]\n<br />\n<br />[list]\n<br />[*]Add a German version. If you want to beat me to it, feel free to.\n<br />[*]Expand on the little secret you might find inside one of the houses.\n<br />[*]Possibly add displays for unique items. I'd like to finish the game for that first, though, so I know which uniques you get from which quest.\n<br />[/list]\n<br />\n<br />[color=#f1c232][size=5][b]Installation / Update / Uninstallation[/b][/size][/color] [color=#ff0000](&lt;-- This is important!!)[/color]\n<br />\n<br />Use NMM. If installing manually, extract the archive and place its contents into your Data folder so that the ESP is directly in the Data root folder. All files are organized in a way that lets you drag&amp;drop the whole thing right into your Data folder. Overwrite any files it asks you to. (A backup of the scripts might come in handy.)\n<br />\n<br />If installing on a [color=#f1c232][b]new game[/b][/color], you're good to go - everything should work as intended.\n<br />\n<br />When installing [color=#f1c232][b]mid-playthrough[/b][/color] AFTER you've already bought one or both of the houses and their furnishing, you need to take the steps below:\n<br />1) Do NOT install the mod before you've done all the other steps.\n<br />2) Go into BOTH of your houses and remove ALL your items from all storage containers as well as from the floor.\n<br />3) Go into BOTH of your houses and remove ALL the placed furniture.\n<br />4) Go into BOTH of your houses and ERASE all bought furnishings using the EXPANSION BOARD next to the door. [color=#ff0000]This is really important as it will screw up the script if you don't.[/color]\n<br />5) Go to a DIFFERENT INTERIOR CELL (for example the Bank in Ark). Save your game there and exit Skyrim.\n<br />6) Install the mod in your preferred price option.\n<br />7) Load up Enderal, go to your houses, buy the sh*t out of the new furniture, be happy.\n<br />\n<br />Note: After updating mid-playthrough, you might have some floating pickuppable clutter in the Marketplace home after updating. This is because havoc data is stored in the save game, and the references stay the same, so their position is as it was before the change. Pick that clutter up or manually place it somewhere else.\n<br />\n<br />If you [b][color=#f1c232]update[/color][/b] from the [url=https://www.nexusmods.com/skyrim/mods/90621]old independent mod for the Marketplace home[/url], steps are the same as outlined above. (I changed the ESP's name, so your game considers this a completely new mod.)\n<br />\n<br />Technical info: I've duplicated the cell for the Noble home. If you forgot something in the original cell, you can still get there by typing \"coc capitalcityplayerhouseupper\" into the console. Use a teleport scroll or whatever to get back out.\n<br />\n<br />\n<br />[color=#f1c232][size=5][b]Load Order &amp; Compatibility[/b][/size][/color]\n<br />\n<br />Anywhere, with anything except other mods that edit the houses. It's not like there's a plethora of Enderal-specific mods out there anyway. When in doubt, LOOT.\n<br />\n<br />[color=#e06666][b]Known incompatibilities:[/b][/color]\n<br />- [URL=https://www.nexusmods.com/skyrim/mods/86349?]Enderal - Player Home Redone[/URL]\n<br />\n<br />\n<br />[color=#f1c232][size=5][b]Credits[/b][/size][/color]\n<br />\n<br />[list]\n<br />[*]SureAI for creating Enderal.\n<br />[*]stuemper for first changing the Expansion Board script so that it does what I wanted it to do. And ever since then, the poor man has been my personal compiler because my CK won't let me do it myself. BIIIG thank you! :)\n<br />[*]Darkfox127 for his tutorials as well as his Enable/Disable script, which I have used for the light switches. Part of his uploads at [url=https://www.nexusmods.com/skyrim/mods/79519]Project Modularity[/url].\n<br />[/list]",
  "categoryId": "107",
  "version": "1.0",
  "author": "Unedjis and stuemper",
  "createdUnix": "1526248823",
  "updatedUnix": "1526248823",
  "containsAdultContent": false,
  "uploadedBy": "Unedjis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000272926",
      "name": "Ark Playerhomes - Cheapest",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "201",
      "fileName": "Ark Playerhomes - Cheapest-91320-1-0.7z",
      "uploadedUnix": "1526246771",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d21a1bf0bc2be655c1c8ca0aa02d235fc3d65d0774c3ddf757eb0bee8f5df9d7/analysis/1526246884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ark%20Playerhomes%20-%20Cheapest-91320-1-0.7z?fid=1000272926&ttl=1535881841&ri=8192&rs=8192&setec=31ace494735cfe59b977938bf756eaa1"
    },
    {
      "fileId": "1000272927",
      "name": "Ark Playerhomes - Cheap",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "202",
      "fileName": "Ark Playerhomes - Cheap-91320-1-0.7z",
      "uploadedUnix": "1526246916",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/da93770369857937ff47945e0726cb9918a013d68c866c71745a2ef52e58e23d/analysis/1526247007/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ark%20Playerhomes%20-%20Cheap-91320-1-0.7z?fid=1000272927&ttl=1535881841&ri=8192&rs=8192&setec=94914aad2ec565987df404dd32c3e346"
    },
    {
      "fileId": "1000272933",
      "name": "Ark Playerhomes - 1 - Cheapest",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "201",
      "fileName": "Ark Playerhomes - Cheapest-91320-1-0.7z",
      "uploadedUnix": "1526248358",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d21a1bf0bc2be655c1c8ca0aa02d235fc3d65d0774c3ddf757eb0bee8f5df9d7/analysis/1526248384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ark%20Playerhomes%20-%20Cheapest-91320-1-0.7z?fid=1000272933&ttl=1535881842&ri=8192&rs=8192&setec=df9934b4b4aab62e008f845e385cbc10"
    },
    {
      "fileId": "1000272934",
      "name": "Ark Playerhomes - 2 - Cheap",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "202",
      "fileName": "Ark Playerhomes - Cheap-91320-1-0.7z",
      "uploadedUnix": "1526248423",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/da93770369857937ff47945e0726cb9918a013d68c866c71745a2ef52e58e23d/analysis/1526248504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ark%20Playerhomes%20-%20Cheap-91320-1-0.7z?fid=1000272934&ttl=1535881842&ri=8192&rs=8192&setec=4011dbddef386cddff441335fa77c844"
    },
    {
      "fileId": "1000272935",
      "name": "Ark Playerhomes - 3 - Regular",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "201",
      "fileName": "Ark Playerhomes - Regular-91320-1-0.7z",
      "uploadedUnix": "1526248591",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dae6e1ba334fc6c34a7440633c0558808318dd04d8c5eb410edc229715fa8831/analysis/1526248683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ark%20Playerhomes%20-%20Regular-91320-1-0.7z?fid=1000272935&ttl=1535881843&ri=8192&rs=8192&setec=d16012376692a6b01a94c8bc9826ab25"
    },
    {
      "fileId": "1000272936",
      "name": "Ark Playerhomes - 4 - Expensive",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "201",
      "fileName": "Ark Playerhomes - Expensive-91320-1-0.7z",
      "uploadedUnix": "1526248669",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a39053926d63fe3d43a3e3a6068fd4f875c47ded31d70bcc20722dbb0b3e8c49/analysis/1526248743/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ark%20Playerhomes%20-%20Expensive-91320-1-0.7z?fid=1000272936&ttl=1535881843&ri=8192&rs=8192&setec=16b35478b259dcb8c9cd59ea891f3d4d"
    }
  ]
}