{
  "modId": 91338.0,
  "modName": "Gnar's Bulwark (Special Edition) - DELETED",
  "summary": "This mod adds a robust palace to Northeastern Skyrim, to serve as a home for the Dragonborn. Gnar's Bulwark is beholden of a dark, wintery atmosphere, but is still family- and companion friendly.",
  "descriptionHtml": "Hi everyone,\n<br />\n<br />This mod adds a palace to Northeastern Skyrim to serve as your home. It was built many centuries ago as a defense against the elves of Resdayn, and has a very old, musty and historic atmosphere using only vanilla sources. Thick glaciers and the icy sea surround much of the exterior, and the courtyard and balcony provide a fantastic view over Skyrim's Northeastern shores, with Windhelm, the College of Winterhold, and the shrine to Azura all visible in the distance... in clear weather of course. The inside shows some wear and tear, as is to be expected from an ancient monument, and snow creeps in through the cracks of the main door. Despite this, the palace has warm bedrooms for your family and any followers, and a throne to satisfy your vain awesomeness. \n<br />The aim of this mod is to create a family home that really embraces that cold, harsh, but beautiful side of skyrim. \n<br />\n<br />Requirements:\n<br />Please note that this mod will only work with Skyrim Special Edition. There is no previous version of this mod. \n<br />Also, I highly recommend that you use the 'Custom Family Home' mod created by WitchRiser. It allows you to move your family to any home. It's super awesome and I use it myself, and all props for that functionality go to WitchRiser. \n<br />\n<br />Finding and buying the place:\n<br />Gnar's Bulwark is located to the Northeast of Skyrim, beyond the Wreck of the Winter War, amidst the glaciers. You may have to swim a bit. The location is already marked on your map. To obtain the key, you have two options. You can go to the Palace of the Kings in Windhelm, between 8 A.M. and 8 P.M., and buy the deed from a man called Bjork for a sizable sum. The deed describes where to find the key (in a strongbox in the courtyard of Gnar's Bulwark). If you don't fancy parting with that much money, you can also just take the key from the lockbox. The option to buy the deed is there for people who, like myself, prefer to buy a fancy house as a reward for high-level monster killing and such. \n<br />\n<br />Features:\n<br />This home has an old and rough feel for a palace. Despite this, it has many of the things a dragonborn seeks in a home:\n<br />-Enchanting and Alchemy tables.\n<br />-A basement that serves as a fully equipped smithy.\n<br />-Weapon racks/plaques and mannequins to shamelessly show off your gaudy treasures.\n<br />-Two children's bedrooms.\n<br />-Three Extra beds. The Custom Family Home mod by WitchRiser also allows you to move the staff from your Hearthfire home, so I made sure they have a place    ﻿to sleep. Followers can also make use of the beds in this room.\n<br />-A balcony with a great view.\n<br />-Attention to detail throughout the home.\n<br />-A warm master bedroom, kitchen and dining hall that contrast with the snow creeping in through the door of the entry hall.\n<br />-No cheats or lore-breaking stuff.\n<br />\n<br />I think that's pretty much it. Please enjoy, and have a noice day ;-)",
  "categoryId": "68",
  "version": "1.0",
  "author": "richtigbloedepinguin",
  "createdUnix": "1526324986",
  "updatedUnix": "1526324986",
  "containsAdultContent": false,
  "uploadedBy": "richtigbloedepinguin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273003",
      "name": "Gnar's Bulwark",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "137",
      "fileName": "Gnar's Bulwark-91338-1-0.7z",
      "uploadedUnix": "1526324906",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c56ad888dfbe050789f37e6d51a39013dd3e272aaeb60183632f0984fb99a688/analysis/1526325064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gnar%27s%20Bulwark-91338-1-0.7z?fid=1000273003&ttl=1535881869&ri=8192&rs=8192&setec=ffdeedbb01ca944e6b12cccaeb808f99"
    }
  ]
}