{
  "modId": 91331.0,
  "modName": "Wrath of Nature - The Path of the Druid Spanish Translation",
  "summary": "Encuentra un viejo tomo que contiene enseñanzas antiguas de la ciencia druida que describe cuatro pruebas diferentes que te permitirán transformarte en poderosas bestias que tienen la capacidad de aprovechar las fuerzas devastadoras de la naturaleza.",
  "descriptionHtml": "[color=#00ff00]DESCRIPCIÓN[/color]Encuentra un viejo tomo que contiene enseñanzas antiguas de la ciencia druídica que describe cuatro pruebas diferentes que te permitirán transformarte en poderosas bestias que tienen la capacidad de aprovechar las fuerzas devastadoras de la naturaleza.\n<br />\n<br />Al llegar al nivel 10 y devolver el Dragonstone a Farengar, un mensajero entregará una carta al jugador que activará la misión \"Prácticas Perdidas\".\n<br />\n<br />Este mod agrega 4 poderes menores de transformación en la escuela de magia Alteración al arsenal del jugador. Son poderes menores, lo que significa que las ventajas de Alteración no afectan el costo de Magicka. Sin embargo, el engranaje encantado de alteración reducirá la magia necesaria para lanzarlo.\n<br />\n<br />Las transformaciones vienen equipadas con sus propias habilidades especiales. Las habilidades de los monstruos consumen energía en lugar de magicka y las transformaciones duran indefinidamente.\n<br />\n<br />[color=#00ff00]HECHIZOS DE TRANSFORMACIÓN[/color]Nota: Al presionar la tecla \"Shout\" en cualquier momento durante una transformación, volverá a su forma original. Además, las acciones de salto para lobo y tigre pueden servir como un ataque.\n<br />\n<br />Aspecto de Escarcha: este hechizo le otorgará acceso al usuario a los poderes del lobo de las heladas.\n<br />Clic izquierdo: mordida feral: un ataque cuerpo a cuerpo con dientes filosos.\n<br />Haz clic derecho: Respirar escarcha: un ataque de aliento helado.\n<br />Click Izquierdo y Derecho: Tormenta Frígida - Vientos sub-cero forman tres carámbanos que se disparan hacia el objetivo y lo empalan.\n<br />Aura: el lobo de escarcha encierra enemigos en hielo que obstaculizan su movimiento.\n<br />Pasivo: el lobo congelado es resistente al hielo y más ágil que cualquier otra forma, lo que le da una bonificación a la velocidad de movimiento. También en niveles más altos (40 y más), el lobo congela el camino por el que camina y le permite caminar sobre el agua.\n<br />\n<br />Aspecto del fuego: este hechizo le otorgará acceso al usuario a los poderes del tigre en llamas.\n<br />Click izquierdo: Fiery Strike - Un ataque cuerpo a cuerpo con garras afiladas.\n<br />Click derecho: Aliento de llama - Un ataque de aliento llameante.\n<br />Click Izquierdo y Derecho: Blazing Inferno - El tigre genera llamas intensas alrededor de su cuerpo, quemando todo dentro del radio de explosión.\n<br />Aura: las temperaturas crecientes ocasionan un daño de fuego continuo contra los enemigos, lo que los hace más vulnerables al calor intenso.\n<br />Pasivo: el tigre en llamas es resistente al fuego y tiene más energía para desatar más estragos a sus enemigos.\n<br />\n<br />Aspecto de la Tierra: este hechizo le otorgará al usuario acceso a los poderes del oso terrestre.\n<br />Click izquierdo: Swipe Attack - Un ataque cuerpo a cuerpo que inflige Bone Break Fever.\n<br />Right Click: Rapid Dash: el oso se lanza hacia adelante, lo que genera una onda de choque para tambalear a los oponentes.\n<br />Click izquierdo y derecho: Shockwave: el oso golpea con la pata en el suelo y le causa daño en el área.\n<br />Aura: una réplica que deshabilita a los enemigos haciéndolos incapaces para la batalla.\n<br />Pasivo: el oso ha fortalecido la salud y la resistencia al daño pero tiene una penalización severa a la resistencia mágica.\n<br />\n<br />Aspecto de la naturaleza: este hechizo le otorgará acceso al usuario a los poderes del espíritu de árbol sanador.\n<br />Clic izquierdo: Recrecimiento: la salud y la resistencia del espíritu del árbol se curan durante 10 segundos.\n<br />Clic derecho: Enjambre de la naturaleza: el espíritu del árbol enfoca su magia en un ataque de rayos que inflige daño mágico. Esta habilidad gasta Magicka en lugar de resistencia.\n<br />Barra espaciadora: Llamada de la naturaleza: el espíritu del árbol convoca espíritus de árbol más pequeños para ayudar en la batalla. El número de espíritus de árbol invocados depende de la habilidad de alteración. Cada espíritu de árbol convocado dura 30 segundos. Tenga en cuenta que los espíritus del árbol tienen sus esencias vinculadas al jugador. Cualquier daño que se les haga infligirá una parte del daño al jugador.\n<br />Aura: Presencia sanadora: el espíritu del árbol cura a los aliados cercanos.\n<br />Pasivo: el guardián curativo ha fortificado la resistencia mágica.\n<br />\n<br />[color=#00ff00]BONIFICACIONES DE TRANSFORMACIÓN[/color]Cada una de las formas de la bestia tiene estadísticas de bonificación dependiendo del nivel del druida:\n<br />\n<br />Forma de escarcha\n<br />\n<br />La salud, la resistencia, la resistencia al daño, la resistencia a las heladas, y la velocidad de la forma de escarcha mejoran a medida que el jugador sube de nivel. Además, cada punto en resistencia aumenta cada estadística en una cantidad determinada. Esto significa que los personajes que tienen una cantidad decente de resistencia tendrán una forma de helada un poco más poderosa.\n<br />\n<br />[color=#00ff00]Forma de fuego[/color]La salud, la resistencia, la resistencia al daño, la resistencia a la magia, la resistencia al fuego y la velocidad de la forma de fuego mejoran a medida que el jugador sube de nivel. Además, cada punto en resistencia aumenta cada estadística en una cantidad dada. Esto significa que los personajes que tienen una cantidad decente de resistencia tendrán una forma de fuego un poco más poderosa. Tenga en cuenta que la bonificación de velocidad de la forma de fuego es inferior a la bonificación de velocidad de la forma de escarcha.\n<br />\n<br />[color=#00ff00]Forma de la Tierra[/color]La salud, la resistencia y la resistencia al daño de la forma de la tierra mejoran a medida que el jugador sube de nivel. Cada punto en la salud aumenta cada estadística en una cantidad determinada. Esto significa que los personajes que tienen una buena cantidad de salud tendrán una forma de tierra un poco más poderosa. Tenga en cuenta que la forma de la tierra obtiene una penalización gradual a la resistencia mágica y seguirá bajando a medida que sube de nivel. En el lado positivo, la forma de la tierra tiene la mayor bonificación en salud y resistencia al daño entre todos los aspectos.\n<br />\n<br />[color=#00ff00]Forma de la naturaleza[/color]La salud, la resistencia, la resistencia al daño y la resistencia a la magia de la forma de la naturaleza mejoran a medida que el jugador nivela",
  "categoryId": "93",
  "version": "3.2",
  "author": "RipHunterZ",
  "createdUnix": "1526339958",
  "updatedUnix": "1526538429",
  "containsAdultContent": false,
  "uploadedBy": "RipHunterZ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273014",
      "name": "Wrath of Nature - The Path of the Druid",
      "version": "3.2",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "21",
      "fileName": "Wrath of Nature - The Path of the Druid-91331-3-2.zip",
      "uploadedUnix": "1526339652",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/5470698eb3b7b9b89caa07431abb081a73eb69da0fea1a791728a5a69f4db77a/analysis/1526339763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wrath%20of%20Nature%20-%20The%20Path%20of%20the%20Druid-91331-3-2.zip?fid=1000273014&ttl=1535881859&ri=8192&rs=8192&setec=9534e0db1579c022944f1570fca99a24"
    },
    {
      "fileId": "1000273189",
      "name": "Wrath of Nature - The Path of the Druid 3.2",
      "version": "3.2",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "21",
      "fileName": "Wrath of Nature - The Path of the Druid-91331-3-2.zip",
      "uploadedUnix": "1526535628",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/3a4ff29392b2e916f5ff1de83ab89de955fe1ef359b5bdadcde0931122e77733/analysis/1526535683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wrath%20of%20Nature%20-%20The%20Path%20of%20the%20Druid-91331-3-2.zip?fid=1000273189&ttl=1535881860&ri=8192&rs=8192&setec=00f3a9fc09a74005c988574359a1d942"
    },
    {
      "fileId": "1000273192",
      "name": "Wrath of Nature - The Path of the Druid 3.2",
      "version": "3.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "Wrath of Nature - The Path of the Druid 3.2-91331-3-2.zip",
      "uploadedUnix": "1526538429",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/e5a76bb9d45bcec1f0f78d04f03c8fd2fa15938a939ebf20fb6df2307148a360/analysis/1526538602/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wrath%20of%20Nature%20-%20The%20Path%20of%20the%20Druid%203.2-91331-3-2.zip?fid=1000273192&ttl=1535881860&ri=8192&rs=8192&setec=c91ce3d4fbfa6ef81a48b676d1e139cf"
    }
  ]
}