{
  "modId": 91339.0,
  "modName": "Succubus Race Deutsch 1.6",
  "summary": "Dies ist die deutsche Übersetzung der Mod \"Succubus Race\"",
  "descriptionHtml": "[b][color=#b6d7a8][size=6]Sukkubus Rasse[/size][/color]\n<br />\n<br />[color=#ffe599][size=5]Infos:[/size][/color][/b]\n<br />\n<br />Das ist die deutsche Version von \"[url=https://www.nexusmods.com/skyrim/mods/22903]Succubus Race[/url]\"\n<br />Wenn euch dieser Mod gefällt gebt bitte \"[url=https://www.nexusmods.com/skyrim/users/114260]saxo74[/url]\" ein Endorse :)\n<br />\n<br />Die Bilder stammen alle vom originalen Modauthor\n<br />\n<br />[img]https://i.imgur.com/t7tRZTE.png[/img]\n<br />\n<br />[size=4]Ein Überbleibsel der Vergangenheit ...\n<br />[/size]\n<br />In der Vergangenheit als Daedra Verführerrin, Dunkle Verführerrin oder Mazken bekannt. \n<br />Ihr Aussehen entspricht ihrem Namen: schöne junge Frauen, nackt oder nur fast. \n<br />Manche haben Flügel auf dem Rücken, und sie können sich nach Belieben verwandeln. \n<br />Sie beschreiben sich selbst als \"Daedra\" ohne einen Herrn, so dass sie nach Belieben die Loyalität wechseln können. \n<br />Die Mazkens dienen vielen der Daedrischen Prinzen, einschließlich Azura, Mehrunes Dagon, Meridia, Nocturne, Sanghin und Sheogorath, indem sie als private Soldaten, Boten oder sogar allgemeiner als Wachen oder sogar Geliebte dienten.\n<br />\n<br />Während des Angriffs der Kampfspitze hielt Imago Storm sie für impulsiv und undiszipliniert und war gegen ihre Integration der Mazkens in die Reihen der Legionen von Mehrunes Dagon, einschließlich der Beförderung von Faydra Shardai im Rang eines Generals von Dagon.\n<br />\n<br />Obwohl \"moderne\" Masken während der Ereignisse von Oblivion vor 200 Jahren gesehen wurden, sind diese \"Sukkubus\" Teil der einheimischen Rasse von Faydra Shardai, erkennbar an ihren Flügeln. Aber niemand weiß, wie sie in Himmelsrand angekommen sind ...\n<br />\n<br />                                                                                               [img]http://images.uesp.net/6/6b/DaggerfallDaedraSeducer.gif[/img]\n<br />[color=#dd7e6b][size=6][b]Sukkubus Rassen Eigenschaften\n<br />[/b][/size][/color]\n<br />Möchten Sie eine neue Erfahrung ausprobieren? Willst du mit einem sexy dunklen Charakter spielen? Du hast eine ausgezeichnete Wahl getroffen! Die Sukkubus Rasse erfordert eine radikale Veränderung der Spielweise, um neue Gefühle zu erzeugen.\n<br />\n<br />\n<br />- Völlig einstelbare Rasse durch das  MCM Menu.\n<br />- 8 verschiedene Arten von Flügeln und 5 Arten von Hörnern. (Manche Flügel sind animiert)\n<br />- Funktioniert perfekt mit dem Dawnguard und Dragonborn DLC.\n<br />- Kein Skript Fehler, wenn Sie eine andere benutzerdefinierte Rasse verwenden.\n<br />- Ein einzigartiges Beispiel für die Nutzer der GD und keine Nutzer der GD.\n<br />- 16 neue Kriegsbelaungen für Sukkubus Charactere.\n<br />- 36 Neue Augen Texturen und einige haben einen leuchtenden Effekt.\n<br />- Fünf neue Kräfte, um deine Feinde zu besiegen.\n<br />- Neue Rüstung speziell für Sukkubi (CBBE nur für jetzt)\n<br />- Body und Meshes vom Standardspiel. Sie können mit anderen Mods anpassen, um ein benutzerfreundliches Setup (im Moment) zu haben\n<br />- Völlig eigenständige Body Meshes und Texturen für kein Risiko, die Ihre Dateien zu überschreiben.\n<br />- Völlig neue Zauber und Kräfte, die in Himmelsrand einzigartig sind!\n<br />- Völlig neue magische Effekte, Skripte, Texturen und Sounds.\n<br />- Völlig vertonte Zaubersprüche.\n<br />\n<br />Bist du bereit, ein neues Sukkubus Leben zu beginnen? ...\n<br />\n<br />[color=#dd7e6b][size=6][b]Sukkubus und Vampiere[/b][/size][/color]\n<br />\n<br />Die Sukkubus Rasse funktioniert perfekt mit Dawnguard. Keine erforderliche Datei wird benötigt. Nur eine Datei, auch wenn Sie Dawnguard nicht haben. Um ein Vampir zu werden, musst du von einem anderen Vampir infiziert sein oder die Hauptaufgabe von Dawnguard erfüllen und die Vampirfraktion wählen. Wenn du ein Vampir bist, verlierst du den Sukkubus Abfluss, stattdessen kannst du den normalen Vampir Abfluss Zauber verwenden.\n<br />\n<br />Es ist kompatibel mit [url=https://www.nexusmods.com/skyrim/mods/9717]Better Vampires Mod von Brehanin[/url]. Es verbessert das Gameplay, wenn du deinen Sukkubus Charakter als Vampir spielst.\n<br />Danke an Himika und seine großartige [url=https://www.nexusmods.com/skyrim/mods/24168/]RaceCompatibility Racial Compatibility - Kompatibilität[/url] mit anderen Mods wurde verbessert. Succubi kann jetzt zu Vampiren ohne Kompatibilitätsprobleme werden und Dateien überschreiben.Wenn du dein Rasse während deines Spiels änderst, öffne die Konsole und schreibe \"player.setrace SuccubusRaceVampire\" und du wirst ein \"kompetter\" \"Vampir.\n<br />\n<br />[color=#dd7e6b][size=6][b]MCM Menu[/b][/size][/color]\n<br />\n<br />[img]https://i.imgur.com/zng2BTWl.jpg[/img][img]https://i.imgur.com/05FaRS6l.jpg[/img]\n<br />\n<br />\n<br />Mit dem MCM-Menü können Sie Ihren Sukkubus anpassen, indem Sie den Hörner- und Flügelstil wählen. 4 Stile der animierten Flügel sind und 3 Statik Flügel sind verfügbar. Sie können zwischen 5 Arten von Hörnern wählen oder beschließen, keine Hörner zu haben.\n<br />\n<br />Wenn du die Sukkubus-Aggression deaktivierst, wirst du nicht mehr angegriffen, wenn du in Sukkubus umgewandelt wirst (standardmäßig aktiviert)\n<br />\n<br />Wählen Sie die Regenerationsrate, wenn Sie in der Sukkubus Form sind.\n<br />\n<br />Schau dir Flügel und Hörner Stile an, um eine Vorschau auf das Aussehen zu erhalten.\n<br />\n<br />[color=#dd7e6b][size=6][b]Kräfte und Fähigkeiten[/b][/size][/color]\n<br />\n<br />Base Statistiken:\n<br />\n<br />+10 Heimlichkeit - [color=#cccccc]Wegen ihrer echten Natur müssen Sukkubus diskret sein.[/color]\n<br />+5 Sprache - [color=#cccccc]Verführung funktioniert besser mit den gut gewählten Wörtern[/color]\n<br />+5 Einhandwaffe -  [color=#cccccc]Sukkubus lieben Körperkontakt! !![/color]\n<br />+5 Leichte Rüstung -  [color=#cccccc]Überkleide ihren Körper nicht !![/color]\n<br />+5 Alchemie -  [color=#cccccc]Brauen sie ihren Liebestrank !![/color][color=#dd7e6b][size=4][b]\n<br />\n<br />[/b][/size][/color][img]https://i.imgur.com/6gs4r2Y.png[/img]\n<br />Sukkubus Form: \n<br />Benutze diesen Spruch, um deine wahre Natur zu offenbaren und deine Sukkubus Kräfte zu nutzen. \n<br />Sie können auch zu Ihrer Menschen Form zurückkehren. \n<br />Die Sukkubus Form gibt eine echte dämonische Erscheinung mit Flügeln, Schwanz und Hörnern. \n<br />Deshalb werden alle NPCs dich angreifen, wenn sie dich in dieser Form sehen. \n<br />Wenn du als Sukkubus erkannt wirst, renne / verstecke dich und komme wieder unter menschliche Form. \n<br />Es ist nicht nur ästhetisch. \n<br />in dieser Form kannst du durch deine Flügel höher springen und ein paar Sekunden schweben.\n<br />Du kannst diesen Zauber unbegrenzt oft benutzen. \n<br />Die Sukkubus Form erhöht deinen unbewaffneten Schaden bis zu 15 Punkte und erhöht drastisch Ihre Gesundheit, Magika und Ausdauer Regeneration.\n<br />\n<br />[img]https://i.imgur.com/CfbmG6k.png[/img]\n<br />Ablassen: \n<br />Die Sukkubus kann den Abflusszauber benutzen, um ihr Leben wiederherzustellen und Schaden zuzufügen. \n<br />Dies ist der hauptzauber für eine Sukkubus. \n<br />[color=#ea9999]ACHTUNG, dieser Zauberspruch gibt dir keine Erfahrung in der Zerstörungsfähigkeit.[/color][color=#ea9999]\n<br />[/color]\n<br />[img]https://i.imgur.com/sfc7ya4.png[/img]\n<br />Verführung: \n<br />Dieser Zauber verwandelt jeden NPC in eine Puppe, die du für kurze Zeit kontrollieren kannst. \n<br />Funktioniert nicht bei Begleitern. Ein Wächter, der eine verschlossene Tür blockiert? Kein Problem, bitten Sie ihn, es für Sie zu öffnen. \n<br />Ein nerviger Zeuge beobachtet dich? Bitten Sie sie zu warten. Das ist eine starke Macht, aber Ihr Ziele können nichts gegen ihre Fraktion tun. \n<br />Wenn Sie Ihre Marionette bitten, ein Mitglied ihrer Fraktion anzugreifen, bricht der Zauber ab und die beiden Charaktere greifen Sie an. \n<br />Wenn du mit einem verzauberten NPC sprichst, löst sich der Zauberspruch auf. \n<br />Es ist ein Kontaktspruch, das bedeutet, dass du dein Ziel berühren musst, um den Zauber zu verwenden. \n<br />Dieser Zauber ist nur einmal am Tag verfügbar.\n<br />\n<br />[img]https://i.imgur.com/Tc9lcB9.png[/img]\n<br />Sukkubus Vision:\n<br />Sie können Menschen in sehr großer Entfernung erkennen. Verfügbar auch in menschlicher Form.\n<br />Benutze den Zauber, wenn du den Kontakt mit dem Menschen vermeiden willst, wenn du transformiert bist oder nur um dein Ziel zu überraschen willst.\n<br />\n<br />[color=#ffe599][size=5][b]Installation:[/b]\n<br />[/size][/color]\n<br />Für diese Mod wird die originale Datei Benötigt und muss überschrieben werden.\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/91339/91339-1526338137-19063017.png[/img]\n<br />\n<br />[color=#e06666][size=6][b]Empfohlene Mods:[/b][/size][/color]\n<br />\n<br />Das Spielen mit einem Sukkubus ist eine wirklich aufregende Erfahrung, zumindest für mich. Einige Mods passen perfekt zu der Sukkubus Rasse als sexy Outfits oder grandiose Waffen ...\n<br />Dies sind einige Ideen, die Sie ergreifen können, um Ihre eigenen Erfahrungen mit Succubi zu verbessern.\n<br />\n<br />- [url=http://www.nexusmods.com/skyrim/mods/37302]Lady Lucretia - A Succubus Follower [/url]Weil zwei Succubi besser sind !! von Zaarok\n<br />- [url=http://www.nexusmods.com/skyrim/mods/22368]Liliths Sickle [/url][i]Der beste Freund von Succubi![/i]\n<br />- [url=http://www.nexusmods.com/skyrim/mods/25389]Sweet and Sexy Lingerie shop CBBE [/url]by Nikitaa\n<br />- [url=http://www.nexusmods.com/skyrim/mods/13067]Dark Lilith Sexy Succubus Armor CBBE NKT [/url]by Nikitaa\n<br />- [url=http://www.nexusmods.com/skyrim/mods/11764]Push-up sexy bikinis CBBE v3 CBBE NKT [/url]by Nikitaa\n<br />- [url=http://www.nexusmods.com/skyrim/mods/10168]Apachii Sky Hair[/url] By Apachii\n<br />- [url=http://www.nexusmods.com/skyrim/mods/17174]Pinup Poser[/url] by Halofarm\n<br />- [url=http://www.nexusmods.com/skyrim/mods/11447]Feminine Running and New Dash Animation [/url]by xp32\n<br />- [url=http://www.nexusmods.com/skyrim/mods/13722]The Eyes of Beauty[/url] by Gabriel Mailhot\n<br />-  Haar und Augen mods\n<br />\n<br />[b][u][size=6][url=https://www.nexusmods.com/skyrim/mods/91097/]Andere Übersetzungen von mir[/url]﻿[/size]\n<br />[/u][/b]\n<br />[b]-&lt;(Start der Übersetzung´s Serie 25.04.2018)&gt;-[/b]",
  "categoryId": "34",
  "version": "1.6",
  "author": "Teraneck",
  "createdUnix": "1526338392",
  "updatedUnix": "1526338392",
  "containsAdultContent": false,
  "uploadedBy": "Teraneck",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273013",
      "name": "Succubus Race Deutsch 1.6",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Succubus Race Deutsch 1.6-91339-1-6.zip",
      "uploadedUnix": "1526338347",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/a62c02fd431d62ead4361d181e75cf16b187f3319d6a465649e0d6387cafad77/analysis/1526338443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Succubus%20Race%20Deutsch%201.6-91339-1-6.zip?fid=1000273013&ttl=1535881870&ri=8192&rs=8192&setec=1c78cda0793f3d6eaaa09850e13d9f3f"
    }
  ]
}