{
  "modId": 9135.0,
  "modName": "Nerf and Balance for Adept",
  "summary": "Balances the game around Adepts allowing for popper difficulty scaling.",
  "descriptionHtml": "[b]AS A SAFETY PRECAUTION ALWAYS UNEQUIP ALL WEAPONS AND ARMOR WHEN INSTALLING/UNINSTALLING A GAME-PLAY CHANGING MOD.[/b]\r\n\r\n[b]Nerf and Balance for Adept 1.6:[/b]\r\n\r\nDifficulty Scaling improved. Have a greater challenge with Expert and Master without affecting the core balance of the weapons/armor and magic. Increasing the difficulty means higher level enemies and more exp (as a reward). \r\nArtificially Multiplying Weapon Damage to NPC and players is worse thing you can do to make the game harder since it totally screws up any possible balance the game might of had.\r\n\r\n[u]Crafting[/u], fully integrated  and based on \\\"Aleks Skyrim Balanced Experience\\\" fixes a lot of alchemy and enchanting exploits. You can now abuse them as much as you want without feeling guilty. \r\n\r\n[u]Smithing[/u], how much you can improve weapons and armor drastically reduced so their useful and not OP for difficulties like Adept. No more easily bypassing the maximum armor rating with ease, armor will scale with you for the rest of the game into the high levels and you won\\'t be able to bypass the maximum armor rating. No need to nerf yourself anymore, every bit of armor counts now.\r\nYou can still grind to get high tier armor, but you won\\'t be able to improve them to their full potential without the required Light Armor and Heavy Armor perks. You\\'ll get a better armor rating by wearing armor appropriate to your level. Same goes for weapons.\r\n\r\n[u]Magic[/u], fully integrated  and based on \\\"Aleks Skyrim Balanced Experience\\\" with a few additions. Novice spells will now scale 3x instead of 4x, magicka regen in combat increased to 1.5% instead of 1%. All spells now scale way better into late-game. \r\nRunes and Rune Master Perk fixed and re-adjusted (shock/frost/fire perks now affects their damage). Introduced delayed Runes and allowed the player to cast Runes near enemies to compliment sneaking. You can now properly set up traps and lure enemies to their death in interesting ways. \r\n\r\n[u]Sneaking[/u], Move in darkness out of sight, and away from the light. Sneaking is now based on the binocular vision of enemies, with light and enemy distance playing a much greater role. No more hiding right in front of an enemy in a well lit area. \r\nShrouded Gloves Addition: \\\"Plus 1x to the current Marksman sneak attack\\\".\r\n\r\n[b]Version 1.6 Change:[/b]\r\nOverhauled Smithing, again...\r\nIt\\'s now much simpler to understand and really makes sense, the effects of tempering is also now much more apparent, if you have the rank requirement you can double improve an weapon/armor. \r\nAn double improved Gilded elven armor will equal and even surpass a normal tempered Glass armor.\r\nThink this variation of the Smithing perk tree will be the final one.\r\n\r\n*Fixed the normal lightning Rune being a delayed one.\r\n\r\n\r\n[b]Version 1.5 Change:[/b]\r\n\r\nGuess I wasn\\'t done with Smithing. Problem is what if you didn\\'t want to play with light or heavy armor, how would you improve your weapons then? That\\'s why I separated the bonuses for light,heavy and weapon tempering.\r\nI also detailed Advanced armors, so you know exactly what you getting:\r\n\r\n\\\"Can create Advanced equipment at forges. Improve armor up to 20% more, 40% with Light Armor perk: Agile Defender III. Improve weapons up to 50% more with Rank III: Armsman, Barbarian or Overdraw. (Armor; Scaled, Gilded, Plate. Weapon; Honed Draughr/Falmer)\\\"\r\n\r\nAll you need to get a 50% improve weapons bonus is to have a the required rank in any one of your Archery/Two Handed/One Handed trees. \r\nI also made it possible to buy the daedric smithing perk if you have dragon smithing coming in from the light armor side.\r\n\r\n[b]Version 1.4 Changes:[/b]\r\n\r\n*There are now normal and delayed versions of Runes:\r\nThe new delayed versions of Fire, Frost, Shock can be found at Vendors that sell destruction magic tomes like the court wizard of Whiterun and the mage in the College of Winterhold.\r\n\r\nNormal Rune example: \r\nCast on a nearby surface, it explodes for <mag> points of fire damage over 2 seconds when enemies come near. When triggered, your exact location at the time will become known to the enemy due to the connection between Caster and Rune being abruptly broken.\r\n\r\nDelayed Rune example:\r\nCast on a nearby surface, explodes after 3 and a  half seconds. <mag> points of fire damage over 2 seconds to nearby enemies. Connection between Caster and Rune is broken early to keep their exact location hidden, when the unstable Rune explodes.\r\n\r\n[b]Version 1.3 Changes:[/b]\r\n\r\n*fixed disappearing Frost Rune for real this time.\r\n\r\nReviewed and revised the Smithing:\r\n\r\n*Added item material list to every condition I added \r\n\r\n*Fixed some logic errors for Elven Smithing so that the bonuses now apply at Rank II as intended.\r\n\r\n*Changed Glass and Dragon Smithing so going Glass at rank IV before Dragon Armor is now much more viable instead of going straight to Dragon Armor which kinda defeated the whole point.\r\nGlass is now 20%/60% for rank 1-3/4-5.\r\nDragon is 0%/60% for rank 1-4/5 \r\n\r\n*fsmithingconditionfactor changed from 0.5000 back to Vanilla 0.5825\r\n\r\nSome ArmorPerks values re-adjusted\r\n*AgileDefender and JuggerNaught is now 15/30/45/60/75 instead of 20/40/60/80/100\r\n*Matching sets now actually gives 25% bonus armor (vanilla was at 20%, not 25% as description says).\r\n\r\n[b]Version 1.2 Changes:[/b]\r\nFixed frost Rune from disappearing.\r\n\r\n\r\n\r\n[b]Warning[/b]\r\nContains a modded Headbomb\\'s \\\"Smithing Perks overhaul\\\" file. Only use one!\r\nThe fixes are included in case you want to use any of his other mods with this which I actually HIGHLY recommend you do.\r\n\r\nRecommended Mods to use with this:\r\n*Realistic Lighting\r\n*Weapons and armor fixes.\r\n\r\n[b]Credits:[/b]\r\nhideinlight(me)\r\nAlek (Skyrim Balanced Experience)\r\nHeadbomb (Smithing Perks overhaul)\r\n\r\n",
  "categoryId": "79",
  "version": "1.6",
  "author": "HideInLight",
  "createdUnix": "1329039450",
  "updatedUnix": "1330211454",
  "containsAdultContent": false,
  "uploadedBy": "HideInLight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "36813",
      "name": "Nerf and Balance for Adept 1dot6",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "Nerf and Balance for Adept 1dot6-9135-1-6.zip",
      "uploadedUnix": "1330211454",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/4c5f1b5b82133daf8af13000033d711f2ca00202d3229a66682b6249d5d9aa21/analysis/1406713129/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nerf%20and%20Balance%20for%20Adept%201dot6-9135-1-6.zip?fid=36813&ttl=1535768412&ri=8192&rs=8192&setec=2b4bf6306737d33accf2cc486da8dfea"
    }
  ]
}