{
  "modId": 91368.0,
  "modName": "Enemy normalizer",
  "summary": "Have you ever yawned through a dungeon, killing everything in one blow and not taking as much as a scratch despite not even trying to avoid hits, only to be oneshot by some random \"boss\" draugr? Well, I certainly have, and in my opinion this is the biggest problem of skyrim and this mod aims to fix it!",
  "descriptionHtml": "Have you ever yawned through a dungeon, killing everything in one blow and not taking as much as a scratch despite not even trying to avoid hits, only to be oneshot by some random \"boss\" draugr at the end? Well, I certainly have, and in my opinion this is the biggest problem of skyrim and this mod aims to fix it!\n<br />\n<br />Now don't get me wrong, there has been a lot of mods trying to fix so called \"easiness\" of skyrim, but all of them are only making problem worse - to accommodate they way you've made your character an unstoppable machine of death with all the armor and enchantments they just ramp up the difference between enemies even higher then it already is, and it is already absurd! Basic draugr has 50 hp, while the toughest ones clock up to 1400, 28 TIMES more hp! And the damage to follow!\n<br />\n<br />It's an arms race into a deadend, where in order to be on par with the toughest challenges game has to offer, you have to render the rest 90% of it obsolete with your own hands.\n<br />\n<br />And here's my solution - how about we bring the difference between toughest and weakest enemies to a reasonable point as well as nerf player in their ability to become overpowered without even realizing that as to even basic bandits are still a force to be considered in the endgame if they are attacking you in small groups.\n<br />\n<br />IMPORTANT!: This is a proof of concept mod, while I have a strong vision for what this mod should be and a passion to follow through with the stupid amount of clicking, I'm not very versed in modmaking and programming in general, so expect missed enemies, game mechanics and a general mess of backwards ways used to achieve my goals. This mod has been in development for a long time (mostly due to testing), but now due to existence of massive projects like Beyond Skyrim I absolutely have to make it universal, so I need help in implementing my ideas into a script form.\n<br />\n<br />ALSO IMPORTANT: I highly recommend playing it with [url=https://www.nexusmods.com/skyrim/mods/56980?tab=description]VioLens[/url] mod, it allows a fairly indepth customization of killcam animations, including disabling them against player character, so it will spare you the frustration of tough enemies killing you from full health in cutscenes over and over without even getting close to you or taking a swing.\n<br />\n<br />With that in mind, here's what this mod does:\n<br />\n<br />ENEMY CHANGES:\n<br />\n<br />- due to the limitations in my modding knowledge and the way enemies cap their skills at 100 half way through the progression if I try to raise the floor instead, I had to balance it around the Legendary difficulty setting, so the first thing to do would be changing damage values to make Adept be the new Legendary and balance the rest of the difficulty settings accordingly. However I'm stupidly experienced in skyrim combat system (and yes there is one, and it's pretty good, give it a try, I know original balance of the game gave absolutely no reason to) so it may be a bit tough for some.\n<br />\n<br />- divides the level of every npc by 3 (this way the absolute difference between enemies becomes smaller, and it's an easy way to do the math and keep changes consistent and easy to implement in a script)\n<br />\n<br />- in case of dynamically scaling enemies it divides both their scaling rate, and level limits by 3\n<br />\n<br />- divides bonuses to hp, stamina and mana npcs get by 6. However this logic is only working with enemies that have reasonable base hp levels around 50 to 150, so for enemies that have insanely large values by default I had to manually assign negative health bonuses to keep them consistent. One way to work around it in a script would be treating every enemy as if they have the base hp of 100, calculating the fake bonus hp like that, then dividing it 6 and assigning the real health offset (be it negative or positive) to bring the resulting hp to that estimated level.\n<br />\n<br />- changes the unarmed damage for all the races according to equation (because apparently a lot of enemies ignore stats entirely and do damage according only to this value):\n<br />\n<br />[code]﻿[NEW DAMAGE] = ( [ORIGINAL DAMAGE] - 5 ) ^ 0,63 ) * 2,5 + 5\n<br />[/code]\n<br /> This curve is purely empirical, and was fitted to on a graph to approximate half damage at the high levels, but get there gradually, otherwise basic enemies like wolves and skivers would stop doing any damage all together. In order to add a setting to the script the power (0,63) is the most important value to play with.\n<br />\n<br />PLAYER CHANGES (now, I'm a bit hazy on that one cause this part was made like a year ago, and been working fine ever since, if you want to make a script for that, you can look up the specifics in my file better then I ever could anyway P: )\n<br />\n<br />- Nerfs smiting and enchanting to 10% of their power - they are grindy and not natural ways of gaining power and are the main source of power creep on the player side. Appropriate way to balance it would be making those skills progress 10 times faster, but give only 10% of the player level xp in the process\n<br />\n<br />- Reduces the effectiveness of armor points in blocking damage by the factor I don't remember, I'll just paste game settings here, no clue what old one was at this point P: [code]﻿fArmorScalingFactor = 0.0300\n<br />\n<br />[/code]- Reduces defense cap to 30% (really? that low?) ﻿[code]fMaxArmorRating = 30.0000[/code]\n<br />\n<br />Well, anyway those two ensure that you can never get passively safe against physical attacks, which comes in handy since every enemy is now dealing much less damage, and that you don't reach new armor cap with like dwemer armor and armor skill of 40, it's still useful, just gradually so 9but I didn't do the math, only playtesting P:)\n<br />\n<br />NOTES:\n<br />\n<br />- I didn't change any magic school, they just kind of fixed themselves! Destruction is now useful for obvious reasons - enemies aren't nearly as tanky, so they die in a reasonable amount of fireballs; illusion is now useful cause everybody's level got dropped. And you can't enchant yourself 0% mana use gear, so no more mages in daedric armor with 1000 hp and 100 mana - you have to invest in it! As for enemies - the nerf to mana bonus made it so that mages can't just spam fireballs forever, they'll run out of it eventually, so combat is much more engaging and tactical. I'll advise you to disable any magic buffing mods you have.\n<br />\n<br />- I didn't do anything with alchemy, and I don't even know how to change the strength of your potions (to 10%). I'd also add a cooldown on potion use if I was any good at moding - a debuff that prevents you from using them that lasts like 30 seconds. But yeah, I just don't use potions in my games, they are broken P:\n<br />\n<br />- Enemies that heal themselves (like trolls and vampires) are much more tricky now cause their health regen is much higher now proportionally to their new hp levels and your damage, but I kind of like it at this point - you need to be smart about fighting them.\n<br />\n<br />- I didn't change the level of enchantments that you can find in the world (mostly due to the fact that I don't know how to), but it gave those items a whole new value - now that you can't just make op magic items of your own the loot you find is now actually valuable and exciting! It may however need changing due to balancing reasons, but I find it that with this change in difficulty curve to be more even, it is much easier to exercise self-restraint and balance your own strength ingame.\n<br />\n<br />- I think that the ability to block like 30% of magic with your shield should be added as a default effect, with the perk rising it to like 60%\n<br />\n<br />- Blocking may need to be made more effective throughout as active defense should be prioritized over the passive one. \n<br />\n<br />- Skyrim skill progression pace is awful, but with the change in gameplay it becomes even more of a mess with you unable to withstand hundreds of hits in each combat required to keep your armor skills on pace with everything else, enemies dying in a too little spells to keep your destruction progressing at  reasonable pace and so on. I use Community Uncapper to fix those isssues, here are my settings:\n<br />\n<br />[code]fAlchemy=1.0\n<br />fAlteration=1.0\n<br />fArchery=1.0\n<br />fBlock=1.0\n<br />fConjuration=1.0\n<br />fDestruction=4.0\n<br />fEnchanting=10.0\n<br />fHeavyArmor=2.0\n<br />fIllusion=1.0\n<br />fLightArmor=2.0\n<br />fLockpicking=1.0\n<br />fOneHanded=0.4\n<br />fPickpocket=1.0\n<br />fRestoration=1.0\n<br />fSmithing=10.0\n<br />fSneak=1.0\n<br />fSpeech=1.0\n<br />fTwoHanded=0.4\n<br />\n<br />[/code]But it would be nice to make those changes inherent to the mod itself. Also I am in the middle of 10% xp playthrough right now, and while it is slow, I can definitely recommend that! Give your character a sens of prmanency, you don't just cap out on skills in 8 hours.\n<br />\n<br />- Oh, and this mod now has an addon for Beyond Skyrim: Bruma! Though not tested at all, and frankly it is the reason I post this mod in such a raw state, I have to make it universal and automatic, I can't just keep on making patches, especially if mod makers change enemy id's, or general balance between updates.\n<br />\n<br />- Also base mod comes in two parts - Enemy normalizer and Player nerfer because I kept them separate for developement reasons and now too lazy to merge them together into one file P:\n<br />\n<br />- Also also it requires all DLC. Probably. I mean it balances enemies in all dlc, but I never tried to run it without them.",
  "categoryId": "84",
  "version": "0.1",
  "author": "R417",
  "createdUnix": "1526481214",
  "updatedUnix": "1526481214",
  "containsAdultContent": false,
  "uploadedBy": "R417",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273141",
      "name": "Enemy normalizer - core",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "449",
      "fileName": "Enemy normalizer - core-91368-0-1.zip",
      "uploadedUnix": "1526471477",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/7e012332e360694632bc39c965b8423358bab1c83fc77739d0799e3fb636e4cf/analysis/1526471644/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enemy%20normalizer%20-%20core-91368-0-1.zip?fid=1000273141&ttl=1535881909&ri=8192&rs=8192&setec=b72c717deed02ae7c89b0734ad8e353d"
    },
    {
      "fileId": "1000273142",
      "name": "Beyond Skyrim Bruma compatibility patch",
      "version": "0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "124",
      "fileName": "Beyond Skyrim Bruma compatibility patch-91368-0-1.zip",
      "uploadedUnix": "1526471648",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/4156a435ef2008b13e5f288a6f73de888b6db44fbbb1cf30151c7b0595a85d3c/analysis/1526471823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beyond%20Skyrim%20Bruma%20compatibility%20patch-91368-0-1.zip?fid=1000273142&ttl=1535881909&ri=8192&rs=8192&setec=59be571c89bab0a66504e07803dbf3db"
    }
  ]
}