{
  "modId": 91370.0,
  "modName": "The Flamebringer",
  "summary": "The Flamebringer is an levelable and lorefriendly, spellcasting onehandsword. With Flamebringer you get an immersive Spellsword gameplay. Through Power- and Bash-attacks you are able to cast 10 (more or less)unique spells with firecolored-bloodskaal-visuals. There 8 levelsteps to reach.",
  "descriptionHtml": "[center][img]https://staticdelivery.nexusmods.com/mods/110/images/91370/91370-1526482240-1768332979.png[/img]﻿[/center]\n<br />The Flamebringer is an anciant sword sealed in a Rock awaiting a worthy owner, who is breaking the seal and own its anciant power. Just like excalibur but not just a tale for little nord-childs.\n<br />\n<br />Just mouthtelled tales are known about the Flamebringer. That ancient evil firespirit created through Alduins first Firebreath. The Flamebringer was terrorizing Nirn for centuries and threatened to devour the entire world in his flames.\n<br />\n<br />Wherever the Flamebringer appears on Nirn, fire and death are the results. Until one day, a hero appeared: He was a Nord - but his name is long forgotten. A master of toungues; a Dragonborn. He slayed the beast but was not able to kill it, so he forced that evil ghost into his Bones and stabbed his blade through his skull into a rock.\n<br />\n<br />That specific blade is used as seal and prison for the might and power of the Flamebringer and inhabits its evil Ghost. Tales tells: One day a worthy Hero will appear, he will pull the blade out of the rock, dominate the Flamebringer and claim the might for himself to save Nirn from a far more dangerous evil. But until now no one was able to claim the sword.\n<br />\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/91370/91370-1526482229-1669329039.png[/img]\n<br />[list]\n<br />[*]Detailed retexture of the Nordic Sword as new standolone weapon.\n<br />[*]8 Levelsteps to reach for 5 dragonsouls each step.\n<br />[*]with every Levelstep the sword-basedamage will rise between 8 and 16 basedamage.\n<br />[*]fully upgradeable and enchantable.(yes, also enchantable.)\n<br />[*]with every Levelstep you explore one more Flamebringer-Swordspell\n<br />[*]8 less or more unique new spells castable through power- and blockbash-attacks with color and formfitting visuals.\n<br />[*]A handplaced altar of the Flamebringer to levelup your Sword and check the current level (the current level is the amount of fireball-seals around the altar)\n<br />[*]Textinformation by Swordlevelup about your new Spell.\n<br />[*]complete in english and in german.\n<br />[*]through magicka and stamina cost's, cooldowns and learncosts balanced gameplay without motionless combatphases. (if you have not enaugh magicka  or youre in cooldown you cast a weaker spell instead.)\n<br />[*]no useless cooldowns. While you have a cooldown, most spells left a buff on you for a couple of seconds.\n<br />[*]High compatibility. No Basegame scripts or forms are touched.\n<br />[*]Lorefrindly integration if you accept a new storyark in the past of Nirn.\n<br />[*]Probably some spelling and grammatical mistakes\n<br />[*]A complete different mod as i have planned as i started. xD\n<br />[*]Probably some other features that i forgot about in the last 3 weeks.\n<br />[/list]\n<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/91370/91370-1526482252-2028441857.png[/img]\n<br />You can find the altar of the Flamebringer the upleading path from Kynesgrove, crossing the mine, rightleading. The shortest way is \"coc Kynesgrove\".\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/91370/91370-1526482252-683673394.png[/img]\n<br />[[color=#d8d8d8]Horizontal Slice[/color] |[color=#d8d8d8]Vertical Slice[/color]]\n<br />The two Spells are pretty much the same and are the basefunctions of the Flamebringer. There do not cost any magicka but you have to pay the stamina-price to do a powerattack.\n<br />Casting art: standing, forward, forward-sprint and backleading powerattacks cast's the vertical slice, left and right leading cast the horizontal slice. On higher Swordlevel you will cast Horizontal- or Vertical Slice in cooldownphases or if you have not enaugh magicka for the higher Spell.\n<br />Damage:   25 Points of Firedamage for each target (slice through targets and can hit more than one in the same time)\n<br />Cooldown: None.\n<br />Special Effect: None.\n<br />-\n<br />[[color=#cccccc]Flametower[/color]]\n<br />Not much different as vertical slice but deals twice as much damage than vertical Slice you have to pay the stamina-price and additional 10 points of Magicka to cast. If you have not enaugh magicka you will cast vertical slice instead.\n<br />Casting art: Standing power-attack.\n<br />Damage: 50 Points of Firedamage for each target (slice through targets and can hit more than one in the same time)\n<br />Cooldown: None\n<br />Special Effect: Sets targets on fire.\n<br />-\n<br />[[color=#d8d8d8]Flamespeer[/color]]\n<br />Flamespeer move faster than Flametower and Vertical Slice and reach further. It left a burning path behind it that set's crossing targets on fire. You have to pay the stamina-price and 15 additional points of magicka. Flamespeer has a cooldown of 5 Seconds. While youre in cooldown you will cast vertical Slice instead and your own fireresistance rise by 10%.\n<br />Casting art: Forward power-attack.\n<br />Damage: 75 Points of Firedamage for each target (slice through targets and can hit more than one in the same time)\n<br />Cooldown: 5 Seconds; rise fireresistance by 10%\n<br />Special Effect: left a famepath behind, that sets targets on fire.\n<br />-\n<br />[[color=#d8d8d8]Firebird[/color]]\n<br />Firebird is moving faster, reach further and deal more Damage even as Flamespeer. The Firepath, that is left by Firebird remembers to a pair of burning wings. You have to pay the stamina price and additional 25 points of magicka. Firebird has a cooldone of 10 seconds, while youre in cooldown you cast vertical Slice instead and your destruction magic rises by 15 points. \n<br />Casting art: Forward sprint-Powerattack\n<br />Damage: 100 points of Firedamage\n<br />Cooldown: 10 Seconds; rise destruction magic by 15 points\n<br />Special Effect: Explode on contact with the first valid target. The explosion can knockback other targets.\n<br />-\n<br />[[color=#d8d8d8]Flamebreak[/color]]\n<br />Flamebreak is able to break the light around you, so you turn invisible for 60 seconds. While you are invisible your other Flamebringer-abillities wont break your invisibility. You have to pay the stamina price and additional 25 points of magicka. The cooldown lasts so long, you're invisible.\n<br />Casting art: Blockbash while Sneaking.\n<br />Damage: - \n<br />Cooldown: So long you're invisible.\n<br />Special Effect: Flamebringer abilities wont break your invisibility.\n<br />-\n<br />[[color=#d8d8d8]Burning Scythe[/color]]\n<br />Deals the most direct damage of all Flamebringer-Spells. Not on one hit but over the next two seconds. Like much of the other Flamebringer-spells Burning Scythe can hit more than one target in the same Time. You have to pay the stamina-price and additional 30 points of magicka. Burning Scythe has a cooldown of 5 Seconds, while the cooldown is active you're immune to all poisons. If youre in cooldown or have not enaugh magicka to cast you will cast horizontal slice instead.\n<br />Casting art: Rightleading powerattack\n<br />Damage: 130 Points of Firedamage over 2 Seconds.\n<br />Cooldown: 5 Seconds; Immune to all Poisons.\n<br />Special Effect: Deals the Damage over 2 Seconds, 65dmg each hit.\n<br />-\n<br />[[color=#d8d8d8]Fire of Unlife[/color]]\n<br />Deals a low amount of Firedamage, but that is not the special of Fire of Unlife. Is Fire of unlife hitting a dead body, it will raise to a new life on your side for 60 seconds. You are able to rise up to 101 undead if enaugh dead bodys around you. Fire of Unlife has no cooldown, but you have to pay the stamina-price and additional 50 points of magicka. When you do not have enaugh magicka you will cast horizontal Slice instead.\n<br />Casting art: Leftleading powerattack\n<br />Damage: 50 Points Firedamage.\n<br />Cooldown: None.\n<br />Special Effect: Raises dead bodys on contact.\n<br />-\n<br />[[color=#d8d8d8]Holy Fire[/color]]\n<br />A Healing Spell, that allows you to heal your own wounds. You will heal 100 Points of health instantly and 50 more over the next 5 seconds. It has also a cooldown of 5 Seconds. You have to pay the stamina-price and additional 20 points magicka.\n<br />Casting art: Blockbash while standing.\n<br />Heal: 100 Points of Health\n<br />Cooldown: 5Seconds; While in Cooldown you recover every second 10 additional healthpoints.\n<br />Special Effect: Heal over Time while in cooldown phase.\n<br />-\n<br />[[color=#d8d8d8]Oblivionrune[/color]]\n<br />The final abillity of the Flamebringer is to Conjure the Flamebringer himself to Nirn not his entire powers, but a shadow of himself. You will conjure him in the center of a oblivion rune. The rune will explode on contakt and deals a massive amount of firedamage. On recast you will only place a new rune but you are not able to conjure more than one Flamebringer at the same time. You have to pay the stamina-Price and additional 100 points of magicka, even then, when you are just placing another oblivion rune. The second rune, replaces the first one, if it is not exploded yet.\n<br />Casting art: Backleading powerattack\n<br />Damage: 150 Points of Firedamage on contact\n<br />Cooldown: None.\n<br />Special Effect: Conjures the Flamebringer to Nirn. (A mighty version with the conjuration-Perk)\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/91370/91370-1526482240-358754270.png[/img]\n<br />- A legal Copy of Skyrim(Oldrim)\n<br />- The Dragonborn DLC\n<br />- Skse\n<br />- The knowhow to drag and drop the modfiles into your skyrim Datafolder.\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/91370/91370-1526484129-4956149.png[/img]\n<br />Q: are you a dyslexics?\n<br />A: No, i mean.. not at all my english is just.. nja - not good xD\n<br />\n<br />Q: You sayed above this mod is not what you had planned - What do you have planned?\n<br />A: My Plan was to make a threw and recall weapon like Mjölnir or the Leviathan-Axe (GoW). But it did not work. I could not figure out a spinning effect and my game crashed every 3rd or 5th threw (i'll think a sword or a axe has just to many polygones to be used good as projectile. So i'll took the skaal-blade as reverence and planned to make this mod here instead.. but my plan was to make it in blue. But nifscope was not my friend this days every-times when i'll tryed to recolor magic effects (even if i just changed the gradiant-textures in the magic effect-nif's.. the game crashed or the visiuals just don't appear ingame. -_- i think none of my installed nifscope -versions is familiar with MagicEffect visual-Nif's. So i let them Orange. xD If someone want to make a blue recolor: Feel free, but please use this my modfile as Master.\n<br />\n<br />Q: Can i...?\n<br />A: Upload to other sites? No. Upload to paysites? Of course - NO! Make a update/patch/recolor/translation? Yes but please take my file as required master-file so that all additional patches, translations, recolors and so on are listed on top.\n<br />\n<br />Q: Ive found a Bug can i report it? \n<br />A: Of Course, when you double checked if its really a bug, than report it via bugreport - not just in comments. And please let me know in wich language version the bug appears.\n<br />\n<br />Q: Ive found a spelling mistake: is it a bug?\n<br />A: No its just a feature. But you can report them anyways and if i have time and.. you know im boring and i dont know what to do with my time, i'll fix it.^^\n<br />\n<br />Q: Whould you upload a video reference to the mod?\n<br />A: No. But you can.. i don't have a screenrecord programm, i dont want to install one and even if i whould my pc could not handle skyrim and recording at the same time.\n<br />\n<br />Q: Do you run Skyrim on a Gourd?\n<br />A: No. I run Skyrim on a Potato. Okay.. a potato with a halfway good gfx-card but still a potato.\n<br />\n<br />Q: Please, Pleaaase make a SSE version of this mod!!!!!!!11111oneeleven\n<br />A: Nope. I play Oldrim. I like Oldrim. I'll stay with Oldrim. I never played the SSE version and i'll wont. But you - yes you can make a SSE Version. But credit me and send me the link so i can link it back in the mod description: AND!! you are only allowed to make an SSE version if you convert both version the english and the german one. That are my only conditions.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Rikushai",
  "createdUnix": "1526484546",
  "updatedUnix": "1526484546",
  "containsAdultContent": false,
  "uploadedBy": "Rikushai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273156",
      "name": "The Flamebringer - English",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1415",
      "fileName": "The Flamebringer - English-91370-1-0.rar",
      "uploadedUnix": "1526482895",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f450f5aae36d4d04a08fbea2d404713ceb90dd32495a4e176790de964ec15096/analysis/1526482988/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Flamebringer%20-%20English-91370-1-0.rar?fid=1000273156&ttl=1535881911&ri=8192&rs=8192&setec=743c9891a2224e8036b689128801f296"
    },
    {
      "fileId": "1000273157",
      "name": "Der Flammenbringer - German",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1415",
      "fileName": "Der Flammenbringer - German-91370-1-0.rar",
      "uploadedUnix": "1526483038",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ae2d50f5c172ce2e0a8f5ae6b836a978fa941578e4921c2099f88e21827b56ea/analysis/1526483107/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Der%20Flammenbringer%20-%20German-91370-1-0.rar?fid=1000273157&ttl=1535881912&ri=8192&rs=8192&setec=e51a0044d8716a8840f0337378d40ef6"
    }
  ]
}