{
  "modId": 9138.0,
  "modName": "Epic Endeavours",
  "summary": "> Adds enemies and scaled difficulty with player levels.\r\n> Adds new follower classes.\r\n> Scales all followers to level with player.",
  "descriptionHtml": "If you like this mod please show your support by endorsing :). The more people who download this mod the more feedback I will get to continue growing this mod, and as usual report any bugs in the comments so I can remedy them for next release.\r\n\r\n--------------------\r\nV1.03 Release\r\n--------------------\r\n> Added 2 new followers/spouses into Skyrim.  Kaassi and Raksada.  A female and male Khajiit both located at the Drunken Huntsman in Whiterun.\r\n> Added 4 new enemies located in the wilderness.  Fire, frost, and seducer daedra\\'s, as well as golden saints.\r\n> Fixed some bugs in version 1.02 involving followers.\r\n> Temporarily removed Dragonlings until I finish sorting out their spawning issues.\r\n> Developed enemy templates to be released in 1.04.\r\n\r\n--------------------\r\nUpcoming! 1.04\r\n--------------------\r\nI am excited to announce the next few versions.  Version 1.04 will include better bandits and much stronger dragons who will be categorized by color and age.  Their colors will signify what kind of magic base they will use, such as breath weapons.  Expect a big difference in dragons with 1.04.\r\n\r\n--------------------\r\nUpcoming! 1.05\r\n--------------------\r\nThis will be the largest update yet.  With this update I am finally going to turn this mod from overhaul into it\\'s own unique DLC.  Adding approximately 10 new dungeons all which will follow a quest line.  I may or may not do some voice acting for this.  I haven\\'t decided that much yet.  The dungeons will all have unique bosses.  I don\\'t want to give out to much information but each boss you defeat will unlock a door.  This will be a challenging quest designed for players level 60 and above.\r\n\r\n--------------------\r\nV1.02 Release\r\n--------------------\r\n> Added more creatures into the game.  (Dragonlings, Hell Hounds, Frost Hounds)\r\n> Hounds are drop daedra hearts and are extremely difficult when encountered in packs.\r\n> Dragonlings are pack hunters, at levels 10-20-30-40 you will see packs of 1-2-3-4 respectively.\r\n> Created templates for determining material of enemy weapons.  Due to the need of creating close to a thousand new enemy templates, this will probably be added in next release.\r\n> Changed the respawn rate of dungeons from 30 days to 10 days.\r\n> Added Ralof and Hadvar to the list of followers/spouses.  This has not been tested completely, as far as I can tell it will require you to be done of the civil war quests.  If this does not work please tell me and I will script a dialogue for them.\r\n> Revamped follower spells again.  Due to large mana costs of regular spells followers will usually only cast low mana consumption spells as they are limited by their mana.  These spells have all been tagged in game as the spell name followed by \\\"Follower.\\\"  Please do not add these spells to your inventory via console.  Some of these spells as with other spells are \\\"left handed\\\" or \\\"right handed\\\" only spells.  Meaning you will not be able to use any other hand but the one specified.  If you accidentally add a spell, remove it through the console.\r\n> Added 6 new conjuration spells for necromancer type players.  Skeleton Archers > apprentice spell, Skeleton Warriors > adept spell, Skeleton Mages > expert spell.  Similar to atronachs, they also benefit from Dark Souls perk in the same way a potent atronach does from Elemental Potency perk.  This took a ridiculous amount of time, but I know some people were dying to see something like this, so here it is.  Similarily after completing the master conjuration quest, you can purchase thrall versions of these spells from the same place you purchase the atronach and dead thrall ones.  The 3 normal versions of the spells can be purchased from any spell book vendor, however you must as usual have the appropriate skill level.\r\n> Added 1 new spell for alteration (for all you non armor type mages out there).  Dragonflesh, purchaseable from Tolfdir after the master alteration quest.  With 3/3 mage armor perk and no armor equiped aside from clothes you can actually finally max out your armor similarily to heavy and light armor users.\r\n> Added 1 new restoration spell, useable by player character and mage only followers.  Group heal, will heal the caster and nearby allies for 600 health.  Consumes a fair amount of magicka, so use only when you desperately need it.\r\n> Determined a way to possibly remove the follower cap but did not implement it this update because it tends to be fairly buggy so far.\r\n\r\n--------------------\r\nUpcoming 1.03\r\n--------------------\r\n> Fix any bugs found.\r\n> Add again more enemies into the game (Frost and Fire Daedra\\'s are on my list, can you say Daggerfall?)\r\n> Add the Dremora\\'s and Golden Saints into lore friendly locations.\r\n> Work on creating rare spawns for enemies.  These would be more difficult and special enemies that will drop unique treasures.\r\n> Restructure human enemies classes and inventory.  Classes will be very similar to those used by followers.\r\n> Restructure human enemy leveled spellcasting templates.\r\n> Add more pack enemies as you level up.  Expect more challenging encounters by taking on a wave of enemies with your follower, rather than just one.\r\n> Add any requested followers that meet the limitations.\r\n> Add any requested enemies into game.\r\n\r\nAs usual please feel free to request anything you might like to see in the mod, and don\\'t forget to rate up :D!\r\n\r\n--------------------\r\nV1.01 Release\r\n--------------------\r\n> Added 20 new followers to follower list, all marriable.\r\n> Added 5 thieves guild followers/spouses (Garthar, Niruin, Ravyn Imyan, Sapphire, Vipir the Fleet).\r\n> Added Lisette, Sybille Stentor, and Ingun Black-Briar to the list of spouses/followers.\r\n> Invisible NPC hunting bow is now visible in NPC inventory and can now be removed permenantly by the player.\r\n> No console required for any of the added NPC\\'s, do not force marry them as they will marry you with the amulet of mara and likewise with following. Some require quests (Sybille Stentor and Ingun Black-Briar) and some do not. (Thieves guild require you to be in the cistern with the exception of Sapphire, Sapphire just requires you to talk to her, likewise with Lisette).\r\n>Faendal no longer visits Camilla Valerius (This was done to avoid the issue with Faendal trying to visit Camilla while she was following you).\r\n\r\n--------------------\r\nV1.00 Release\r\n--------------------\r\nThis mod took virtually days to make. A lot of work went into fixing NPC AI\\'s and adding enemies. The enemies spawn only in the locations other creatures of their kind will spawn. I won\\'t go into detail about what enemies were added, to name a few Dremora Seducer/Hellhounds/Ursa(large bears)/Worgen/Great Wyrms and Wyrms(Dragons)/Golden Saints. The biggest challenge was redoing all enemy templates to level appropriately with your character. Will upload screenshots soon.\r\n\r\nNot all enemies going to level to max level with you, for example a \\\"bandit\\\" lowest level of bandit on the bandit tier, will level from 1-10, where in vanilla they remained at level 1. Although the enemies are certainly more challenging requiring probably a follower to assist you. All followers have been completely revamped in AI/combat styles/magic. As you level they will learn new spells. Yes... They will learn spells as they level. I will attach a .txt file to show you the classes that I\\'ve added for each one. Although your followers MAY learn spells from master levels, they will not learn thralls (This is to avoid lag and unsummonable annoyances). Certain classes have certain weapon preferences as well as spell preferences. For example Battlemages2h will use a 2h weapon and destruction/restoration magic, however a Spellsword2h will use 2h weapons and destruction/restoration/conjuration. There are choices among spells, followers either use lightning, fire, or frost, as well as atronachs, or necromancy. Yes you will have your own necromancer spellsword/nightblade/battlemage if you are an evil character!\r\n\r\nMore than anything I want your input on this please. If there is anything you\\'d like to see done or changed please let me know. Your input will help this mod grow. If enough people want to see added followers/spouses or retexts of some npcs (Example in this mod Breylna does not look ugly -_-) I can aim to make that work (within reason I don\\'t want this mod banned). An example of a follower/spouse I know some have been asking for is a Khajiit. While this is certainly possible, I\\'d have to code some dialogue for a new NPC. The downside is it will not have a khajiit voice. < Reason > The mod would look really weird with random cut dialogue that forces marriage.\r\n\r\nNOTE: This is a standalone mod, however those mods that upgrade followers and such may not work in conjunction with this mod or may work improperly. Mods that edit attributes of enemies may also not work or may work improperly. ",
  "categoryId": "79",
  "version": "1.03",
  "author": "Ice9000",
  "createdUnix": "1329040281",
  "updatedUnix": "1330544333",
  "containsAdultContent": false,
  "uploadedBy": "ice9000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "29509",
      "name": "EpicEndeavorsV100",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "202",
      "fileName": "EpicEndeavorsV100-9138.rar",
      "uploadedUnix": "1329040588",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/7c6eb381b6e035217af11111fbcd5e5350fb3659b14f6ee5e52af24745c3237d/analysis/1406672764/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EpicEndeavorsV100-9138.rar?fid=29509&ttl=1535768417&ri=8192&rs=8192&setec=d2d5564e3e62b3a95458ef5f0836c272"
    },
    {
      "fileId": "30384",
      "name": "EpicEndeavoursV101",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "232",
      "fileName": "EpicEndeavoursV101-9138.rar",
      "uploadedUnix": "1329147664",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/0df92201d6346a83f895fa142ee8a7d1bbae6a7bc758d2e76a654e561ab7519b/analysis/1406678591/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EpicEndeavoursV101-9138.rar?fid=30384&ttl=1535768417&ri=8192&rs=8192&setec=6c44acba557af2f7d03544e7c64733bd"
    },
    {
      "fileId": "32161",
      "name": "EpicEndeavoursV102",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "256",
      "fileName": "EpicEndeavoursV102-9138.rar",
      "uploadedUnix": "1329417401",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/d2b0065f25488dd13f82d83beea4810e1240a877aa9ff3b1939b8039bde716df/analysis/1406687764/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EpicEndeavoursV102-9138.rar?fid=32161&ttl=1535768418&ri=8192&rs=8192&setec=61924983ec44da37320c342baa183111"
    },
    {
      "fileId": "32807",
      "name": "Version updates",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "Version updates-9138-1.rar",
      "uploadedUnix": "1329517639",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/fd75603c31e51df5726a601628a70baca510ed9c2c52fad0e7b5faf3b2fca3d6/analysis/1406691126/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%20updates-9138-1.rar?fid=32807&ttl=1535768418&ri=8192&rs=8192&setec=69dc09cd2a15ca788d8e4d44411c9c4e"
    },
    {
      "fileId": "38533",
      "name": "EpicEndeavoursV103",
      "version": "1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "567",
      "fileName": "EpicEndeavoursV103-9138-1-03.rar",
      "uploadedUnix": "1330543913",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/b8c8d185861d9257e9208cf1ed55799204920af1d04ba93ffb6b5e5691ba24b1/analysis/1406721805/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EpicEndeavoursV103-9138-1-03.rar?fid=38533&ttl=1535768419&ri=8192&rs=8192&setec=87cf08f6ea3abfbfd335056abe8a3cfd"
    },
    {
      "fileId": "38536",
      "name": "Followers xml spreadsheet",
      "version": "1.03",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Followers xml spreadsheet-9138-1-03.rar",
      "uploadedUnix": "1330544333",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/d517a741ebc99453d4d509887901f34cc0cade907992a1641f3fc3c19bbb602e/analysis/1406721806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Followers%20xml%20spreadsheet-9138-1-03.rar?fid=38536&ttl=1535768419&ri=8192&rs=8192&setec=5e8cd4ca5d17a1ed3fef519c37f1729d"
    }
  ]
}