{
  "modId": 91395.0,
  "modName": "Iron Dusk's Laboratory (WIP Mod Collection)",
  "summary": "A collection of mod's I've been working on but haven't yet released, either because there are some bugs or features I haven't ironed out, or I want to expand it in a different mod, or I just can't be bothered to make a new mod page for every single mod.",
  "descriptionHtml": "[size=3]When it comes to making mods, I apparently have the attention span of a skeever, and end up making a load of relatively small mods that I play around with but never get around to polishing or uploading, and many just sit on my hard drive for months while I go off to work on new things. Here's a collection of those mods.\n<br />\n<br />[/size][size=3][size=4][b][u]Religion 3.0 Work-In-Progress (Updated 17 of May, 2018)[/u][/b][/size]\n<br />[spoiler][/size][size=3]\n<br />[Requires Dawnguard and Dragonborn][/size][size=3]\n<br />This is the main thing I've been working on for the past year or so. A completely rewritten Religious role-play game mechanic. This is an update for one of my existing mods, found [url=https://www.nexusmods.com/skyrim/mods/67663]here[/url], but since it's a work in progress that still has a ways to go, I'm uploading it here.\n<br />\n<br />This mod completely changes how all forms of Religion work in Skyrim. You can no longer receive blessing from shrines or the divine's amulets, you have to pray to get a chance to receive a blessing, and you have to wear the Divine's amulet to 'activate' the more powerful ones. The Standing Stones and the Constellations have a system of meditation added onto them. The Daedra can be worshiped and grant additional gifts if they're amused enough to contact you. Ancient Spirits, either your ancestors or old gods can be invoked to aid you.\n<br />\n<br />With each of these four \"pantheons\" you can spend in-game hours meditation/praying/worshiping/invoking some deity to raise their disposition towards you. What you wear and where you are will determine how effective it is. Or you can go out and complete vanilla quests, rack up statistics, make friends and enemies, all of which will also affect the disposition these deities have towards you.\n<br />\n<br />If you Ask for Guidance at a shrine, or visit a location or read a book associated about a deity, you may receive a nightly vision. These visions will guide you towards things that will raise the deity's disposition of you, and against things that will lower it. They may also tell you what the disposition is. Or, they may give you a Lesser Power, that will allow you to worship the deity anywhere. For Daedra and Ancient Spirits, this is the only way to worship them, apart from Azura, Boethiah, and Mephala through the Dragonborn DLC shrines.\n<br />\n<br />With this WiP version, you can Meditate on the Constellations, Pray to the Divines, Worship Daedra, and Invoke ancient spirits. Unfortunately, only the Meditation and Divines are mostly finished. All the basic mechanics are in, and it will work, but for most Daedra and all of the Spirits, you won't receive visions or blessings beyond placeholders that don't do anything. Stendarr, Talos, and Zenithar still have some visions that aren't written yet, but are mostly complete. Azura, Boethiah, and Clavicus have their gifts completed, but don't have any visions written.\n<br />\n<br />If you want to uninstall the mod at any point, search in the console for the lesser power called \"Prayer of Anu\". This spell will remove any blessings/curses/gifts etc. that you may have. It is highly recommended you use this before uninstalling.\n<br />\n<br />The only things this mods edits are the Vanilla Shrines, Vanilla Religious Amulets, and the Beggars Charity effect. It is recommended you install the mod away from shrines, with amulets unequipped, and the charity effect not applied to your character.\n<br />[/spoiler]\n<br />\n<br />[/size][size=4][u][b]Combat Consequences[/b][/u][/size]\n<br />[size=3]Now fully released and available [url=https://www.nexusmods.com/skyrim/mods/93377/]here[/url]!\n<br />[/size][size=3]\n<br />\n<br />[/size][size=4][u][b]Simple Necromancy[/b][/u][/size][size=3][size=4][b][u] (Updated 17 of May, 2018)[/u][/b][/size][/size]\n<br />[size=3][spoiler][/size][size=3]\n<br />This is a fleshed out (heh) Skeleton-Raising mod somewhat inspired by [url=https://www.nexusmods.com/skyrim/mods/35378]Corpse Preparation[/url]. You have to dissect corpses or find skeletons out in the world, then raise them with some alchemical ingredients. For most parts of this mod, you will need to know one of the vanilla reanimation spells to get the options.\n<br />\n<br />[u]Carrying Corpses and Skeletons[/u]\n<br />If you are sneaking and activate a corpse, you will get the option to pick it up. You can only carry one corpse at a time, and you can't store the corpse in a container. You can drop it by dropping the Corpse skull in the misc section of your inventory.\n<br />\n<br />You can also pick up rigid skeletons, as in skeletons that have their limbs attached. You can carry an unlimited number of them, but you also can't store skeletons in containers. Like corpses, you drop them by dropping the associated skull in the misc section of your inventory. The skull will be called something like \"Fragile Warlock Skeleton\".\n<br />\n<br />[u]Burying Corpses\n<br />[/u]If you want to get rid of a corpse for whatever reason, you can. You will have to pick up the corpse and take them to some exterior area, and you have to have a shovel in your inventory to have the option[size=3][size=3] (which can now be crafted at a forge)[/size][/size].\n<br />\n<br />[u]Dissecting Corpses[/u]\n<br />If you have an embalming tool or torture tools (which can now be crafted at a forge if you know a reanimation spell) you can dissect hominid corpses, if they aren't vampires or otherwise undead already. You will get some organs and flesh from it.[size=3] If you enable the CACO patch, you will get blood and other appropriate organs from that mod.[/size] Depending on your Conjuration and Alchemy skill, you will get either an intact skeleton or a ruined skeleton. A ruined skeleton will have to be repaired to be raised.\n<br />\n<br />[u]Repairing Skeletons[/u]\n<br />[size=3]If you find a loose skeleton, as in skeletons that don't have their limbs attached, you can attempt to repair them. You will need either a Blacksmith's Hammer or Blacksmith's Tongs (which can now be crafted at a forge), as well as some leather strips and iron ingots. Stronger skeletons will require more materials to repair. The chance to successfully repair the skeleton is dependent on your Conjuration and Smithing skill. If you fail, you will instead salvage the skeleton.\n<br />[size=3]\n<br />[u]Salvaging Skeletons[/u]\n<br />If you can't repair a skeleton, or don't want you, or simply want to get rid of a skeleton, you can salvage one. Salvaging will give you a random number of bones which could either be stored or assembled into a different skeleton.\n<br />[u]\n<br />Assembling Skeletons[/u]\n<br />[/size]To assemble a full skeleton, you will need a Skull, Ribcage, and Left and Right Skeletal Arms, Hands, Legs, and Feet. As well as either a Hammer or Tongs, and leather strips and iron ingots. When you have everything you need, drop a skull on the ground and activate it. It will give you the option to assemble a skeleton.\n<br />\n<br />You are guaranteed to successfully assemble a skeleton, but the strength of it will depend on your Conjuration and Smithing Skills.\n<br />\n<br />[u]Raising Skeletons[/u]\n<br />When you finally have a rigid skeleton, you can raise it. Raising a skeleton will require some Magicka, as well as Bone Meal and Nightshade. If you are low on Nightshade, you can replace it with a greater number of Lavender flowers. If you are skilled in Conjuration and Enchanting, there is a chance the skeleton will still be rigid after being killed. Raising a skeleton will permanently drop your maximum Magicka by 25, until the skeleton is killed or released. There is a hard cap of 20 skeletons that can be simultaneously raised, which will require 500 Magicka to maintain.\n<br />\n<br />[u]Skeletons[/u]\n<br />Skeletons are divided into three classes: Warriors, Warlocks, and Archers. They are also divided into 5 \n<br />strength levels: Fragile, Weak, Sturdy, Strong, and Robust. The class \n<br />and strength of the skeleton is dependent on the skill of the corpse, or\n<br /> your skill if you try to assemble one from individual bones.\n<br />\n<br />When you have a risen skeleton, you can command them to either Trade, Wait, Follow, or Release. Skeletons can carry much, probably just their weapons. You have to raise a very strong skeleton to get any sort of pack mule out of this. Wait and Follow commands should be intuitive. If you Release the skeleton, it will kill them, and give you back the Magicka required to keep them animated.[/size]\n<br />[/spoiler]\n<br />[size=3]\n<br />[/size][size=4][u][b]Terra Umbra, Moveable Floating Island[/b][/u][/size][size=3][size=4][b][u] (Updated 17 of May, 2018)[/u][/b][/size][/size]\n<br />[size=3][spoiler][/size]\n<br />This is an epic moveable player home that is incredibly convoluted under the hood, due to my inexperience with any 3D editors. Still, it made me chuckle like a madman when testing it out, so I think it's worth uploading.\n<br />\n<br />If you travel to the Alftand Ruins west of Winterhold, you will find a new ruined tower in the canyon below, with a frost-bitten corpse lying underneath it. The corpse will have two spell tomes on it; [size=3]Terra Penumbra[/size] and Terra Umbra. Both of these spells require a [u][b][i]LOT[/i][/b][/u] of Magicka. I wouldn't recommend trying this mod until your character is a Master of Alteration, or if you're okay using God Mode.\n<br />\n<br />Terra Penumbra is an expert level Alteration spell. Casting it lifts a large portion of earth and rock directly underneath you, raising you up into the sky. Crouching while casting it will lower the rock.\n<br />\n<br />Terra Umbra is a master level Alteration spell. Casting it will [b][i]LIFT[/i][/b] [i][b]THE ENTIRE NEW SECTION OF RUINS[/b][/i] up into the air. You will have to continually cast the spell for about a minute. If you run out of Magicka before that, the ruins will sink back into the glacier.\n<br />\n<br />Once you have the Dwarven Tower stable in the air, you can use your Terra Penumbra spell to lift yourself up to it. Then you can cast Terra Umbra again to [b][i]MOVE THE ENTIRE DAMN ISLAND[/i][/b]. Casting the spell while on the island will start moving the island in the direction you were looking. Casting the spell while off the island will draw it towards a position over you. Crouching while casting will lower the island.\n<br />\n<br />Also, for Arkay's sake, use some Audio mods and quality headphones while using this.\n<br />[/spoiler]\n<br />[/size][size=3]\n<br />[/size][size=3][size=4][b][u]Realistic Tempering (Updated 17 of May, 2018)[/u][/b][/size]\n<br />[spoiler][/size][size=3][size=3]\n<br />[Requires [url=https://www.nexusmods.com/skyrim/mods/64283/?]Immersive Jewelry[/url]]\n<br />This is a simple SkyProc patcher that changes tempering of Armor and Weapons. Instead of using a full ingot to temper an item independent of what kind of item it is, this patch uses the metal tabs and bars from Immersive Jewelry, and sets the amount required to temper an item dependent on the weight of the item. Also, it changes the perk requirements for tempering, so items can be tempered only if you have the appropriate smithing perk, regardless of whether or not it is enchanted.\n<br />\n<br />So, instead of using a full iron ingot to temper a small iron dagger, you will now only require an iron tab, and if you enchant it, you won't need to grind Smithing to 60 to temper it.\n<br />[/spoiler][/size]\n<br />[/size][size=3]\n<br />[/size][size=3][size=4][b][u]Saddlebags (Updated 17 of May, 2018)[/u][/b][/size]\n<br />[spoiler]\n<br />A very simple horse-management mod.\n<br />\n<br />If you crouch while activating your horse, you can store items in the horse's inventory. They're set to have a carrying capacity of 500.\n<br />\n<br />You will also get a Horse Whistle lesser power, which will toggle your horse following you or waiting.\n<br />[/size][size=3][/spoiler]\n<br />[size=3]\n<br />[/size][size=3][size=4][b][u]Set Outfit (Updated 17 of May, 2018)[/u][/b][/size]\n<br />[spoiler]\n<br />[Requires SKSE]\n<br />This is a work-in-progress outfit management mod. With this mod, you can bundle some armor together into an outfit misc item at a tanning rack. If you give someone this outfit, it will change their outfit to the one you gave them. This mod is very WIP, with only a few outfits setup. There is also currently no system to get the armor back out of the outfit item.\n<br />\n<br />These are the outfits currently set up:\n<br />-Banded Iron Armor (No Shield)\n<br />-Leather Armor (No Helmet)\n<br />-5 Farm Clothes Outfits\n<br />-Blades Armor\n<br />-Blades Armor (No Helmet, No Shield)\n<br />-Wolf Armor\n<br />-Wolf Armor (No Helmet)\n<br />[/size][size=3][/spoiler]\n<br />[size=3]\n<br />[/size][size=3][size=4][b][u]Simple Playable Instruments (Updated 17 of May, 2018)[/u][/b][/size]\n<br />[spoiler][size=3][size=3]\n<br />[Requires SKSE][/size][/size]\n<br />This mod allows you to play instruments. All you have to do is pick up an instrument, and use it in your inventory. You will then start playing. Open your inventory and use the instrument again to stop playing. While playing time will be accelerated, setting the timescale to 40 by default.\n<br />\n<br />If there are NPCs nearby, they may applaud when you finish a song, which will raise your Speechcraft. If you are in an inn or a city, they may toss you a few coins. If you have the Allure perk, there is a chance you will become friends with people listening to you. The better your Speech skill, the more coins you will get, and the more likely people will become friends with you.\n<br />[/size][size=3][/spoiler]\n<br />[/size][/size][/size][size=3][size=3][size=3]\n<br />[/size][size=3][size=4][b][u]Unleveler (Updated 17 of May, 2018)[/u][/b][/size]\n<br />[spoiler]\n<br />This is a SkyProc patch unlevels all loot and enemies. To be more specific, it unlevels all Leveled Items and Leveled Actors, and weighs the items/npcs in those lists based on the level that they already have, so low-level items and enemies are more common than high-level ones. It also weighs bosses and boss loot differently, such that you are more likely to find a high-level bosses and high-level boss loot compared to the rest of the game.\n<br />[/size][size=3][/spoiler][/size][/size][/size]",
  "categoryId": "24",
  "version": "NA",
  "author": "IronDusk33",
  "createdUnix": "1526622667",
  "updatedUnix": "1526622667",
  "containsAdultContent": false,
  "uploadedBy": "IronDusk33",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273238",
      "name": "Religion WIP Update 5-17-18",
      "version": "5-17-18",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "229",
      "fileName": "Religion WIP Update-91395-5-17-18.rar",
      "uploadedUnix": "1526607076",
      "modVersion": "5-17-18",
      "virusScanUrl": "https://www.virustotal.com/file/547865bd2b45378d138e4ce0909e78e7652594f502e1bced00ead678ebad6a7f/analysis/1526607244/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Religion%20WIP%20Update-91395-5-17-18.rar?fid=1000273238&ttl=1535881950&ri=8192&rs=8192&setec=6fedc7db7cd87d49b6bee6ab84ec5b12"
    },
    {
      "fileId": "1000273242",
      "name": "Combat Consequences 5-17-18",
      "version": "5-17-18",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "109",
      "fileName": "Combat Consequences 5-17-18-91395-5-17-18.rar",
      "uploadedUnix": "1526612628",
      "modVersion": "5-17-18",
      "virusScanUrl": "https://www.virustotal.com/file/4f2c7ddefcd9e4041fe4d4d0e8cf28a1da063b2e64d934993e8e8b6497338cf8/analysis/1526612762/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Combat%20Consequences%205-17-18-91395-5-17-18.rar?fid=1000273242&ttl=1535881951&ri=8192&rs=8192&setec=432f04cfde134c3a0271ac79caaa797a"
    },
    {
      "fileId": "1000273243",
      "name": "Simple Necromancy 5-17-18",
      "version": "5-17-18",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36",
      "fileName": "Simple Necromancey 5-17-18-91395-5-17-18.rar",
      "uploadedUnix": "1526615487",
      "modVersion": "5-17-18",
      "virusScanUrl": "https://www.virustotal.com/file/d4bf5952fd056f045dad732f8793d4a047b0455cbccfcd8c03255b006ac99c95/analysis/1526615643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Necromancey%205-17-18-91395-5-17-18.rar?fid=1000273243&ttl=1535881951&ri=8192&rs=8192&setec=d62c9d7322991b2e0690d6c673bf698c"
    },
    {
      "fileId": "1000273246",
      "name": "Terra Umbra 5-17-18",
      "version": "5-17-18",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2864",
      "fileName": "Terra Umbra-91395-5-17-18.rar",
      "uploadedUnix": "1526617147",
      "modVersion": "5-17-18",
      "virusScanUrl": "https://www.virustotal.com/file/b690eebdc7a74c85fbc50901c881517bdd2ba35d76b5bfaefbaec9f4aca76a9d/analysis/1526617272/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Terra%20Umbra-91395-5-17-18.rar?fid=1000273246&ttl=1535881952&ri=8192&rs=8192&setec=edbbffc5ae1fe58e3b6a6e012ea37d1b"
    },
    {
      "fileId": "1000273248",
      "name": "Realistic Tempering 5-17-18",
      "version": "5-17-18",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2451",
      "fileName": "Realistic Tempering 5-17-18-91395-5-17-18.rar",
      "uploadedUnix": "1526617906",
      "modVersion": "5-17-18",
      "virusScanUrl": "https://www.virustotal.com/file/7b5f3204a00184e79b673d4836e3ae8e8dfadf6bffb305dde890ba995cb58bc8/analysis/1526617991/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Realistic%20Tempering%205-17-18-91395-5-17-18.rar?fid=1000273248&ttl=1535881952&ri=8192&rs=8192&setec=d203e7c4b686b23deba2bede870a2696"
    },
    {
      "fileId": "1000273254",
      "name": "Saddlebags 5-17-18",
      "version": "5-17-18",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Saddlebags 5-17-18-91395-5-17-18.rar",
      "uploadedUnix": "1526620913",
      "modVersion": "5-17-18",
      "virusScanUrl": "https://www.virustotal.com/file/dc881658bc9e6e8c37ee00de207727182ca402ab330c2ee4bdd703b7fb3b492d/analysis/1526620983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Saddlebags%205-17-18-91395-5-17-18.rar?fid=1000273254&ttl=1535881953&ri=8192&rs=8192&setec=e5e0310baebf78d24f0941c7f1986c2a"
    },
    {
      "fileId": "1000273260",
      "name": "Set Outfit 5-17-18",
      "version": "5-17-18",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Set Outfit 5-17-18-91395-5-17-18.rar",
      "uploadedUnix": "1526621467",
      "modVersion": "5-17-18",
      "virusScanUrl": "https://www.virustotal.com/file/7a0128b12e7df28ed3e86ee788d963e264245a63a0fe8f97d18586314ecb6a54/analysis/1526621583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Set%20Outfit%205-17-18-91395-5-17-18.rar?fid=1000273260&ttl=1535881953&ri=8192&rs=8192&setec=3d97ef9de2d86396a7e0d0d084edbaf6"
    },
    {
      "fileId": "1000273262",
      "name": "Simple Playable Instruments 5-17-18",
      "version": "5-17-18",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Simple Playable Instruments 5-17-18-91395-5-17-18.rar",
      "uploadedUnix": "1526622024",
      "modVersion": "5-17-18",
      "virusScanUrl": "https://www.virustotal.com/file/83aefb66db0ac055e0817b3684330e238a618a2502dafcbd10f89c44aa676237/analysis/1526622123/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Playable%20Instruments%205-17-18-91395-5-17-18.rar?fid=1000273262&ttl=1535881954&ri=8192&rs=8192&setec=ec81abb7136cc942770680feeb9ee348"
    },
    {
      "fileId": "1000273266",
      "name": "Unleveler 5-17-18",
      "version": "5-17-18",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2453",
      "fileName": "Unleveler 5-17-18-91395-5-17-18.rar",
      "uploadedUnix": "1526622633",
      "modVersion": "5-17-18",
      "virusScanUrl": "https://www.virustotal.com/file/4d67742b8a57605b0a25ca2018cf9da6cd65ada9c7992b214be7ae2cf6b58b02/analysis/1526622731/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unleveler%205-17-18-91395-5-17-18.rar?fid=1000273266&ttl=1535881954&ri=8192&rs=8192&setec=8395bde49f98ed111e5f360641a8b99a"
    }
  ]
}