{
  "modId": 91408.0,
  "modName": "Whiterun Stronghold 1-0",
  "summary": "Whiterun Stronghold is one of a number of hidden fortresses built by a secret organization within the Empire in preparation for the resumption of the war against the Thalmor. It is hidden under the mountains between Whiterun and Riverwood within convenient walking distance of Whiterun.",
  "descriptionHtml": "Whiterun Stronghold is one of a number of hidden fortresses built by a secret organization within the Empire in preparation for the resumption of the war against the Thalmor. It is hidden under the mountains between Whiterun and Riverwood within convenient walking distance of Whiterun.You begin the game with a letter authorizing you to take command of the Stronghold. How you came by that letter is left to the player's imagination. The letter informs you of the location of the Stronghold and that you can get the key from the former Commander and where to look for him.The main Stronghold has two physical entrances on either side of the mountains. Those entrances can be used as basic player homes until you gain access to the Stronghold as there is a bedroll, cooking pot and player chest in both of them. To enter the Stronghold itself requires a key.The main Stronghold is centered on a common area for eating and relaxing. To the north are the private quarters of the commander, consisting of a bedroom and  a treasure display room off of that. To the east of the commons are two large rooms, an armory with plentiful storage and manniquins, and a mages study with a library area, alchemy/naturalist display area, enchanting area, and shrine display for the mage's religious studies as well as storage for magical items. To the east is the working area for the staff. There is a small barracks, private quarters for the permanent staff (a mage, a guard and a housekeeper), a pantry, kitchen and workroom for weapon and armor maintenance. To the south of the workroom is an escape route through the other side of the mountains.There are also within the Stronghold four obelisks that activated by the proper spells will take you to different locations. The spellbook for the first you will find in the stronghold. It takes you to a cloistered garden in the center of a hidden grass and tree covered crater. This is simply a pleasant place to relax, gather flora and possibly do some hunting. Just stay out of the graveyard at night. The second spellbook only becomes available if you pursue the Mages' Guild questline. The third requires completing most though not all of the Thieves' Guild questline and offers access to a hideaway with a number of useful assets. There are two khajiit caretakers, an alchemist and a fence. There is also a mage's workroom with an enchanted cage to summon creatures for study, a temple to Nocturnal and a secret chamber suitable as living quarters for a vampire. The fourth spellbook you will find somewhere in Solstheim in an abandoned smugglers den which also works as a basic camping spot for you to stay at while exploring Solstheim. One caution, the mage that made the obelisks had a reputation for making enchanted devices that were both powerful and unreliable. Those obelisks take a fair amount of magica to use and are not entirely safe, especially for non mages.In Markarth, near the entrance, I placed a small used bookstore. It sells cheap and common books, writing utensils, and a few other items.There are no quest markers. You will simply have to search for items and locations by following written clues. If you loose the authorization before reading it the stronghold will not be accessible.This is intended as a working base and not as a family home, though it is convenient to both Whiterun and Lakeview Manor if you wish to have a family. The layout is simple and logical with no long passages to be memorized. There are no anachronisms like hot tubs or showers. Most items come at some cost though I wanted the initial quest to get the key to be simple enough that you could gain access at low levels. The teleport stones require a fair amount of magica and or skill in alteration as well as risk and most players may not gain access to one or more of them in any one playthrough. The statue of Nocturnal in the Thieves Hideout requires suitable offerings to gain Her blessing. The device to create spider scrolls in the Hideout requires finding and reading the instruction book. The creatures in the magical cage are behind a barrier and cannot be killed. They are only for observation.\n<br />\n<br /> I hope you enjoy this mod and I welcome feedback.Credits\n<br />Ingredient Wall Art Resource by Blary\n<br />Weapons wall art by InsanitySorrow\n<br />Tutorials by Darkfox127, Hellcat5, AlexanderJVelicky, Antony Bellingham, and many othersRequires Hearthfire, Dawnguard and Dragonborn",
  "categoryId": "68",
  "version": "1.1",
  "author": "greyday01",
  "createdUnix": "1526760092",
  "updatedUnix": "1527167915",
  "containsAdultContent": false,
  "uploadedBy": "greyday01",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273384",
      "name": "Whiterun Stronghold",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "9722",
      "fileName": "Whiterun Stronghold-91408-1-0.7z",
      "uploadedUnix": "1526749898",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3c67463d7bbe34c049cd0fbbccf46edf2ee75902c840c74c85529baccfd3f8da/analysis/1526750076/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whiterun%20Stronghold-91408-1-0.7z?fid=1000273384&ttl=1535881971&ri=8192&rs=8192&setec=f56ab285e84f9122153cde29df177042"
    },
    {
      "fileId": "1000273700",
      "name": "Whiterun Stronghold",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9671",
      "fileName": "Whiterun Stronghold-91408-1-1.7z",
      "uploadedUnix": "1527167915",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/67a83e069d42aca367cd6df3abc7610d133a75ee7b71aa34b1e34f79f6bd71d1/analysis/1527168037/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whiterun%20Stronghold-91408-1-1.7z?fid=1000273700&ttl=1535881971&ri=8192&rs=8192&setec=5ff246ebde6aa1bf478a3f9fcbb8335d"
    }
  ]
}