{
  "modId": 91416.0,
  "modName": "Jen and Morgan. Two Female Witcher Followers",
  "summary": "Adds two female witchers.",
  "descriptionHtml": "I decided to make two of my presets into follower. They have quite a backstory too. \n<br />\n<br />\n<br />Jen's parents were killed by an assassin. Her father's last request was for Jen to go to the Imperial City to find a man to train her in a new way of fighting. So she did. She left Windhelm and make the trek to the Imperial City in Cyrodiil. There she met a man with white hair and a white beard. He trained her for six months before setting her out into Cyrodiil for another six months to learn to survive on her own. During her travels she met Morgan, the man's daughter. They spent a long time together before parting ways. Jen went through many adventures in Cyrodiil before returning to the Imperial City to finish her training. Shortly after Jen arrived at the man's house Morgan showed up. The man taught Jen the signs of a witcher and how to fight as a witcher. Morgan and Jen began to fall in love. Even though Morgan didn't want Jen to undergo to mutations, Jen did anyway. Jen went through the witcher trials and became a fully fledged witcher with all the skills a witcher would have. Morgan is also considered a witcher even though she didn't have the mutations. Jen and Morgan shared many adventures together including stopping an evil cult bent on destroying Nirn. They finally wound back up in Cyrodiil where they got married and adopted a daughter named Anna.\n<br />\n<br />That's the rundown of a story series I wrote. Morgan was designed by a good friend of mine. Jen is my creation. \n<br />\n<br />Some information about them:\n<br />Jen:\n<br />She uses heavy armor and has the first Juggernaught perks.\n<br />She uses a onehanded sword also the first two armsman perks.\n<br />She starts at level 5 and levels with your character until level 100.\n<br />She uses the female eventoned voice.\n<br />She uses the cbbe slim never nude body.\n<br />\n<br />Morgan:\n<br />She uses light armor and has the first two agile defender perks.\n<br />She uses the female young eager voice.\n<br />Rest is same as Jen.\n<br />\n<br />Extra info: \n<br />No neither of them are marriable. Don't ask for this because I'm not doing it. They're married to each other in their story. \n<br />Jen's hair color isn't the best. I'm aware of this. I used the alpha channel in racemenu to make it better but the creation kit doesn't support that. If anyone knows a way around that please tell me.\n<br />Don't ask me to make a nude version either as I won't do it. Its not that hard to do yourself. \n<br />If you want I can release Jen's racemenu preset. Don't ask for Morgan's. My friend says he doesn't want his presets on the web. He's a good friend and I don't want to betray him by doing that.\n<br />If you're wondering about the clipping on Jen's armor. I've only noticed it when she's sitting on a chair. That's not my fault. \n<br />\n<br />Requirements:\n<br />HDT Physics Extention. It's required for the skirt on Jen's armor. I believe its technically possible to play without it but the skirt won't move and will look pretty dumb. Besides who doesn't have that mod by now? \n<br />\n<br />Installation:\n<br />Install with your preferred mod manager or drop the files in the data folder manually.\n<br />\n<br />Uninstallation:\n<br />Its a light weight mod. Uninstallation is fine.\n<br />\n<br />Future plans:\n<br />I'm going to TRY and splice some of the vanilla dialogue together to make them have some custom voicing. No promises if I can actually do that.\n<br />I'm also going to try and work on both Jen's and Morgan's facial and body textures. The presets have overlays but the creation kit doesn't support this.\n<br />I may also make a customization system that will allow you to change Jen's armor textures. Grandmaster Ursine has the dyes from Witcher 3. If I decide to do this I'll also try and get permission for Ciri's dlc armor for Morgan. I really don't want to add any scripts. I thought about doing that for the first release but I didn't want to write any scripts. I can, but I'm just too lazy honestly.\n<br />\n<br />One final note:\n<br />I'm planning on working on a dlc sized witcher quest mod. It will have several features. I'm going to release each feature separately once that feature is finished. Witcher alchemy for example is already released. It will get a major overhaul when I finish the mod. This will take a while so be patient. I figure at first it will be unvoiced dialogue when I release it as a beta then once I get most of the bugs worked out I'll look for some voice actors.\n<br />\n<br />\n<br />\n<br />EDIT: Sorry to everyone who downloaded the mod. I realized after I published it that I didn't put their location. I had edited it before bed but for some reason it didn't save the change. They're in the Sleeping Giant Inn. Riverwood. Sorry about that.\n<br />\n<br />\n<br />That'll about do it. Hope you enjoy this mod.\n<br />\n<br />\n<br />Some info about the first update:\n<br />You will need to use a save before you recruited them. You may experience problems if you don't. I had to recreate Morgan because the original one had some problems I couldn't figure out. If you use a save after you recruit them and have problems you're on your own.\n<br />It will be quite a bit larger than the initial release. I'm fixing some texture problems. \n<br />The clipping with Jen's armor will be fixed.\n<br />Jen's hair will be fixed. When creating her I didn't realize I forgot to add a file so that's why her hair looks weird.\n<br />As for when, no idea. The mod is completely broken right now. Morgan has a neckgap, black faces, mesh problems, texture problems. I've worked on it for 14 hours and can't figure it out. It may take some time. I'll try and have it out by tomorrow(5/20/18), no promises though.\n<br />\n<br />I know the followers don't look very good right now. I forgot to copy the racemenu textures when I made them. That happens to be my current dilemma  If anyone wants to get in touch with me and help me through this send me a PM. I have no idea what's going on. It doesn't make any sense. \n<br />\n<br />Just track the mod. The followers are getting a major appearance overhaul. When the update is out, they will be much prettier. Honestly, I wouldn't bother downloading it until the update is out. I'm working very hard on it but I'm getting slightly irritated. I have an idea that I will try tomorrow. It's currently past 2AM and my brain is fried. If you don't care about facial appearances and just want some witcher followers then go for it. If you care about facial appearances just wait. Morgan especially will look much nicer.",
  "categoryId": "96",
  "version": "1.0",
  "author": "Ryz",
  "createdUnix": "1526711745",
  "updatedUnix": "1526711745",
  "containsAdultContent": false,
  "uploadedBy": "Ryyz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273340",
      "name": "Jen and Morgan. Two Female Witcher Followers",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "83164",
      "fileName": "Jen and Morgan. Two Female Witcher Followers-91416-1-0.rar",
      "uploadedUnix": "1526711714",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f68254db74fb18cf4be3ba0cdc918c79218bbb501e706e4b564373cd89fcdf98/analysis/1526711900/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jen%20and%20Morgan.%20Two%20Female%20Witcher%20Followers-91416-1-0.rar?fid=1000273340&ttl=1535881980&ri=8192&rs=8192&setec=dc43322832cae34ad5ad4ff3ac7eefa5"
    }
  ]
}