{
  "modId": 91426.0,
  "modName": "AceVampireHome Deutsch 1.4",
  "summary": "Dies ist die deutsche Version der Mod \"Ace Vampire Home\"",
  "descriptionHtml": "[b][color=#b6d7a8][size=6]Ace - Vampirheim[/size][/color]\n<br />\n<br />[color=#ffe599][size=5]Infos:[/size][/color][/b]\n<br />\n<br />Das ist die deutsche Version von \"[url=https://www.nexusmods.com/skyrim/mods/83842][/url][url=https://www.nexusmods.com/skyrim/mods/28414]Ace Vampire Home[/url]\"\n<br />Wenn euch dieser Mod gefällt gebt bitte \"[url=https://www.nexusmods.com/skyrim/users/5050404]Elias555[/url]\" ein Endorse :)\n<br />\n<br />Die Bilder stammen alle vom originalen Modauthor\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/28414-2-1355966173.jpg[/img]\n<br />\n<br />Benötigt Dawnguard und Update 1.8\n<br />\n<br />Willkommen bei Ace's Vampirheim!\n<br />\n<br />:: Beschreibung::\n<br />Dieser Mod ist ein Vampirhaus in den Bergen mit Blick auf Weißlauf. Alles, was zum Verzaubern, Basteln usw. benötigt wird, ist im Haus, alles, was Sie tun müssen, ist den Besitzer Ace und seine Wachen zu töten.\n<br />Es enthält einige neue Abflusszauber, Waffen und eine königliche Vampirrüstung mit einigen guten Verzauberungen in einem geheimen Raum.\n<br />Es gibt einen Raum, der dich in den meisten Städten in versteckte Bereiche teleportiert, nützlich für hungrige Vampire. Ein weiterer Raum mit ein paar Sklaven\n<br /> für dich auch zu essen.\n<br />Es gibt einen Sarg für dich und einen anderen Sarg für deinen Begleiter, egal ob sie ein Vampir sind oder nicht, sie können dort schlafen.\n<br />Ein Essensbereich, auch einige Schaufensterpuppen und leere Truhen. Der Blutkelch, der zu deinem Abflusszauber und einem Molag-Bal-Schrein beiträgt.\n<br />Ich habe wahrscheinlich ein paar kleine Dinge verpasst, aber das sind die wichtigsten.\n<br />\n<br />Die 2 Sprüche sind beide Abfluss-orientiert. Einer, der dem Spruch des Vampirfürsten ähnlich ist, aber nicht so mächtig und der andere ist ein Abflussrunenzauber. Ich habe sowohl auf Experten- als auch auf Master-Schwierigkeit getestet und das geht gut.\n<br />\n<br />Die Rüstung ist eine vollständige Reihe von der königliche Vampir-Rüstung sowie die Vampir-Kapuze. Es sollte die gleiche sein, die Serana trägt.\n<br />Selbst wenn du kein Vampir bist und einer sein willst, wird es dich infizieren, wenn du Ace und seine Gang angreifst, es sei denn, du benutzt nur Reichweite aus weiter Entfernung.\n<br />\n<br />:: Pläne::\n<br />Ich hoffe, den Besitzer mit seiner geheimen Ausrüstung mit dem geheimen Raum zu verbinden. Er plant, allein auf Dawnguard zu gehen. Ich dachte daran, einen Brief an einen Körper zu geben.\n<br />Wenn jemand einen Fehler findet, lassen Sie es mich wissen und ich werde mich darum kümmern. Wie auch immer du denken kannst, um den Mod zu verbessern, lass es mich wissen und ich werde versuchen, es umzusetzen.\n<br />Wenn jemand weiß, wie man den Marker unfähig macht, zu reisen, ohne den Ort zu entdecken, würde ich es begrüßen, wenn Sie es mir beibringen würden.\n<br />Dies ist mein erster Mod, aber ich habe es für 19 Levels getestet und ich hatte keine Probleme damit. Die Abflusszauber und die Rüstung sind tatsächlich nützlich.\n<br />Ich konnte mich gegen kleine, ziemlich viele Gegner behaupten, ohne den Aufschlag zu nehmen. Ich habe die Waffe zwar nicht benutzt, aber es sollte gut funktionieren.\n<br />Ich sollte Waffen für andere Arten von Vampiren hinzufügen, wenn irgendwer an ein gutes Modell denkt, um es zu benutzen, denn ich werde den Rest erledigen.\n<br />\n<br />:: Standort ::\n<br />Es liegt südwestlich von Weißlauf, aber Sie müssen den Weg den Berg hinauf von flusswald nehmen. Sie können den Marker sehen, da ich noch nicht herausgefunden habe, wie er sichtbar gemacht werden kann. Dies wird sich in zukünftigen Updates ändern.\n<br />\n<br />[color=#ffe599][size=5][b]Installation:[/b]\n<br />[/size][/color]\n<br />Für diese Mod wird die originale Datei Benötigt und muss überschrieben werden.\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/28414-1-1355668343.jpg[/img]\n<br />\n<br />[b][u][size=6][url=https://www.nexusmods.com/skyrim/mods/91097/]Andere Übersetzungen von mir[/url]﻿[/size]\n<br />[/u][/b]\n<br />[b]-&lt;(Start der Übersetzung´s Serie 25.04.2018)&gt;-[/b]",
  "categoryId": "67",
  "version": "1.4",
  "author": "Teraneck",
  "createdUnix": "1526750507",
  "updatedUnix": "1526750507",
  "containsAdultContent": false,
  "uploadedBy": "Teraneck",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273386",
      "name": "AceVampireHome Deutsch 1.4",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "151",
      "fileName": "AceVampireHome Deutsch 1.4-91426-1-4.zip",
      "uploadedUnix": "1526750434",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/916bd26ec46217dac4890e72104ddabaf473db98e559776c5fc1a0dca15ce0d5/analysis/1526750583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AceVampireHome%20Deutsch%201.4-91426-1-4.zip?fid=1000273386&ttl=1535882016&ri=8192&rs=8192&setec=44b5ef0db1417651944728baf7f59bde"
    }
  ]
}