{
  "modId": 9143.0,
  "modName": "Housecarls that arent lame",
  "summary": "Honestly I have always felt the house carls in this game to be annoying.  Creation Kit to the rescue!",
  "descriptionHtml": "Honestly I have always felt the Carls in this game to be annoying.  Creation Kit to the rescue!  I never imagined that all the house carls from the five major cities would be exactly identical!  Not only were they all generic, they shared the majority of their traits with the rest of the thugs and bandits of the world!  These guys are supposed to be special, a real credit to their home city.  Well now they are.\r\n\r\nChanges made to the house carls of; Whiterun, Markarth, Solitude, Windhelm and Riften.\r\n1. Aesthetics, simple changes to make each \\\"more appealing\\\".\r\n2. Custom combat styles.  Now they each have a unique method to their madness.\r\n3. \\\"Theme\\\" oriented starter gear.  Varies depending on house carl, can be redressed if new armor beats original\\'s rating.\r\n4. Unique items.  Each house carl has one, to two, custom weapon/armor/item that \\'may\\' drop \\'if\\' something unfortunate were to happen to them.  (I was all about killing Lydia, but to be honest she is much nicer to have around now that she has a head on her shoulders)\r\n\r\nDespite my hours of testing, after the hours of creating, there is bound to be something I missed.  Feel free to drop my a line if you find something (especially in the combat behaviors).  P.S.  Bethesda.. really? I mean really?  You give us GECK 1.5 and not a true tool?  Maybe I\\'m spoiled with the toys I use, but one has to wonder how \\\"just adding pop-up windows\\\" constitutes innovation.\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "TheRogon",
  "createdUnix": "1329046064",
  "updatedUnix": "1329046330",
  "containsAdultContent": false,
  "uploadedBy": "Rogon242",
  "primaryFile": null,
  "files": [
    {
      "fileId": "29537",
      "name": "Housecarls ESP",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Housecarls ESP-9143-1-0.7z",
      "uploadedUnix": "1329046330",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ae1c352b93311bcbce616251e71fb4dff6421b72cae75fba7f0badc62233f3c9/analysis/1406672876/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Housecarls%20ESP-9143-1-0.7z?fid=29537&ttl=1535768425&ri=8192&rs=8192&setec=7d57c68e7c042a15cb7a6ae9c2685993"
    }
  ]
}