{
  "modId": 9144.0,
  "modName": "AEterna Plate Armor Recolor",
  "summary": "I didn\\'t like standard plate armor color. It is too dull for me. I had to brighten it up and also changed the color of the fur pieces. See yourself.",
  "descriptionHtml": "[b][size=20]AEterna Plate Armor Recolor[/size][/b]\r\n\r\n[size=5]Introduction[/size]\r\n\r\nI know, I know... Maybe it\\'s not a very big surprise. You may say: Hey man, you could make something really new, we are sick of vanilla retexes, don\\'t you have CK now? Why this again?.. and the like. Let me explain. Recently I have spent more time playing Skyrim than usually (usually I devote more time e.g. for modding and learning 3ds max / Maya) and because I\\'ve been using plate armor since... two months maybe :-))), and because this armor I like very much (for me it is really interesting piece of work), this time I did what I\\'ve always wanted to do: to make this armor brighter and especially to make its fur pieces out of some white animal and finally make the last one much more distinct. So at last I hope I did it. That\\'s all. Simply I wanted to share this armor with you. If you like it and want me to further recolor or decorate one of my favorite armor in Skyrim game, please, let me know about it in comment section.\r\n\r\n[size=3][b]I can say like in comments: During creation of this small mod I wasn\\'t going to build something big and amazing. It\\'s just a retex which I made to make my Skyrim playing more pleasant for me. But after retexing I thought: Why not to share it with you? That is why this simple mod is here.[/b][/size]\r\n\r\n[size=5]Description[/size]\r\n\r\nThis is a much brighter version of plate armor. I didn\\'t change the resolution of textures, but if this initial version will be interesting for you, let me know and I\\'ll try to add some changes to it). Main main goal was to brighten the metal plates (that is why sometimes (but only sometimes) this armor looks nearly as made of snow). I haven\\'t tested it in dungeons yet, so please let me know, if the armor is too bright in the darker places. Also that is why I created two versions of the armor: bright and mild. If you generally like light, bright armors, test both versions and tell me what you think. The second thing I tried to obtain was more mono version of this armor type. Now the pieces of fur are white (like made out of some white fur animal). They are even brighter then the plates. I always wanted to add such effect to the plate armor: white distinct fur. And the last thing: my version of pate armor is not a unique item (I simply recognized it senseless). It means everybody in Skyrim who wear this type of armor, after installing this mod people will wear the new recolored version. \r\n\r\nLike I said for now you have two version of the recolored plate armor to choose:\r\n\r\n[size=5][b]Bright[/b] - It is my initial idea despite I don\\'t know how it will look in different places of Skyrim.[/size]\r\n\r\n[img]http://i.imgur.com/MPb06.jpg[/img]\r\n\r\n[size=5][b]Mild[/b] - It is little darker version if you will consider \\'Bright\\' version as too exaggerated for you.[/size]\r\n\r\n[img]http://i.imgur.com/ea3P1.jpg[/img]\r\n\r\n[size=5]Installation[/size]\r\n\r\nwith NMM (Nexus Mod Manager)\r\n\r\nIf you use NMM simply run it, then go to file section here in my Nexus corner, choose the mod version you like, click \\'Download with Manager\\'. Your running NMM should react. After downloading my mod should appear on your mod list in NMM. If you have latest version of the NMM, simply double-click my mod, otherwise use \\'Activates the selected mod\\' button on the left. It should activate my mod and NMM will inform you about it.\r\n\r\nIf you don\\'t use NMM then it\\'s a matter of adding / overwriting few files in your Skyrim game installation catalog. Locate your Skyrim game folder and unpack the RAR contents to it. It should work. But if your system asks you to overwrite the files, then it seems you have another plate armor mod already installed. If you want to save your existing mod then cancel the file copying operation at the moment. Locate Skyrim/Data/textures/armor/nordplate folder and do the copy of it. Then you can repeat the steps mentioned above and this time allow the system to overwrite files of your earlier mod.  \r\n\r\n[size=5]Uninstallation[/size]\r\n\r\nThe users of NMM: Run NMM. Select my mod and click \\'Deactivates the selected mod\\' (or \\'Deletes the selected mod\\' if you don\\'t want it anymore)\r\n\r\nTo uninstall my mod manually simply delete the files:\r\n\r\n...Skyrim/Data/textures/armor/nordplate/nordplatebootsf.dds\r\n...Skyrim/Data/textures/armor/nordplate/nordplatef.dds\r\n...Skyrim/Data/textures/armor/nordplate/nordplateglovesf.dds\r\n...Skyrim/Data/textures/armor/nordplate/nordplatehelmf.dds\r\n...Skyrim/Data/textures/armor/nordplate/nordplatem.dds\r\n\r\nIf you had your previous version of plate armor saved somewhere, of course you can restore it now.\r\n\r\nThat\\'s all, I think.\r\nThanks for reading and sorry for my English.\r\naeterna826",
  "categoryId": "54",
  "version": "1.0",
  "author": "aeterna826",
  "createdUnix": "1329046095",
  "updatedUnix": "1329046810",
  "containsAdultContent": false,
  "uploadedBy": "aeterna826",
  "primaryFile": null,
  "files": [
    {
      "fileId": "29540",
      "name": "AEterna Plate Armor Recolor - Bright",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1502",
      "fileName": "AEterna Plate Armor Recolor - Bright-9144-1-0.rar",
      "uploadedUnix": "1329046595",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ad6d7c80877c366b37dc1a4e53c602c5259848432b2d24c82873afc62ed51001/analysis/1406672943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AEterna%20Plate%20Armor%20Recolor%20-%20Bright-9144-1-0.rar?fid=29540&ttl=1535768426&ri=8192&rs=8192&setec=bfc4d39952717524b6f603b22882117a"
    },
    {
      "fileId": "29546",
      "name": "AEterna Plate Armor Recolor - Mild",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1477",
      "fileName": "AEterna Plate Armor Recolor - Mild-9144-1-0.rar",
      "uploadedUnix": "1329046810",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/00044f97f0b38985e1ba10ff1fc95d75070e2c80dd11fd86bdb0885258568e17/analysis/1406672985/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AEterna%20Plate%20Armor%20Recolor%20-%20Mild-9144-1-0.rar?fid=29546&ttl=1535768426&ri=8192&rs=8192&setec=9b8da16d9f515ce4cd29bf2ded55d8d5"
    }
  ]
}