{
  "modId": 91458.0,
  "modName": "BookUI Plus - DELETED",
  "summary": "An enhanced book interface, add two features.<br />1: Can turn multiple pages one time, no need to waste your time on words you already  read.<br />2: Add page numbers, then you can know where you have left off.",
  "descriptionHtml": "If you are a reader like me, like read books in beautiful places in Skyrim, and added some big books into game, then problems suddenly jumps out. \n<br />\n<br />When read very long fictions, you are not likely to finish it in one run. When you pick it up next time, you will turn through pages you already read ONE  BY ONE, along with that leisurely turning animation which last FOREVER.\n<br />\n<br />This  mod will be your last potion restore from that madness. With it, you can quickly find where you left off last time, or just glimpse some books which you are not really interested. And little figures rested at down-right corner of each page always remind you where you are.\n<br />\n<br />[b]Requirement[/b] : SKSE 1.7.3\n<br />\n<br />[b]Installation[/b]: Just put BookUI+.esp, Interface folder and Scripts folder into your Skyrim&#92;Data folder.\n<br />\n<br />[b]How to use:[/b] When reading book, press  [b][u]Alt[/u][/b]  or [b][u]Ctrl[/u][/b] to select how many pages you wanna turn. There is 4 level, 1(default ), 10, 30, and 100.\n<br />\n<br />[b]Compatibility[/b]: Shouldn't be conflicted with any mod, if they do not overwrite  Interface&#92;book.swf  and bookmenu.swf files.\n<br />\n<br />[b]Permissions[/b]: If you plan to include this little mod into your own published mod, you are free to do that with my best wishes. but a credit to me is honestly appreciated~\n<br />\n<br />[b]Credit[/b]: If not with the great SKSE,  and the source file decompiled  and shared by Mardoxx  of SkyUI team, do a serious reading in Skyrim would ever be a pain of ass, thanks for your great works ! And sorry to everyone of my funny English.",
  "categoryId": "42",
  "version": "1.0",
  "author": "rabbitgeeks",
  "createdUnix": "1526912536",
  "updatedUnix": "1526912536",
  "containsAdultContent": false,
  "uploadedBy": "rabbitgeeks",
  "primaryFile": null,
  "files": []
}