{
  "modId": 91483.0,
  "modName": "Ferran Racemenu Preset",
  "summary": "Hi! This is the first file I've ever uploaded to Nexus after years of lurking. If there's something wrong with the file please, please let me know so I can fix it. There's bound to be some errors the first time around since I'm so new to this, even if it is just a preset file.",
  "descriptionHtml": "So as long as I've been playing Skyrim I've always avoided playing male characters because I'm a picky son of a bitch. Creating beautiful and unique female characters has gotten remarkably easy because of the huge amount of mods out there for them, but there was always something about the males that looked....off. And no matter how much I played around with Racemenu and cosmetic mods, they never quite looked right. Well, after lots of mods and tweaking, I finally have a male character I actually feel proud of. \n<br />So this is Ferran. He's probably not going to be everyone's cup of tea because he's not exactly a rough, grizzly Nord. But in my opinion he's not completely un-lore friendly either. If you want him to be more rugged and Skyrim-y looking, you can always use a different face or body texture than what I've used, give him different hair, a full beard, etc. I just really wanted to play as a rouge-ish, pretty boy. [color=#000000] [/color][color=#f4f4f4]¯&#92;_(ツ)_/¯ [/color]\n<br />\n<br />Ferran would not be possible without the work of modders much, MUCH more talented than I am. If you want him to look like he does in the screenshots, here are the mods I used:\n<br />-[url=https://www.nexusmods.com/skyrim/mods/49716]Young Male Face Texture[/url]\n<br />-[url=https://www.nexusmods.com/skyrim/mods/79266/]KS Hairdos Lite[/url]\n<br />-[url=https://www.nexusmods.com/skyrim/mods/56056/]Mikan Eyes[/url]\n<br />-[url=https://www.nexusmods.com/skyrim/mods/58443]Skysight Skins[/url] (for the body, install this first then override the face textures with the ones from Young Male Face Texture) \n<br />-[url=https://www.nexusmods.com/skyrim/mods/30411/]Brows[/url]\n<br />-[url=https://www.nexusmods.com/skyrim/mods/86208/]Freckle Mania 2[/url]\n<br />-[url=https://www.nexusmods.com/skyrim/mods/50032]KJ Tattoos[/url]\n<br />-[url=https://www.nexusmods.com/skyrim/mods/49279/]Northborn Scars[/url]\n<br />\n<br />These aren't required at all, but Ferran won't look the same without them. [url=https://www.nexusmods.com/skyrim/mods/29624]Racemenu [/url] is obviously required. \n<br />\n<br />To use:\n<br />-make sure you have Racemenu \n<br />-go to your Skyrim folder (not the one in My Games, the one where your mods are) ---&gt; Data ---&gt;SKSE ---&gt; Plugins ---&gt; Chargen---&gt; Presets and drop the Ferran.jslot file in there\n<br />-go in game, type showracemenu into the console, go to the presets tab of racemenu, press F9 and click on the Ferran preset\n<br />-Bingo!\n<br />\n<br />In the screenshots I've got my two favorite follower mods, [url=https://www.nexusmods.com/skyrim/mods/86872]Kaidan[/url] and [url=https://www.nexusmods.com/skyrim/mods/40960]Inigo[/url] (go check them out, they're amazing). He's wearing Dreamburrow's [url=https://www.nexusmods.com/skyrim/mods/39983/]Regal Huntsman Armor[/url]. I got a ton of inspiration from Dreamburrow's male characters. \n<br />\n<br />Feel free to use this preset however you like. Use him as a base for your character, change everything about him, make an evil vampire version of him, idc. I'd love to see what you do with him! (Although that sounds like something I'll regret)",
  "categoryId": "114",
  "version": "1.0",
  "author": "maxoftheplants",
  "createdUnix": "1527014985",
  "updatedUnix": "1527014985",
  "containsAdultContent": false,
  "uploadedBy": "maxoftheplants",
  "primaryFile": null,
  "files": []
}