{
  "modId": 91509.0,
  "modName": "Humanoid Giants",
  "summary": "Replaces 1 of the 3 vanilla giants into a male body version giant and replaces one of the other of the 3 into a female body version. Left the last one as is except changed the name from giant to \"Elder Giant\" to keep some lore in there and keep one variant left as pure creature type.",
  "descriptionHtml": "This is an unfinished mod but it works mostly. The only thing not right with it is the hitbox of the new giants not scaling up to the new scale size of each npc. Fixing this Bethesda scaling bug with NPCs can be a huge mess. One of us might get around to working on this fix at some point but we decided to upload as is and let people have fun with it now and maybe someone out there is talented enough to get this setback corrected. Don't worry, you can still kill them. But if using a bow, you will have to aim at their feet and ankles to register the hit.\n<br />I guess you can consider this a modder's resource but will work as is with the exception of the hitbox issue.\n<br />The male, if looted or whatever else might make them naked in your game, will have a hole in the private area if not using SOS.\n<br />This is an unfinished mod. Free to all for whatever. Just mention Team Ladybug if you post it anywhere. And because this is trash free for the taking, please don't demand more pictures, changes, or for me to carry it out to your truck for you. Don't be jerks. I am not forcing you to take this gift so don't force me to give it in a certain way.\n<br />\n<br />Please see credits tab for a list of credits and resources used.\n<br />\n<br />\n<br />UUNP body requires HDT and compatible skeleton.",
  "categoryId": "83",
  "version": "1.0",
  "author": "Team Ladybug",
  "createdUnix": "1527122123",
  "updatedUnix": "1527122123",
  "containsAdultContent": true,
  "uploadedBy": "AndragonFirefly",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273678",
      "name": "Humanoid Giants",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26660",
      "fileName": "Humanoid Giants-91509-1-0.rar",
      "uploadedUnix": "1527122053",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/92de86d9585ef1229eb3fc17ba8d6d422e474248f286763a05e68544b0449eb2/analysis/1527122255/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Humanoid%20Giants-91509-1-0.rar?fid=1000273678&ttl=1535882127&ri=8192&rs=8192&setec=5060f649ab3269a9a7d3f674237d9346"
    }
  ]
}