{
  "modId": 91503.0,
  "modName": "Solstheim_SkaalCottage - DELETED",
  "summary": "Solstheim_SkaalCottage called Divayth Cottage is a 4 bedroom Cottage north of Skaal Village. Has room for 2 kids and 2 followers or 4 followers. This home is compatible with Hearthfire multiple adoptions if the 2 kids option mode is used. This home is designed around the DLC2 storyline. It includes a room devoted to Hermaeus Mora.",
  "descriptionHtml": "Divayth Cottage is by the water just north of Skaal Village.  The Divayth cottage mod replaces my Alvis Cottage mod. If you have Alvis Cottage, you need to remove it before dowloading this mod, and don't use this mod with an existing save game that had Alvis Cottage. They both have scripts and Divayth is a completely new file with a different name. You need to start a new game. Divayth Cottage provides the following for crafting:Cooking potOvenForgeSmelterTanning RackArmor WorkbenchWeapon sharpening wheelEnchanterAlchemy Station Staff enchanterSpider scroll machineCustom linked containers safely store everything you need to store. The cottage has kitchen eating area, kids bedroom first floor and second floor (optionally can be converted for followers), and 2nd floor master bedroom room. The lower level is part of the same cell and has crafting, bathing area and a bedroom for two follower. There is a secret room in this house that will display your black books.What the home includes:25 weapon racks (5 in secret room)6 COA plaques (2 in secret room)11 weapon plaques (1 in secret room )3 custom bookcases that have unlimited book storage3 Standard bookcases (1 secret room)5 Mannequins (1 in secret room)Display holders for three DLC2 Dragon Priest Mask and the DLC2 Claw.Display holder for Miraak Mask (secret room)6 Hearthfire plant soilsCustom storage containersTeleportalChange Appearance MirrorA custom spell has NPC followers remove armor when entering the bathing area or sleeping in the Master bed. A black soulgem has a magical glow when the spell is active over the bed. It can be toggled off by interacting with the soulgem on the nightstand in the Master bedroom. The House key is in a link chest next to the front door. Look at the keys hanging on the outside wall by the front door. If you use a mod for followers to stay in your home, there is a bedroom with two beds in the lower lever. The lower level also has a portal that takes you to the four stones and TelMithryn. If you want to move your family here use the Custom Family Home Mod or Hearthfire Multiple Adoptions to move them.  If you use Hearthfire, it will state the home supports two children beds ( if children beds are selected).  If you want no kids and four followers, there is a button on the wall that switches kid rooms to adult follower rooms. In this case don't use the bless this home spell from the Hearthfire multiple adoptions mod. House mods do not control followers. Most followers do not have a sleep package. Use Amazing Followers or some other mod designed to control followers to get them to sleep.There is a secret room where you can store your Black Books see if you can find it.Final note: House mods are stand-alone mods and are not compatible with other house mods next two it. If you like the mod give it a thumbs up. Recommended Mods:1. My Home is your home Mod2. Custom Family Home Mod3. HearthFire Multiple Adoption4. Spouses Can Live Everywhere5. Multiple Floors Sandboxing6.Mannequin AI Fix7. USLEEPMy other mods:Lakeside Riften Manor https://www.nexusmods.com/skyrim/mods/84675Winterhold College Hideout https://www.nexusmods.com/skyrim/mods/82907?tab=logsWhiterun Home 4_5 https://www.nexusmods.com/skyrim/mods/82557",
  "categoryId": "67",
  "version": "1.0",
  "author": "JohnnyQuest101",
  "createdUnix": "1527081886",
  "updatedUnix": "1527081886",
  "containsAdultContent": false,
  "uploadedBy": "JohnnyQuest101",
  "primaryFile": null,
  "files": []
}