{
  "modId": 91515.0,
  "modName": "Ara - Standalone Follower and BJD Skin Assets - DELETED",
  "summary": "Overlays ready to be applied to your desired diffuse and normal maps to give a character the look of a ball-jointed doll, along with the character I designed them for.",
  "descriptionHtml": "[color=#ff0000][b][size=4][color=#ffffff][size=6]The Follower -\n<br />\n<br />\n<br />\n<br />The Skin Assets -[/size][/color]\n<br />\n<br />Please ask before using these in a mod of any sort. I might not say yes if it's just a random follower, idk. I'm hesitant to upload these because I'm kind of possessive of them as I made them for an original character so I would appreciate people respecting that! I mostly want to make these public for other screen-archers and (committed) character designers rather than people who crank out waifus with big tits and no substance.\n<br />\n<br />[size=6][u][i]Do not redistribute or re-upload anywhere[/i][/u].[/size]\n<br />\n<br />[/size][/b][size=4][color=#ffffff][size=3]I'm uploading these not as skins but as PSDs because they are entirely of my own creation and require some basic knowledge of image editing to be put to proper use within the game. I can't make base skins to apply them to but learning how might be fun if possible.[/size][/color][/size][/color]\n<br />\n<br />[size=4][b]How to Use:[/b][/size]\n<br />\n<br />[list=1]\n<br />[*]Create a copy of the diffuse and normal map you want to work with so you don't mess up the original skin, esp. if it's your default skin.\n<br />[*]Open the files in Photoshop, GIMP, or other image-editing programs that can edit .dds files. The first two mentioned require a plugin to do so.\n<br />[*]Resize the assets to the same size as the diffuse and normal maps you're using respectively. By default, the diffuse is 8K and the normal is 4K.\n<br />[*][b][color=#ff0000]These designs were made for UNP family skins and bodies. Overlaying them over CBBE skins will require adjustment for the intended effect.[/color][/b]\n<br />[*]With the normal map, set the designs I've made to overlay and / or mess with the opacity. Otherwise they'll be too intense in-game.\n<br />[*]Save the diffuse with DXT5 that has an alpha (I use interpolated.) Save the normal with \"8.8.8.8 ARGB 32 bpp | unsigned.\"*\n<br />[*]Unless you want all the female characters in-game to use these assets for some reason, use a mod like [url=https://www.nexusmods.com/skyrim/mods/8720/]Custom Races[/url]﻿ or [url=https://www.nexusmods.com/skyrim/mods/37546]BodyChange[/url]﻿. I prefer\n<br />BodyChange because I don't need to make race adjustments in the CK for everything to function properly with my other mods (like hair and eyes.)\n<br />\n<br />\n<br />[/list][size=2]\n<br />*These are the settings that work for me. It might depend on your system. Google is your friend.\n<br />[/size]\n<br />[size=3]You've now gained some knowledge of editing Skyrim textures! Congratulations. Have a field day.\n<br />\n<br />Updates may be made in the future to improve how these look or add more detail. P.S. these were inspired by [url=https://www.nexusmods.com/skyrim/mods/34514/?]this mod[/url]![/size]",
  "categoryId": "29",
  "version": "1.0",
  "author": "CausticWitch",
  "createdUnix": "1527140842",
  "updatedUnix": "1527140842",
  "containsAdultContent": false,
  "uploadedBy": "pseudoskull",
  "primaryFile": null,
  "files": []
}