{
  "modId": 91551.0,
  "modName": "re-upload Hepsy Hair CC",
  "summary": "A sexy hairstyle pack with some really nice options. Compatible with Apachii, maybe all hair mods?",
  "descriptionHtml": "Okay! this is to address those people who are seeing my headliner and thinking \"is this hair included too?\" No. its not. its right HERE:\n<br />https://www.youtube.com/watch?v=nXBKQRmT4pQ\n<br />You will need all of this to get it running: Requirements: - Heels Sound 1.3 + - the game crashes without it - Body CBBE or UNP - RaceMenu (last version) - HDT Physics Extension - SKSE 1.7.3 (it says you need the skeleton too, but you do not)\n<br />\n<br />Now then, for hair in eyes effect. Obviously you need a hairstyle with low hanging bangs for starters. several in this mod.\n<br />You will want to use ECE to shorten the height of the face in order to get the hair to cover the eyes. In racemenu go to face then scroll down to face height. Mine is set to -1.17 which is likely more than low enough for anyone. There is also a couple hair styles within this mod which can be used in that way as well. I have even left a picture in the screens section that shows the process in action, and the slider that you need to modify. Go look. I hope that clears things up. Last thing before we move on. you can run ECE and Racemenu together without real conflict. install ECE then install Racemenu. You now have the option to lower the face height to achieve hair in eyes effect, while still being able to use presets. You're welcome. (Why is only her head in the picture? because shes f***ing SHORT) Now on to the mod!\n<br />\n<br />Original message sent to me by Waeq17 reads as follows- \n<br />Also here is the quote from Hepsy I will contact a Nexus Moderator first if you want to ensure this is sufficient..\n<br /> \n<br />\"Hello.\n<br /> \n<br />My mods is free to use for other mods. (No permission needed.)\n<br />I do not know who is your friend, but no problem.\n<br /> \n<br />Thanks!\"\n<br /> \n<br /> \n<br /> \n<br />He said \"for other mods\" but I hope that is just lost in translation. I have now specified more clearly I mean as a re-upload of his work.\n<br /> \n<br />-end quote\n<br />\n<br />\n<br />Now I finally get to shout at the top of my voice WELCOME NEXUS USERS! PARTAKE OF THESE STYLISH HAIRDOS ONCE MORE! WORKS FINE WITH APACHII! \n<br />\n<br />I am in no way responsible for the creation of this mod and it remains strictly here on the nexus.\n<br />This mod was uploaded purely for the sake of keeping it for posterity, for the sake of the Nexus at large.\n<br />\n<br />The screen shots are not perfect but I think show you what to expect. It is possible to retexture the bows, if you know how.\n<br />\n<br />\n<br />All credit to author Hepsy. Thank you for your excellent mod.\n<br />Extra credit goes to Waeq17 for asking Hepsy permission. as well as a nod to Zhoulia who also contacted me trying to help. thank you both.\n<br />\n<br />I want to see screenshots please, send me some to put up here.",
  "categoryId": "26",
  "version": "1",
  "author": "Hepsy",
  "createdUnix": "1527313714",
  "updatedUnix": "1527313714",
  "containsAdultContent": false,
  "uploadedBy": "Gethesmain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273798",
      "name": "Hepsy hair cc",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11730",
      "fileName": "Hepsy hair cc-91551-1.7z",
      "uploadedUnix": "1527313692",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/92463a1c343a1bd7f4a77fd52d3040959080e1f1d10d9643b25a8f1a29799cce/analysis/1527313843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hepsy%20hair%20cc-91551-1.7z?fid=1000273798&ttl=1535882198&ri=8192&rs=8192&setec=3b1ceebef45332bc708ab1b7a67f20ab"
    }
  ]
}