{
  "modId": 9158.0,
  "modName": "Breezehome with basement no loadingscreen obsolete",
  "summary": "New Version:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10857",
  "descriptionHtml": "New Version:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10857\r\n\r\nUpdate 8: No light issues anymore!\r\n\r\nUpdate 7: What could be the reason why it is at the cooking place dark unless looking at the ceiling? Solved - Silly damn thing, edit the z-values from the light sources and then reedit them to previous values. YES, it\\'s silly! But works!\r\n\r\nUpdate 6: Advanced Mannequins work now! (navmesh)\r\n\r\nUpdate 5: It is ready! Hope you enjoy it!\r\n\r\nUpdate 4: Need help! What could be the reason why \\\"the same\\\" bookshelf works in the unownedcell but not at breezehome?\r\n\r\nUpdate 3: Corrected somme clipping failure. I think the follow is a nice idea: I have some complicated things (like bookshelves and weapon/shield holders) stored in front of the house, you can copy them and paste where you want.\r\n\r\nUpdate 2: Deleted the invisible object found by pressing F4 in CK (Collision Gemetry). \r\n\r\nUpdate: Solve problem by lowering the basement.\r\n\r\n(Need help for the two light sources!)\r\nI extend Breezehome with the CK to a basement. But there arre two annoying light sources (one of the campfire above and the other I don\\'t know, watch the screenshots specially picture 5) How I  can make it that the lights aren\\'t visible in the basement?\r\n- Today I found it out, if you delete original things they are only invisible in the CK ingame they are outside the interiors, so the left light in the picture was only a deleted light! So only change the values from the original unwanted lights so: Radius 0 Fade 0 and maybeShodow Depth 0 ( so I made it in my mod!) \r\n\r\nTHX",
  "categoryId": "82",
  "version": "",
  "author": "fruitgnome",
  "createdUnix": "1329051327",
  "updatedUnix": "1329051327",
  "containsAdultContent": false,
  "uploadedBy": "fruitgnome",
  "primaryFile": null,
  "files": []
}