{
  "modId": 91606.0,
  "modName": "Skin Decor - Ball-Jointed Doll",
  "summary": "PSD files ready to be applied to your preferred skin with an image editor capable of editing .dds images, to give the appearance of a ball-jointed doll.",
  "descriptionHtml": "[size=3]Hello! Since learning how to properly edit Skyrim diffuse and normal maps to give my characters unique appearances I wouldn't be able to achieve otherwise, I want others to be able to make cool-looking characters as well, so I'm sharing what I've made. I would apply this to a skin buut idk how to make a skin from scratch and it sounds like something that would be a pain in the neck. Utilizing these requires a 'lil bit of photo-editing knowledge, so have either GIMP or Photoshop ready and prepped with their respective .dds plugins.[/size]\n<br />[size=3]\n<br />[size=5][b]How to Use:[/b][/size]\n<br />\n<br />[/size][list=1]\n<br />[*][size=4]Open the .psd files along with the diffuse and normal (msn) maps of the skin you want to apply these to.[/size]\n<br />[*][size=4]Re-size my .psd files to the same size as the diffuse and normal maps respectively. They're big by default.[/size]\n<br />[*][size=4]Duplicate or copy the layers from my .psd files over the maps of the skin. [b]These were made for a UUNP skin [/b][/size]\n<br />[size=4][b]so some adjustment will be required if you want to use them for a CBBE-based skin. The details on the\n<br />diffuse and the normals must align for them to work properly!\n<br />[/b][/size]\n<br />[*][size=4]For the normal map, set my layer to overlay, otherwise it will be too intense and will look weird in-game.[/size]\n<br />[*][size=4]I save the diffuse as DXT5 interpolated alpha and the normal as \"8.8.8.8 ARGB 32 bpp | unsigned.\"[/size]\n<br />\n<br />[*][size=4]Unless you want everyone in-game to use this new skin for some reason, go into the Skyrim files and replace [/size]\n<br />[size=4]the default skins of a mod like [url=https://www.nexusmods.com/skyrim/mods/37546]Body Change[/url]﻿* or [url=https://www.nexusmods.com/skyrim/mods/8720/]Custom Races[/url]﻿.[/size]\n<br />[/list][size=2]\n<br />[i]*I prefer and recommend Body Change as it allows me to name things and doesn't require customization of the races in the CK.[/i][/size]\n<br />\n<br />[size=3]And there you have it! That should be it. Future plans probably involve making a CBBE version and...a male version?\n<br />\n<br />Currently there are squiggly parts that I think are due to polys on the mesh rather than something I can easily fix myself. Sorry.\n<br />\n<br />The skin that I put this over in the screenshots is [url=https://www.nexusmods.com/skyrim/mods/51602/]Fair Skin Complexion[/url]﻿. Thank you for reading and I hope this is enjoyed![/size]",
  "categoryId": "82",
  "version": "1.0",
  "author": "CausticWitch",
  "createdUnix": "1527570939",
  "updatedUnix": "1527570939",
  "containsAdultContent": false,
  "uploadedBy": "pseudoskull",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273987",
      "name": "Skin Decor - Ball-Jointed Doll (UUNP)",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "391",
      "fileName": "Skin Decor - Ball-Jointed Doll (UUNP)-91606-1-0.rar",
      "uploadedUnix": "1527570737",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/59d26418813db55fc2ab358c88d8968158ea8b817e537f3a537ba8edb8db5ad0/analysis/1527570844/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skin%20Decor%20-%20Ball-Jointed%20Doll%20%28UUNP%29-91606-1-0.rar?fid=1000273987&ttl=1535882288&ri=8192&rs=8192&setec=f1a481863b583da3bd11068c63e01bde"
    }
  ]
}