{
  "modId": 91602.0,
  "modName": "Dark Marauder mace Saint tools",
  "summary": "Billyro created this awesome mace. I wanted one with a darker theme. <br />Still need his mod, retex only.",
  "descriptionHtml": "Sure, Ruth has The legendary Flamberge; The blade made from metal that will never cool and thus is a natural fire weapon. it slices and dices like nothing else.\n<br />\n<br />However, blunt objects do their own personal kind of damage. You see, if you cut the dragons tail off, it hurts at the stump, but the tail is severed and feels no pain. If instead you crush the tail to a pulp... well then all those bones and destroyed flesh are still a part of ol' scaley then. Let him lick THOSE wounds.\n<br />\n<br />Flamberge aside, Secondly, a very fine sharp sword can cleave through bones of skeletons and drauger, but a sharp sword must be maintained. Crushing with the larger surface area of a mace is better for this too.\n<br />\n<br />Finally, some of these warriors don't even have a sneak button. Ruth doesn't.\n<br />https://www.neusxusmods.com/skyrim/mods/78036\n<br />\n<br />Let alone a Lockpick button. Ruth would never even consider to do something like that.\n<br />https://www.nexusmods.com/skyrim/mods/55285/\n<br />\n<br />So therefore we need a MACE! Not just any mace, a very FINE mace. The gothic Marauder mace is a veritable can opener of the ancient world. I give you a darkened version with a little deeper scarring on the weapons faces. The pommel of the mace features the artichoke crest of Ruthulas family.\n<br />\n<br />thanks to billyro. you will still need his awesome mod (so you better endorse it!)\n<br />https://www.nexusmods.com/skyrim/mods/79035",
  "categoryId": "55",
  "version": "1",
  "author": "Gethesmain",
  "createdUnix": "1527558637",
  "updatedUnix": "1527558637",
  "containsAdultContent": false,
  "uploadedBy": "Gethesmain",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000273978",
      "name": "dark marauder",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1811",
      "fileName": "dark marauder-91602-1.7z",
      "uploadedUnix": "1527558619",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/83987da394f5283897a5d2a0f67d20e3c1fcec6710a7d6a4a48a550b21b979d9/analysis/1527558729/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/dark%20marauder-91602-1.7z?fid=1000273978&ttl=1535882283&ri=8192&rs=8192&setec=8289605c48f838d74dbfa4d78003dfde"
    }
  ]
}