{
  "modId": 91648.0,
  "modName": "Armonizer Merged-Compatibilized-Repaired",
  "summary": "Hopefully a one-time upload. Repairing Armonizer, the long popular armor mix-up and compilation, for the modern Oldrim modder. Requires USLEEP.",
  "descriptionHtml": "[center]﻿[img]https://staticdelivery.nexusmods.com/mods/110/images/65163-1-1430165203.png[/img]﻿[/center]\n<br />\n<br />Hopefully a one-time upload. Repairing Armonizer, the long popular armor mix-up and compilation, for the modern Oldrim modder. Requires USLEEP.\n<br />\n<br />Ketaroz compiled the original Armonizer project and put forth amazing work. Eventually his mods went cold, and Arahat took up the mantle of combining them into one place - with USLEEP and CCOR compatibility built in. But the file apparently doesn't work for the vast majority. One commentor, rad19dym, suggested a fix that I attempted, and it has so far worked where Arahat's native file has failed.\n<br />\n<br />USLEEP is REQUIRED, as are the original \"Armonizer Armors Pack\", and the \"Armonizer Armors Pack V3\" for their files; you may leave their ESPs and ESMs deactivated EXCEPT FOR Ketaroz's Armonizer Armor Pack \"Ket_Armonizer_V2.esm\".\n<br />\n<br />CCOR is not required, per my testing, it merely makes the necessary recipe / item adjustments to accommodate CCOR if not installed. If CCOR is not installed, no issues will arise, save perhaps some unintuitive recipes.\n<br />\n<br />I wanted to use this for an incredibly heavily modded playthrough where every esp slot will be greatly necessary. Though, I ended up finding a more efficient option without using Armonizer, the fact that I was able to make this work - at least enough for my limited testing thus far - made me think that this should be shared with the greater community. I am sentimental towards the old mashup / compilation pack, and want people to experience it in their games for years yet. So, if this can help someone use the pack, then good.\n<br />\n<br />This was done in a few minutes with TES5edit. I rewrote the error-causing records with the functioning ones in USLEEP. I made no other changes, and loaded no other files in the process. I am a long time mod-player, maker of small personal esps, and a student of computing; but I am by no means a proper scripter, programmer, or systems engineer. If I can help in some way in the future with this file, I hope I can. If this goes dormant in the meantime, I'm very sorry for the trouble.\n<br />\n<br />[b]-=-=-=-=-=-=-=-=-=-[/b]\n<br />\n<br />[b]INSTRUCTIONS:[/b]\n<br />[list]\n<br />[*]Ensure you have downloaded and correctly installed the Unofficial Skyrim Legendary Edition Patch (USLEEP)\n<br />[*]Download Armonizer Armors Pack, and install it either manually or through your mod manager of choice.\n<br />[*]Download Armonizer Armors Pack V3, and install it either manually or through your mod manager of choice.\n<br />[*]Deactivate their ESPs if they had been activated at any point, leave only the \"Ket_Armonizer_V2.esm\" activated.\n<br />[*]Download this mod (Armonizer Merged-Compatibilized-Repaired), and install it either manually or through your mod manager of choice.\n<br />[*]I would REALLY suggest a manual download, honestly. Just download the file, extract the esp from the archive, and drop it into your Skyrim Data folder.\n<br />[*]Activate this ESP in your load order.\n<br />[/list]\n<br />[b]-=-=-=-=-=-=-=--=-=-[/b][b]\n<br />\n<br />[/b][b]COMPATIBILITY:[/b]\n<br />[list]\n<br />[*]Look at this clip: https://www.youtube.com/watch?v=DNeikvoqQ-s\n<br />[*]No, but really, I am not sure. I hope it works like Armonizer did. Even then, it might've had issues back then.\n<br />[*]Also, I haven't tested it very much yet. It's loaded the game, but I haven't strenuously tested every armor.\n<br />[*]You have been warned.\n<br />[/list]\n<br />[b]-=-=-=-=-=-=-=--=-=-[/b]\n<br />\n<br />\n<br />You can find [b]Arahat[/b]'s modpage here: https://www.nexusmods.com/skyrim/mods/81642\n<br />You can find[b] Ketaroz[/b]'s first modpage (Armonizer Armors Pack) here: https://www.nexusmods.com/skyrim/mods/81642\n<br />You can find [b]Ketaroz[/b]'s second modpage (Armonizer Armors Pack V3)  here: https://www.nexusmods.com/skyrim/mods/39229\n<br />You can find [b]Rad19dym[/b]'s nexus profile here: https://www.nexusmods.com/skyrim/users/21231444\n<br />\n<br />Just as well, these are the mentions that I can find that Ketaroz had left for those that had contributed to his efforts!\n<br />[b]ActusReus[/b] (Northman Armours - Credo StandAloneMod &amp; Plate Armours - Credo StandAloneMod)\n<br />[b]FrankDema[/b] (Nordic Conqueror Armor &amp; Stormcloak Explorer Armor &amp; Nordic Ranger Outfit)\n<br />[b]Jojjo[/b] (Frostmourne and Lich Kings Armor)\n<br />[b]mancika[/b] (Templar Set)\n<br />[b]Northborn[/b] (Fur Hoods HD)\n<br />[b]OmegaRed99[/b] (Omegared99 - Armor Compilation)\n<br />[b]Teh-Husky[/b]  (Morrowind Armor for Skyrim)\n<br />\n<br />Given Arahat's modification of Ketaroz's work, I had assumed permission was given. If this is revealed to not be the case, I will remove this file. Similarly, I imagined that Arahat would respect his work being treated similarly, but if I am wrong, I will remove the file. Rad19dym shared his fix freely, I am merely publicizing it; if he would prefer me not to do so, I will remove the file.\n<br />\n<br />You may do as you please, within bounds of the law, with these files. [b]You DO NOT need to credit me[/b], as I legitimately did not do anything but click seven times after opening up TES5Edit. Just the[b] actual authors[/b] (Ketaroz, Arahat, Rad19dym), and the[b] armor donators[/b] where appropriate.",
  "categoryId": "95",
  "version": "1.0",
  "author": "Ketaroz-Arahat-Rad19dym",
  "createdUnix": "1527749524",
  "updatedUnix": "1527749524",
  "containsAdultContent": false,
  "uploadedBy": "Dominator046",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000274110",
      "name": "Ket_ARMONIZER_LListsNPC_EDIT",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "102",
      "fileName": "Ket_ARMONIZER_LListsNPC_EDIT-91648-1-0.zip",
      "uploadedUnix": "1527749477",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/912489fa9c5162f306ccceda7fcc806e2d882b630032e0d3ea58b619fa027667/analysis/1527749582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ket_ARMONIZER_LListsNPC_EDIT-91648-1-0.zip?fid=1000274110&ttl=1535882344&ri=8192&rs=8192&setec=62d91191523865e3f6745fe5ce447dfb"
    }
  ]
}