{
  "modId": 91662.0,
  "modName": "GCO Teaser - Van Gogh's Eyes ALPHA RELEASE",
  "summary": "I'm such a tease, I know. Eye replacement textures that will give realistic shine and much more depth to the residents of Skyrim.",
  "descriptionHtml": "I know, I'm sorry. GCO's alpha still isn't ready for you guys yet... But we're getting there! (I swear, I have tweaking issues... But the longer I spend tweaking, the better they get! So don't worry... You'll be getting quality material, unlike from RWoS. They are coming very, very soon!)\n<br />Until then, these are the eyes that will be released with GCO. These are ALPHA and may have some issues, as I haven't had a lot of time to game test. But on Lena, they looked good enough to be released as a little tease.\n<br />\n<br />[center]﻿[/center][center][img]https://media.giphy.com/media/g4h80oFEYP528/giphy.gif[/img][/center]\n<br />\n<br />\n<br />[center][size=4][b]Screenshots do not do these eyes justice.[/b][/size] \n<br />[size=1]   ﻿   ﻿   ﻿   ﻿   ﻿   ﻿Or maybe it's just my crap shots, lulz[/size]. \n<br />[color=#00ffff][size=3][b]Please![/b][/size][/color] Try these out for yourself before knocking them. \n<br />\n<br />[b][size=4]Upload your own screenshots! [/size][/b]\n<br />That's my favorite part of sharing my work on Nexus!\n<br />[size=1][Super ego boost, haha ;D ][/size][/center]\n<br />I have spent a very long time perfecting the human eye within Skyrim. No... Not just for Skyrim; In every game I have ever modded, the eyes are one of my obsessions because, as many people say, \"The eyes are the window to ones' soul\". While they are not my main focus, I always go back to them in my spare time. Within Skyrim, the dead eyes drove me insane. So I did something about it. This started with the regular color texture (diffuse), but I soon realized that wasn't cutting it... so I started digging. This lead me to realize that the environment and reflection maps are what matters in creating realistic eyes. They give the eyes a glimmer, and make them look 'wet' or teary. When properly edited, the results are astonishing... Finally, REAL looking eyes!\n<br />\n<br />After [url=https://www.nexusmods.com/skyrim/users/13593925]zhoulia[/url]'s release of \"[url=https://www.nexusmods.com/skyrim/mods/91422]llygaid Eye Improver[/url]\", I decided to combine our efforts at the last minute (since she offered permission to modify her file) to create, in my opinion, the most realistic eyeballs to date! I had already created my own environment maps, but with her's mixed with my own edits, the results are truly astonishing! So please be sure to hop over to her page and give an endorsement and some kudos! While this would have still been released with my own environments, the end result would not be nearly as polished and beautiful. So GO. ENDORSE. KUDOS. NOW.\n<br />\n<br />[center]Almost as good as a strip tease? Maybe? Probably not.[/center][center][img]https://media.giphy.com/media/dTGyvK2SyavAY/giphy.gif[/img]﻿[/center]\n<br />These were literally just finished last night, so they may not be perfect. I f***ed up and hit the wrong button, but ended up liking the way they turned out.\n<br />\n<br />So here it is! The first part of Gearhog's [alpha] Character Overhaul! Van Gogh's Eyes (named because the diffuse map looks like an oil painting. I'm so original).\n<br />\n<br />[b]Keep in mind that these will probably affect all standalone eye mods as well[/b]... Most people don't modify the environment, cube, reflection, or normal maps for eyes. These are a little different than vanilla textures, so the placement is, I guess you could say, a little bit 'off'. I /may/ create some patches as they're requested. But I haven't noticed it being a huge problem on my end, and I have [i]a lot[/i] of eye mods.\n<br />\n<br />[b][u]This mod edits the following textures:\n<br />[/u][/b]\n<br />Diffuse Map (all colors... Including bloodshot &amp; blind, but no vampire or mer... yet)\n<br />Normal Map (brown_n)\n<br />Environment Maps (environmentmask_m &amp; brown_sk)\n<br />Cubemap\n<br />Reflection\n<br />\n<br />\n<br />[b]THIS IS A TEMPORARY MOD PAGE![/b] \n<br />It will be removed upon alpha or official release of GCO. This is simply a teaser to give those who follow my work something to play with until I have more.\n<br />\n<br />[b]Recommended [/b][size=1][i](HIGHLY)[/i][/size][b]:[/b]\n<br />[url=https://www.nexusmods.com/skyrim/mods/91568]Skyrim's Ultimate Eye Meshes Ruhmastered[/url] by [url=https://www.nexusmods.com/skyrim/users/1454310]Ruhadre[/url]\n<br />\n<br />[b]Credits:[/b]\n<br />[url=https://www.nexusmods.com/skyrim/mods/51602]Fair Skin Complexion[/url] by [url=https://www.nexusmods.com/skyrim/users/4557236]HHaleyy[/url] [size=1](tear duct &amp; eyelashes... I know, it's weird)[/size]\n<br />[url=https://www.nexusmods.com/skyrim/mods/91422]llygaid Eye Improver[/url] by [url=https://www.nexusmods.com/skyrim/users/13593925]zhoulia[/url] [size=1](bits &amp; pieces of environment &amp; normal maps)[/size]\n<br />\n<br />[size=1][With that being said... I promise I'm working my a** off to get the alpha in a state for release. I've just had my hands full with work, being a moody female, and health s***]\n<br />\n<br />\n<br />\n<br />[[And for those of you who have read my health disclaimers: I found an affordable option for the cure to my ailment, so hopefully I'll live longer than 5 years. So maybe my mods will keep coming. Go team Hog! Seriously though... Thank you for all the support. Those of you who have sent me good wishes have kept me going. I wasn't planning on seeking treatment, but kind people like you given me hope in this world, and I decided to stick around a little longer]][/size]",
  "categoryId": "26",
  "version": "0.1a",
  "author": "Gearhog",
  "createdUnix": "1527906276",
  "updatedUnix": "1527953558",
  "containsAdultContent": false,
  "uploadedBy": "Gearhog",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000274268",
      "name": "GCO - Van Gogh Eyes",
      "version": "0.1a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1591",
      "fileName": "Main File-91662-0-1a.7z",
      "uploadedUnix": "1527905630",
      "modVersion": "0.1a",
      "virusScanUrl": "https://www.virustotal.com/file/3e00476efa6b627b8b0952e2de96491b9ba31d584c0876be26a6f84044d845ea/analysis/1527905716/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-91662-0-1a.7z?fid=1000274268&ttl=1535882362&ri=8192&rs=8192&setec=27f61570c0ce830c35937176780055e7"
    },
    {
      "fileId": "1000274299",
      "name": "GCO - Van Gogh Eyes",
      "version": "0.1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1591",
      "fileName": "GCO - Van Gogh Eyes-91662-0-1a.7z",
      "uploadedUnix": "1527953558",
      "modVersion": "0.1a",
      "virusScanUrl": "https://www.virustotal.com/file/3e00476efa6b627b8b0952e2de96491b9ba31d584c0876be26a6f84044d845ea/analysis/1527953648/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GCO%20-%20Van%20Gogh%20Eyes-91662-0-1a.7z?fid=1000274299&ttl=1535882362&ri=8192&rs=8192&setec=5cd07072832f1e0528b19fc5efe1941f"
    }
  ]
}