{
  "modId": 91698.0,
  "modName": "Icy Lady Ningheim Racemenu Preset",
  "summary": "a blue tinted ningheim based character. this preset is a a suggestion and hopefully a good basis for your character",
  "descriptionHtml": "a race menu preset file of my character IcyLady. \n<br />\n<br />if you want the body, eyes and teeth in the screenshots use my uploaded body, eye and teeth replacers (see requirements and recommendations).\n<br />[url=https://www.nexusmods.com/skyrim/images/612107]here you can compare all my female presets with same settings using my skin and additional mods[/url]\n<br />\n<br />the focus was laid on natural appearance, high detail. so the easy \n<br />customizable and out of the box cute ningheim race was the best choice \n<br />for me to create close up capable detailed female character with some \n<br />eye candy addons.\n<br />\n<br />some mods must or at least should be installed to get the correct results. \n<br />the preset file has to be placed at the right place. put it just in the folder where your other loadable presets are located! \n<br />\n<br />YOU NEED THE FOLLOWING MODS and addons for full details and correct appearance (and of course [b]credits to all modders providing the basis for my presets[/b]):\n<br />[url=http://www.nexusmods.com/skyrim/mods/35474/?]the ningheim race[/url] unp option (including some of its options to prevent crashes with some \n<br />of the racemenu sliders)\n<br />current race menu version\n<br />skse (most good stuff probably does not run without it)\n<br />[url=http://www.nexusmods.com/skyrim/mods/68311/?]ks hairdo's renewal[/url] for the hair, hdt if you use the hdt hair options\n<br />stoja's warpaints (for correct face paint)\n<br />true eyes\n<br />true eyes ningheim add on\n<br />true brows\n<br />true brows ninheim add on\n<br />my ningheim cute fingers option in my [url=https://www.nexusmods.com/skyrim/mods/82568/?]cute fingers seamless body mod[/url] is strictly recommended for a full detailed unp based character (just don't use it on low end rigs)\n<br />\n<br />[b]be aware to use standard head mesh. ece head mesh is not tested! if you use non standard head meshes the preset will not appear \n<br />as intended![/b]\n<br />\n<br />[b]for some of the addons have a look in my file options here or in my \n<br />katarina ningheim preset mod files folder first.[/b] you may not find some \n<br />of them in the nexus mod list anymore.\n<br />if one of the listed mods is not available anywhere just let me know\n<br />\n<br />be sure that no parts of the above mods are unintentionally overwritten by other mods! \n<br />\n<br />\n<br />[u]recommended options if preset does not appear as expected:\n<br />[/u]i use my unp cute fingers seamless  body mod based on unp skinny body. if you encounter problems try unp body as your body mesh base. you may also enhance your npc and other races with my high res cute fingers body options.  \n<br />i recommend my teeth replacer for ningheim and other races ([url=http://www.nexusmods.com/skyrim/mods/73328/?]better teeth for human races[/url]) or my first and slightly different version (see file folder in katarina ningheim files)\n<br />if you do not use ks hairdos hdt option you my have to change the hair to a non hdt one in the racemenu. an optional skyrim hair preset is available.\n<br />same if you use other warpaint, eye or eyebrow options as recommended.\n<br />\n<br />if something still does not show as indended check your modlist first. you\n<br /> may correct some errors in your loaded preset if you change eye and \n<br />hair in racemenu. \n<br />in all other cases you may pm me or just leave a post with a description of your porblem.\n<br />\n<br />[u]installation of the preset:[/u]\n<br />- unpack and put the preset file in the folder data&#92;skse&#92;plugins&#92;chargen&#92;presets (if you use mo it also can be the \n<br />overwrite folder depending on your installation settings).\n<br />- open console ingame an type showracemenu\n<br />- select ningheim race female if not already set\n<br />- chose \"preset\" button in the menu and then the preset load button and load the desired preset.\n<br />- you may change and optimize the preset now. don't forget to save it in a new preset and to save the game.\n<br />\n<br />** update ** if you use the unp mature skin texture mod be shure to use my\n<br /> patched face skin texture uploaded as optional file (katarina ningheim files). otherwise my \n<br />presets doesn't match the sceenshots. i patched the skin around the \n<br />eyes. all credits for this texture go to the original author.**\n<br />\n<br />for your standard npc and female characters and lunari race you may try in additionally my other [url=http://www.nexusmods.com/skyrim/mods/82568/?]cute fingers unp mod options[/url]\n<br />\n<br />[b]you may watch  [/b][url=https://www.nexusmods.com/skyrim/search/?gsearch=xrayy&amp;gsearchtype=authors&amp;tab=mods][b]my other skyrim mods here\n<br />\n<br />[b]i absolutely recommend the [/b][/b][/url][b][b][url=https://www.nexusmods.com/skyrim/mods/93219?tab=posts]doppelganger follower mod[/url]﻿ if you like to try my presets with a beautiful twin follower.[/b][/b] \n<br />\n<br />* you are welcome to post your katarina preset screenshot in the user image section * \n<br />thank you for trying my presets and have fun playing skyrim!\n<br />\n<br />[u]credits[/u]\n<br />thank you all and the modders of the listed mods above (including caliente \n<br />for body customizer images) for making this preset possible and\n<br /> for you trying it - and for taking your time leaving so many downloads and endorsments!",
  "categoryId": "34",
  "version": "1.0",
  "author": "xrayy",
  "createdUnix": "1527939991",
  "updatedUnix": "1527939991",
  "containsAdultContent": false,
  "uploadedBy": "xrayy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000274289",
      "name": "IcyLady",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "IceLady-91698-1-0.7z",
      "uploadedUnix": "1527939747",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e5d7b7314ca5ff19f0b4daac48a4b56e4db020cdc48fb593bfa28b8a1d529fa8/analysis/1527939842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/IceLady-91698-1-0.7z?fid=1000274289&ttl=1535882424&ri=8192&rs=8192&setec=80140592648f9b03e8aa58baa5099ba6"
    },
    {
      "fileId": "1000274290",
      "name": "IcyLady Skyrim Hair",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Ice Lady Skyrim Hair-91698-1-0.7z",
      "uploadedUnix": "1527939841",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2f69bf430edfabd849c98a40c23fdb395b980b3c688c9e443789d54e67bcd1d5/analysis/1527939903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ice%20Lady%20Skyrim%20Hair-91698-1-0.7z?fid=1000274290&ttl=1535882425&ri=8192&rs=8192&setec=281c05eac640253cf9411a9b2174af11"
    }
  ]
}