{
  "modId": 91714.0,
  "modName": "Gearhogs Character Overhaul - Female Alpha - UNP",
  "summary": "4k UNCOMPRESSED TEXTURES! For testers only, or for people who know how to resize their own textures manually or with ordenador.",
  "descriptionHtml": "[font=Tahoma][b][size=3]Sorry for the wait, and welcome to my newest skin overhaul, \"GCO\"!\n<br />[/size][/b]\n<br />[/font][i]This is currently only for females, but the male version is in the works and an alpha will be released separately once I believe its ready for you guys.[/i]\n<br />Once both are completed, I will refine all the additions I've been working on including a TexBlend, RaceMenu overlays, a new and improved CC expansion, and unique non-beast race facial features (as well as elder).\n<br />\n<br />The CBBE version hasn't been tested thoroughly, so please, if you find something wrong... PM me to let me know.\n<br />\n<br />This is a massive project that has taken an incredible length of time to even get to this state, so please continue to be patient! I promise, once it is complete, it will be worth the wait! I don't want to release this too soon and be disappointed. So for now, I'm just releasing the base skin, with some hand picked details from the complete pack of options you'll have to choose from once its completed (including darkened eye rings, chapped lips, veins, and some light fuzzies).\n<br />\n<br />[u]To all those who have supported me on this venture:[/u] Thank you! I wouldn't have been able to do this without you, truly. You've kept my spirits up, and given me a reason to keep creating.\n<br />[u]For those who have read of my health:[/u] Although every day is a struggle, I'm currently in the process of getting treatment, so hopefully I'll be at my best soon!\n<br />[u]For those who have added negativity to my modding career:[/u] This isn't for you.\n<br />\n<br />I recently started a page for my mod updates on Facebook which you can fine [url=https://www.facebook.com/Gearhogs-Mods-237066010457007/]here[/url]. So check it out and follow!\n<br />\n<br />I will not be making 'doll' versions of this mod. When it is in its completed state, there will be a 'softer' version, but it will still hold some level of realism. That is my style, and I don't plan on changing it. \n<br />\n<br />However, you're welcome to use my assets to create your own skin for others to use, or for your own personal use! I give anyone permission to use my assets, so long as I'm credited. I would also appreciate a heads up and link, but its not a requirement.\n<br />\n<br />I use a hi-poly head (Citrus Heads), so to get the same look as my character, you'll want to download that. I use the standalone version, as the replacer version has been reported by others to have issues (melting faces and shit). I've included her preset as a Misc download for those interested. I'm working to create her as a follower, but wanted her to be voice acted with a quest and story, so that will be a while (I decided to do her voice myself, since she is based off myself... And I'm apparently a robot)\n<br />\n<br />[font=Tahoma]-----------------------------------------------------------------------------------------------------[/font][i][font=Trebuchet MS]\n<br />\n<br />[/font][/i]Credits:\n<br />\n<br />Real Girls\n<br />Fair Skin Complexion by HHaleyy\n<br />Natural Female Face Skin (Normal Map) by RX310",
  "categoryId": "26",
  "version": "0.1a",
  "author": "Gearhog",
  "createdUnix": "1527982666",
  "updatedUnix": "1527982666",
  "containsAdultContent": false,
  "uploadedBy": "Gearhog",
  "primaryFile": null,
  "files": []
}