{
  "modId": 9175.0,
  "modName": "Arma Legionis 1_06",
  "summary": "Replaces the imperial sword with a historical Gladius Hispaniensis, and the shields with historical Roman shields. Adds a Hasta and the Crocea Mors. Adds crafting recipes for them.",
  "descriptionHtml": "WHAT IT DOES\r<br />\r<br />It replaces the Imperial Sword with a late republic / early principate Roman gladius in two versions, and the imperial shields with two versions of the well known Roman legionary shield, because it kinda felt in-character for the game&#39;s general theme. In fact, more so IMHO than having praetorians/frumentarii running around with katanas. The mod name is supposed to mean &#34;Arms Of The Legion&#34;, btw. It also adds one model of Roman spear (Hasta).\r<br />\r<br />\r<br />The gladius is the early &#34;Gladius Hispaniensis&#34; model, used until around 20 BCE or so. It is a little narrower and longer than the later Mainz model, and slightly waisted. The blade in the mesh is 24 inch long measured from tip to hilt. It&#39;s about 2.1 inches wide at its widest, and is sharpened on both edges.\r<br />\r<br />The debatable part is the hilt: nobody dug up a hilt from that era, so it&#39;s anybody&#39;s guess what they looked like. The general consensus seems to favour wood or leather-wrapped wooden handles, and that the carved handle of Pompeii models was not yet in use, so I went with leather-wrapped wood. The guard is pretty much the stereotypical gladius handle. The pommel is the same as for later models.\r<br />\r<br />It also has a custom scabbard that exactly fits the blade.\r<br />\r<br />\r<br />As a variant, there is a solid corundum version of the gladius with a yellow blade, called Crocea Mors. I.e., &#34;yellow death&#34;, a.k.a., the fabled personal sword of Julius Caesar himself, according to medieval historian Geoffrey of Monmouth. The sword was fabled to be extremely lethal: everyone wounded by it would surely die.\r<br />\r<br />Supposedly he lost it in Britain when he stabbed the Celtic chieftain Nennius in the head with it, and it got stuck in his shield or possibly in his helmet. Nennius actually pulled it out and continued to fight with it, but died of the wound a couple of days later, thus proving the fabled lethality of the blade. (Though some would say that dying after being stabbed in the head doesn&#39;t need a special sword as an explanation.;)\r<br />\r<br />In game it&#39;s not as deadly as its legendary counterpart, but is still marginally better than the Akaviri katana, or on par with my Arming Swords. It also has twice the chance to crit and twice the normal crit damage. I.e., it&#39;s not very high end, but with some improvements and enchantments, it could serve an imperial officer well even by the end of the game.\r<br />\r<br />It is classified as elven, but again, it actually needs corundum bars to craft and to enhance.\r<br />\r<br />\r<br />The shield mesh is based on the dimensions of the historical Fayum Scutum (late republic era shield, typical for 1st century BC or so) as well as the first Dura Europos Scutum (typical imperial era shield, after the 1st century CE), which also means it&#39;s really very curved. The numbers for the Fayum Scutum work out to an about 160 degree arc, which is just a iota short of a full semicircle.\r<br />\r<br />I gave them the iron bracing along the edge that Polybius mentions, and an own face pattern loosely based on the wings and thunderbolts motifs on Trajan&#39;s column. The exact texture of the face is anyone&#39;s guess, anyway, as different units had different images, plus the shields seem to have had all sorts of materials on the face, from leather (see, Polybius and Caesar,) to just cloth, to felt (the actual Fayum Scutum aracheological find.)\r<br />\r<br />I made them a little dirty too, but nothing excessive, because I don&#39;t like running around looking like I just mud-wrestled a pig. Still, they look well used.\r<br />\r<br />I had a choice of a boss with a round or a rectangular base, as both are amply supported by archaeological evidence, with maybe the round one winning for 1&#39;st century BC, which is to say Caesar&#39;s era. Because of that and also because everyone else usually ports the same tutorial texture with a square boss, I went with the round one.\r<br />\r<br />They ARE held all wrong, because the historical one was held like a briefcase. But Oblivion simply doesn&#39;t have the animations for historical use of a scutum, so this will have to do.\r<br />\r<br />The Fayum Scutum replaces the Imperial Light Shield, since it does have less surface, and the Imperial Scutum replaces the Imperial Shield.\r<br />\r<br />\r<br />The spear is based loosely on the shape of the Holy Lance in Vienna (i.e., yes THE artefact used by the Romans to poke Jesus Christ), but without being snapped in three pieces and held together with wire and a golden band. Though I can&#39;t find the dimensions for that one anywhere, so the dimensions are my own visual guesses.\r<br />\r<br />It has a 12 inch long leaf blade, and 2 inch wide at the base, with a central rib to stiffen the blade. The shaft, including the socket in the frot and the butt spike in the back is a good 4.5 ft long. So the total length of the weapon adds up to 5.5 ft long.\r<br />\r<br />Since the game has no spears or spear animations, it handles like a two-hander axe, except faster. For lack of a game weapon to replace OR any reference point for spears, the damage is my own guess for an early-to-mid game two-hander weapon.\r<br />\r<br />\r<br />I&#39;ve also added recipes to craft the gladius and light shield, since they were missing in the vanilla game. For balance reasons, the gladius requires the same components and has the same requirements as the steel longsword, and the light shield as the normal shield. That way I don&#39;t have to worry about whether it&#39;s too easy to get wood for the handle compared to iron :p\r<br />\r<br />\r<br />HOW TO GET IT\r<br />\r<br />Primarily, the same as you&#39;d get the normal ones, since they&#39;re the same with a different mesh. E.g., if you escaped the execution with the rebel, you&#39;ll have one or two gladii from killed soldiers right off the bat.\r<br />\r<br />Or you can craft them, since I added the recipes. You will need steel blacksmithing knowledge, since they are steel weapons. (The historical gladius hispaniensis was closer to wrought iron, but I didn&#39;t want to downgrade the legions by reducing their swords from steel swords to iron swords. This being primarily a replacer, I try not to touch the balance or values.)\r<br />\r<br />The spear and Crocea Mors, since they replace nothing, will have to be crafted.\r<br />\r<br />\r<br />HOW TO INSTALL IT\r<br />\r<br />If you&#39;re upgrading from an older version, delete the old ArmaeLegionis plugin and readme in your Data directory first. Since the new one has changed name, it won&#39;t overwrite the old plugin.\r<br />\r<br />Extract the archive, with directories, in your Data folder. (If you don&#39;t care much for crafting them or already have mods that add recipes for the imperial sword and light shields, you can delete the ArmaLegionis.esp file, since all it does is add the recipes and re-classify the gladius under Imperial for crafting.)\r<br />\r<br />\r<br />HOW TO UNINSTALL IT\r<br />\r<br />Delete the .esp file from your Data directory.\r<br />\r<br />Delete the Imperial directory in both the MeshesArmor, MeshesWeapons, TexturesArmor and TexturesWeapons directories.\r<br />\r<br />\r<br />CONFLICTS\r<br />\r<br />Hopefully, it shouldn&#39;t conflict with anything. The only minor issues are as follows:\r<br />\r<br />1. If you already have other mods that add recipes for the imperial sword and light shields, you may get duplicate entries in your crafting menu. If that happens and bothers you, just delete the ArmaLegionis.esp file and my recipes will go away. (Unfortunately, though, so will the spear and Crocea Mors.)\r<br />\r<br />2. Since I had to edit the sword data to file it under Imperial instead of Steel, this will force its name to English. The shields will stay translated to whatever language your game is in. (Obviously this is a non-factor if your game is in English in the first place.)\r<br />\r<br />\r<br />VERSION HISTORY\r<br />\r<br />1.06:\r<br />\tAdded the Crocea Mors\r<br />\tNew HD blade texture for the gladius.\r<br />\r<br />1.05\r<br />\tRedone the Gladius blade from scratch to a more historical diamond section (also, hey, less triangles)\r<br />\tRedone the Gladius texture again. Looks more like steel now, IMHO\r<br />\tRenamed the mod to Arma Legionis, which apparently is the correct Latin for that\r<br />\tMade the sheath thicker, to fit in better with the vanilla ones\r<br />\r<br />1.04:\r<br />\tChanged the blood mesh on the gladius to something less sucky\r<br />\tRedone the metal texture\r<br />\tGave the blades a good polish\r<br />\tAdded the spear\r<br />\r<br />1.03:\r<br />\tScaled everything up 10% so it will look about historically sized assuming humans are 5&#39;10&#34; tall or so\r<br />\r<br />1.02:\r<br />\tRedone shield texture mapping so the edges don&#39;t look like stretched bands when blocking\r<br />\tAlmost 10% less polygons in a shield, but it should look exactly the same\r<br />\tTweaked the boss a little, so it&#39;s not so squashed vertically\r<br />\r<br />1.01:\r<br />\tDoubled the texture resolution for the shields\r<br />\tMade the shields darker and a little less saturated, as requested\r<br />\r<br />1.0:\r<br />\tFirst Skyrim Release\r<br />",
  "categoryId": "36",
  "version": "1.06",
  "author": "Moraelin",
  "createdUnix": "1329056779",
  "updatedUnix": "1387709799",
  "containsAdultContent": false,
  "uploadedBy": "Moraelin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "29622",
      "name": "ArmaeLegionis_Skyrim_1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2975",
      "fileName": "ArmaeLegionis_Skyrim_1_0-9175.7z",
      "uploadedUnix": "1329057029",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3d63fc645c7efbc08686e6254fa50ca9cdd808145e068d078c3347d24786b72f/analysis/1406673326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmaeLegionis_Skyrim_1_0-9175.7z?fid=29622&ttl=1535768471&ri=8192&rs=8192&setec=d9827d758bd0d3931708443c096c7ea4"
    },
    {
      "fileId": "30626",
      "name": "ArmaeLegionis_Skyrim_1_01",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6819",
      "fileName": "ArmaeLegionis_Skyrim_1_01-9175.7z",
      "uploadedUnix": "1329171955",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/edd8a7af8336a36bf7edb7575dcd91182c68e69547eae9701b2fe5484fbf38fb/analysis/1406679702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmaeLegionis_Skyrim_1_01-9175.7z?fid=30626&ttl=1535768471&ri=8192&rs=8192&setec=b90f618cc271914cbbc194b2d54c38d4"
    },
    {
      "fileId": "30943",
      "name": "ArmaeLegionis_Skyrim_1_02",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6830",
      "fileName": "ArmaeLegionis_Skyrim_1_02-9175.7z",
      "uploadedUnix": "1329213009",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/a54f5695584065aeb87fdc3ee62b0a148d02b96a538e43dc5336e9a85ac25651/analysis/1406681263/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmaeLegionis_Skyrim_1_02-9175.7z?fid=30943&ttl=1535768472&ri=8192&rs=8192&setec=349b62ef91e29c781c3097574ccfe9fc"
    },
    {
      "fileId": "30957",
      "name": "ArmaeLegionis_Skyrim_1_03",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6827",
      "fileName": "ArmaeLegionis_Skyrim_1_03-9175.7z",
      "uploadedUnix": "1329216877",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/6885607c9d8e55be350575edf0ac9ecd50551e1fcb17a005d45607fc5e466d3c/analysis/1406681436/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmaeLegionis_Skyrim_1_03-9175.7z?fid=30957&ttl=1535768472&ri=8192&rs=8192&setec=479cf8d6f069cb8c80bdcf5857b78bfd"
    },
    {
      "fileId": "37979",
      "name": "ArmaeLegionis_Skyrim_1_04",
      "version": "1.04",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7354",
      "fileName": "ArmaeLegionis_Skyrim_1_04-9175-1-04.7z",
      "uploadedUnix": "1330425292",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/eb0f6d9eab1a255063dc5c4a9fabebc12ebbf85372bc3de5d30c597b0a05a514/analysis/1406719037/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmaeLegionis_Skyrim_1_04-9175-1-04.7z?fid=37979&ttl=1535768473&ri=8192&rs=8192&setec=b54e8254a241472174a3ecc3eebdb1d3"
    },
    {
      "fileId": "94994",
      "name": "ArmaLegionis_Skyrim_1_05",
      "version": "1.05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7192",
      "fileName": "ArmaLegionis_Skyrim_1_05-9175-1-05.7z",
      "uploadedUnix": "1350829008",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/d0823332143b210e228b94a0634902ef904c94d9a0f6db3ade9bc4a282ba924b/analysis/1407231045/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmaLegionis_Skyrim_1_05-9175-1-05.7z?fid=94994&ttl=1535768473&ri=8192&rs=8192&setec=82383f3c8a2adf782c8185c64e15d76f"
    },
    {
      "fileId": "1000087834",
      "name": "ArmaLegionis_Skyrim_1_06",
      "version": "1.06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9690",
      "fileName": "ArmaLegionis_Skyrim_1_06-9175-1-06.7z",
      "uploadedUnix": "1387709799",
      "modVersion": "1.06",
      "virusScanUrl": "https://www.virustotal.com/file/155a899bced039855529433c5998bd20c20817a89a2b2e5104fda85e5c23d4f9/analysis/1407852675/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmaLegionis_Skyrim_1_06-9175-1-06.7z?fid=1000087834&ttl=1535768473&ri=8192&rs=8192&setec=c58b18a248c5a6e33f5a1e8aea6d6ee0"
    }
  ]
}