{
  "modId": 91751.0,
  "modName": "Daedric Shrines RU",
  "summary": "Добавляет Даэдрические святилища в мир святилищ Скайрима, обеспечивая Божественные Благословения от Даэдрических Богов, которые раньше не имели их, а также добавлен дополнительный контент",
  "descriptionHtml": "[color=#ff7700]Автор:[/color] [url=https://www.nexusmods.com/skyrim/mods/87578]Nickorasu and Billyro[/url]\n<br />\n<br />[color=#ff7700]Перевод:[/color] AlecsZ[center][img]http://i63.tinypic.com/vsgo4g.png[/img]﻿[/center]Большинство литургических и религиозных мест в Скайриме имеют надлежащую святыню, чтобы дополнить свое соответствующее божество и облегчить общение, однако, если вы оказались Даэдрическим Лордом или Божеством, классифицированное как Даэдра, место вашего храма в Скайриме не будет иметь надлежащего святилища. Когда вы путешествуете по провинциям Скайрима, вы можете найти множество мест для святынь, но только в том случае, если в этом месте поклоняются богу Адра, будет надлежащая святыня. Из всех даэдрических богов в Скайриме только один, Ноктюрнал, имеет святыню, которая работает. Все остальные святыни, кроме Ноктюрнал, не работают или явно отсутствуют. Мод Даэдрические святыни пытается исправить это, сделав храмы в этих местах рабочими или в других случаях, добавив недостающие святыни в эти места. Кроме того, в некоторых тщательно подобранных местах мод Даэдрические святыни также добавляет дополнительный контент, который подходит для соответствующего божества в этих местах, включая новые квесты и расширенные места. Новый контент был добавлен в уже существующие места святынь и т. д. \n<br />\n<br />* Храм Мефалы был изменен. Вместо благословения по умолчанию улучшенного бартера, который уже доступен В 2 других святилищах Благословение Мефалы теперь улучшает урон от стрельбы из лука на 10% в течение 8 часов.\n<br />Что делает совместимость маловероятной проблемой и, надеюсь, создает более захватывающую атмосферу, одновременно поддерживая универсальную согласованность.\n<br />\n<br />[center][youtube]oIDyM7PTR7A[/youtube]﻿[/center]\n<br />[center][img]http://i67.tinypic.com/2je5i09.png[/img]﻿[/center][color=#ffff00]Святыни:[/color]\n<br />Святыня Азуры (в Скайриме)\n<br />Святыня Боэтии (в Скайриме)\n<br />Святыня Мефалы (в Скайриме)\n<br />Святыня Клавикуса Вайла\n<br />Святыня Намиры\n<br />Святыня Меридии\n<br />Святыня Малаката\n<br />Святыня Периайта\n<br />Святыня Вермины\n<br />Святыня Мерунеса Дагона\n<br />Святыня Хирсина\n<br />Святыня Хермеус Моры\n<br />Святыня Молаг Бала\n<br />[center][img]http://i65.tinypic.com/14bolyh.png[/img]﻿﻿[/center][color=#ffff00]Расположение святынь:[/color]\n<br />Храм Азуры - Добавляет отсутствующие святилище Азуры в локацию\n<br />Часовня Боэтии - Добавляет отсутствующие святилище Боэтии в локацию\n<br />Клуб «Новый Гнисис» - добавляет новое святилище of Мефалы в локацию\n<br />Пещера Хеймара - Добавляет отсутствующие святилище Клавикуса Вайла в локацию\n<br />Утёсная пещера - добавляет Храм Намиры в локацию\n<br />Килкрит катакомбы - добавляет святилище Меридии в локацию\n<br />Храм Килкрит - добавляет святилище Меридии в локацию\n<br />Роща Брахмы - добавляет отсутствующую святыню Малаката в локацию\n<br />Святилище Перейта - добавляет отсутствующую святыню Периайта в локацию\n<br />Бтардамз - добавляет святилище Периайта в локацию\n<br />Храм Призывателей Ночи - добавляет отсутствующий Храм Ваэрмины в локацию\n<br />Святилище Мерунеса Дагона - Добавляет отсутствующие святилище Мехрунса Дагона в локацию\n<br />Заснеженные руины - Добавляет отсутствующую святилище Хирсина в локацию\n<br />Гленморильский ковен - добавляет отсутствующий храм Хирзина в локацию\n<br />Храм Мираака - добавляет святилище Хермеус Моры в локацию\n<br />Заброшенный дом - добавляет святилище Молаг Бала в локацию\n<br />Замок Волкихар - добавляет святилище Молаг Бала в локацию\n<br />\n<br />Новые святыни действуют и ведут себя точно так же, как и ванильные святыни, обеспечивая бесшовную интеграцию в мир. Они вылечивают болезнь и приносят уникальное благословение по отношению к связанным с ними\n<br />божествам. Новые благословения святынь различны, но наравне с благословениями ванильных храмов. Все местоположения святилищ по умолчанию в Скайриме, которые имеют храмы, которые не работают, теперь стали функциональными, и им были предоставлены места святынь, в которых отсутствовали надлежащие святыни.\n<br />\n<br />[left]Благословения:[/left]Святыня Клавикуса Вайла: Красноречие улучшается на 10% в течение 8 часов.\n<br />Святыня Намиры: заклинания Колдовства улучшаются на 10% в течение 8 часов.\n<br />Святыня Меридии: заклинания Восстанавления улучшаются на 10% в течение 8 часов.\n<br />Святыня Малаката: Двуручное оружие наносит дополнительный урон в течение 8 часов.\n<br />Святыня Перейта: иммунитет к болезни в течение 8 часов.\n<br />Святыня Вермины: заклинания Иллюзии улучшаются на 10% в течение 8 часов.\n<br />Святыня Мехрунеса Дагон: заклинания Разрушения улучшились на 10% в течение 8 часов.\n<br />Святыня Мефалы : оружие стрельбы наносят на 10% больше урона в течение 8 часов.\n<br />Святыня Хирсина: Регенерация выносливости улучшается на 10% в течение 8 часов.\n<br />Святыня Хермеус Моры: заклинания Изменения улучшены на 10% в течение 8 часов.\n<br />Святыня Молаг Бала: умение Скрытность улучшается на 10% в течение 8 часов.\n<br />\n<br />[color=#ffff00]Святыни:[/color]\n<br />Святыня Азуры: По умолчанию стиль святилища Данмерский. Доступно в любое время.\n<br />Святыня Боэтии: По умолчанию стиль святилища Данмерский. Часовня Боэтии: Доступно в любое время.\n<br />Святыня Металы: По умолчанию стиль святилища Данмерский. Клуб «Новый Гнисис»: доступен в любое время.\n<br />Святыня Клавикуса Вайла: статуя Вайла - святыня. Перед тем, как начать квест «Собака — друг даэдра», активизация святыни/статуи принесет благословение Клавикуса. В течение квеста, когда Барбус ушел, активируя Святилище, вы прямо вступаете в общение с Клавиком Виле, который будет говорить с вами, но не дается Благословение. После завершения квеста, святыня снова дает свое Благословение при активации.\n<br />Святыня Намиры: уникальный новый стиль святыни. Доступен после квеста «Вкус смерти».\n<br />Святыня Меридии: новый стиль святыни. До и во время квеста «Рассветная заря» святыня находится в недрах Килкритских катакомб в контроле над Малкораном, так что изначально можно получить доступ только в конце квеста, когда вы достигнете Малкорана. После завершения квеста «DA09 Рассветная заря» начнется новый квест «Начало рассвета», после чего жертвенник и святыня будут вновь освящены и перенесены в Храм Килкрит. С этого момента к святилищу можно получить доступ на новом месте в храме Килкрит в любое время.\n<br />Святыня Малаката: статуя/святыня - это святыня. Доступно в любое время после начала квеста «Проклятое племя».\n<br />Святыня Перейта: уникальный новое святилище в Данмерском стиле. Доступен в любое время. Бтардамз: Доступно в любое время.\n<br />Святыня Ваэрмины: Уникальный новый храм в стиле Данмер. Доступно в любое время.\n<br />Святыня Мехрунеса Дагон: уникальный новый стиль святыни. Доступно только после начала квеста «Кусочки прошлого». До этого времени Храм Мехрунеса Дагон заперт и недоступны. После квеста храм доступен в любое время.\n<br />Святыня Хирсина: уникальный новый храм в стиле Данмер.\n<br />   Гленморильский ковен: Доступно в любое время.\n<br />   Заснеженные руины: Доступно в любое время.\n<br />Святыня Хермеус Моры: статуя/святыня - святыня. Доступно в любое время.\n<br />Святыня Молаг Бэла:\n<br />  Заброшенный дом: алтарь также является святыней. Доступно в любое время.\n<br />  Замок Волкихар: Храм святого источника крови - святыня. После активации игрок также будет пить кровь из фонтана. Доступен в любое время после получения доступа к замку Волкихар.\n<br />[center][img]http://i66.tinypic.com/hv5puf.png[/img]﻿﻿[/center][color=#ffff00]Новый контент:[/color]\n<br />Новый контент был добавлен в несколько мест, включая Бтардамз, Храм Призывателей Ночи и большинство других мест святынь в моде Даэдрические святыни, а в некоторых случаях, таких как\n<br />в храме Килкрит, храм был значительно расширен. Добавленный контент был добавлен с очень тщательным рассмотрением, чтобы обеспечить согласованность и чтобы\n<br />немодифицированное чувство сохранялось при увеличении погружения. Кроме того, в некоторых случаях были добавлены другие материалы, такие как религиозные иконы и атрибуты,\n<br />религиозные знамена, священные книги, алтари и многое другое. Все предметы и объекты были добавлены в мир плавно и не конфликтуют ни с навмешами, ни с НИПами, ни с квестами.\n<br />Также были добавлены новые квесты.\n<br />Клуб «Новый Гнисис»:\n<br />* Как было сказано ранее, новые места святынь не были добавлены, то есть за исключением Клуб «Новый Гнисис», который теперь имеет Храм Мефалы в этом месте.\n<br />Клуб «Новый Гнисис» был расширен и теперь имеет подвальное помещение, которое содержит новый секретный Храм Мефалы, предоставляя предварительно утвержденным местным жителям Данмерам Серого квартала к религиозному святилищу.\n<br />[color=#ffff00]Драконьи святыни:[/color]\n<br />Новые святилища Данмера, которые пришли с DLC Dragonborn, получили обновленные и улучшенные текстуры из мода Даэдрические святыни, заменив оригинальные текстуры с низким разрешением высоким\n<br />которые значительно улучшили художественные изображения. Эти улучшения в Драконьих святилищах включают в себя все святилища Драконов в мире игры, в том числе Солстхейм.\n<br />Даэдрические святыни можно безопасно устанавливать в любое время. Спасибо всем сторонникам.\n<br />\n<br />[color=#e06666]Требования:[/color]\n<br />Skyrim Legendary Edition\n<br />\n<br />[color=#00ff00]Установка:[/color] (можно через менеджеры модов или вручную)\n<br />1. Скачайте по основной ссылке в разделе файлы архив, выбирите один из 4 вариантов мода\n<br />2. Установите вручную или менеджером модов\n<br />\n<br />[center][color=#00ffff]Благодарности:[/color][/center]\n<br />Billyro\n<br />MihailMods (https://old.nexusmods.com/skyrim/mods/87148/?)\n<br />Nickorasu who has created many of the assets in this mod. You can download more of his original work here: https://www.nexusmods.com/skyrim/mods/85392/?\n<br />Darken and Darken Resource who provides some assets in this mod.\n<br />Oarsyts\n<br />DarkEnd\n<br />CD Project\n<br />Darken\n<br />Violetdragon626\n<br />Bethesda Game Studios.",
  "categoryId": "85",
  "version": "8.4",
  "author": "AlecsZ",
  "createdUnix": "1528119889",
  "updatedUnix": "1528119889",
  "containsAdultContent": false,
  "uploadedBy": "AlecsZ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000274501",
      "name": "Daedric Shrines RU",
      "version": "8.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "453410",
      "fileName": "Daedric Shrines RU-91751-8-4.7z",
      "uploadedUnix": "1528118592",
      "modVersion": "8.4",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Shrines%20RU-91751-8-4.7z?fid=1000274501&ttl=1535882491&ri=8192&rs=8192&setec=373c9fe08269668de26fef8961b11571"
    },
    {
      "fileId": "1000274502",
      "name": "Daedric Shrines RU No Cure Disease",
      "version": "8.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "453413",
      "fileName": "Daedric Shrines RU No Cure Disease-91751-8-4.7z",
      "uploadedUnix": "1528118866",
      "modVersion": "8.4",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Shrines%20RU%20No%20Cure%20Disease-91751-8-4.7z?fid=1000274502&ttl=1535882491&ri=8192&rs=8192&setec=e36ab4f07bf14411102fb264377a22a6"
    },
    {
      "fileId": "1000274503",
      "name": "Daedric Shrines RU - No Quests",
      "version": "8.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "453199",
      "fileName": "Daedric Shrines RU - No Quests-91751-8-4.7z",
      "uploadedUnix": "1528119132",
      "modVersion": "8.4",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Shrines%20RU%20-%20No%20Quests-91751-8-4.7z?fid=1000274503&ttl=1535882491&ri=8192&rs=8192&setec=1e4b2df3a8fb7ee8f06c84e4a7e5e7dc"
    },
    {
      "fileId": "1000274504",
      "name": "Daedric Shrines RU - No Quests - No Cure Disease",
      "version": "8.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "453451",
      "fileName": "Daedric Shrines RU - No Quests - No Cure Disease-91751-8-4.7z",
      "uploadedUnix": "1528119574",
      "modVersion": "8.4",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedric%20Shrines%20RU%20-%20No%20Quests%20-%20No%20Cure%20Disease-91751-8-4.7z?fid=1000274504&ttl=1535882492&ri=8192&rs=8192&setec=f50a77d3f1fcf1856fb90901c4b9ec28"
    }
  ]
}