{
  "modId": 91756.0,
  "modName": "Morkaere Mutant Race",
  "summary": "This mod adds a custom race to Skyrim. It is supposed to be a lore friendly version of a Witcher from the The Witcher universe. This is my first mod for Skyrim ever.",
  "descriptionHtml": "[center][size=6]Morkaere Mutants[/size][/center]\n<br />\n<br />The Morkaere guild is a very old nordic guild, it has been established to fight the dragons once they come back, but since the Blades took over that role the guild members used their abilities as monster, bounty and vampire hunters. The guild has used powerful but also deadly concoctions to mutate the bodies of children and trained them in alchemy, combat and destruction magic should they survive the impure potions. Out of ten boys only two survive the mutation process and only one girl has ever survived the mutation process. A Morkaere mutant has advanced reflexes and is also stronger than an average Nord, they have a faster metabolism so they regenerate their health quicker than any other Nord. The mutants also have a resistance to poisons and diseases and they can dilate their pupils to see in the dark, their eyes are visually similar to the dark yellow eyes of an High Elf. The Morkaere guilds old hideout is now known as the \"Abandoned Prison\" by the White River, it has been raided by the Empires Legion and turned into a prison after they have taken over. It is rumored that the mutants have a lifespan as long as one of the elvish races but there are only a handful of them left as the Morkaere mutants are going extinct. \n<br />\n<br />This is my very first mod and it is supposed to be a lore friendly Witcher race inspired by The Witcher. Some things might not be how I expected it but the mod seems to be perfectly playable and I have not encountered any bugs during testing. \n<br />\n<br />Feel free to make an enhanced edition of my mod if you want, hell I'd even be glad if someone with decent modding skills did.",
  "categoryId": "34",
  "version": "1",
  "author": "Infected Sanity",
  "createdUnix": "1528139185",
  "updatedUnix": "1528139185",
  "containsAdultContent": false,
  "uploadedBy": "InfectedSanity",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000274528",
      "name": "Morkaere Mutant Race",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Morkaere Mutant Race-91756-1.rar",
      "uploadedUnix": "1528139157",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/cbcded7abf75b3427b71c909bba9f66946fd707f292e39e4fff95c02ecbdf5e1/analysis/1528139283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morkaere%20Mutant%20Race-91756-1.rar?fid=1000274528&ttl=1535882501&ri=8192&rs=8192&setec=fc0081274dfac30eb50f5d2db806f588"
    }
  ]
}