{
  "modId": 91797.0,
  "modName": "Marob''s Mod diary and review",
  "summary": "- My mod list proposition with reviews<br />- No graphic mods because i have an average laptop ( for now)<br />- All mods reviewed were personally tested by me",
  "descriptionHtml": "[color=#f4f4f4][quote][/quote][/color][b][color=#00ffff]This is a mod list guide[/color] [/b]suggestion from my experience in modding. Frankly, I don't want to teach to everybody what to do. The main goal is to put on internet my two months hard work list  to don't forget. I will enjoy if you  endorse  !\n<br />This is a good starting point for  new skyrim players  who want build qickly a mod set up. \n<br />Also, I am open to debates and everyone could put suggestions in the post section.[color=#8e7cc3]\n<br />[b]\n<br />According to me, in  modding we should respect some rules:[/b][/color]\n<br />[color=#ffff00]1. Our computer capacities[/color] ( A mod could be good for a computer and blow up a craptop)\n<br />[color=#ffff00]2. Our tastes [/color](  I can't like  all good mods and I have preferences)\n<br />\n<br />My computer  stats: \n<br />[b][color=#ff7700][i]Laptop\n<br />[/i][/color][/b][color=#1e84cc]Aesus-AMD\n<br />Core: 4+6g 1.80 ghz\n<br />Ram: 8G\n<br />64 bit[/color]\n<br />So, an average computer !\n<br />Scales: ( How a mod deserve a place in my load order, sometime, an excellent mod isn't in my load order for diverse reasons) \n<br />[i][color=#00ff00]1. Recommanded (Must be, no bugs, in my taste, alway my load order)[/color]\n<br />[color=#6aa84f]2. Recommanded under conditions ( no flaw, no incompatibilities, not in my tatse)[/color]\n<br />[color=#ffff00]3. Maybe (incomplete, some bugs, not in my tatses)[/color]\n<br />[color=#ff0000]4. Not recommended (Heavy bugged, not in my taste, lore breaking, heavy scripted, better alternatives)[/color]\n<br />[color=#980000]5. to Avoid (dangerous mods to avoid at all cost)\n<br />[/color][/i][b][color=#ff00ff]My Installers:[/color]\n<br />[/b]I use NMM and wrye bash. (Both are must be) I suse NMM for complex mod and wry bash for the must have bashed patch and small mods without customization. \n<br />[color=#ff0000][size=3]*** This file is just a mod list !!!! Not a mod super pack !\n<br />[/size][/color][color=#bf9000]*** For now, Skyrim SSE is the future, but Oldrim is the past and the present.  ( I didn't switch because  half of mods I use were not yet ported )[/color]\n<br />[color=#00ffff]\n<br />Safe Authors: list of talented authors                                                     (compatible and well crafted mods)[/color][size=3]\n<br />[/size]1.Arthmoor\n<br />2.EnaiSiaion\n<br />3.Opusglass\n<br />4.Erkeil (Mod eddited by adolphen only)\n<br />5.SetteLisette\n<br />6.Icecreamassassin\n<br />7. Chesko\n<br />[color=#900000]Authors to avoid:  (buggy mods, glicht, heavy scripted mods)[/color]\n<br />1. Appolodown (But DCO is essential for oldrim )\n<br />2. Sand of time team, tonycubed2 uploader (bugs, crash and heavey scripted) \n<br />3. Mygoodeye (save bloat )\n<br />[b][color=#1e84cc]\n<br />Mark scale: (How a mod is good)[/color][/b]\n<br />A (excellent) Must be or conditionnal must be\n<br />b  (Good) Some of them are in my load order permently\n<br />C (Average) Better alternatives exist \n<br />d ( bad) Not recommended\n<br />e (very bad) Not deserve a download\n<br />x. Unknown or not fully tested\n<br />\n<br />[b][color=#00ff00]1. Unnofficial patch (A+)\n<br />[/color][/b]This should be present in every load order even for people who don't want mod because it fixe  a lot of bugs present in vanilla game.\n<br />[color=#00ff00][b]2. Run for your live  (A+)\n<br />[/b][/color]Arthmoor master piece to avoid depopulation of the map by vampires and dragons. Every npcs not fot for comabat go in a shelter durng an attack.  This mod affect npcs from mod also and is very compatible and vanilla friendly. But could be a little bit glitchy.\n<br />[color=#00ff00][b]3. Moon and Star ( Quest mod) (A)\n<br />[/b][/color]For me, It is a very immersive mod and vanilla friendly ! It also very compatible with others mods. This quest mod add also a beautiful dunmer village. Also, well voiced and done quest. Should be in every load order. ( free from bugs, not overdo)\n<br />[b][color=#93c47d]4. Immersive Citizens-Ai overhaul (A)\n<br />[/color][/b]Really good mod and well done. NPcs get new  ai packages to have immersive behavior. Also, npcs take shelter during an attack. This mod is not a must be because he suffer from compatibilites issues with other mods. Not coMpatible with  run away or settlements mods. I recommand this mod only for a not heavy modded playthrougth.\n<br />[color=#00ff00][b]5. Thirteen Orange mods collection  ( Bigger they are, oakwood village, laintar dale, pit fighter etc....) B+ for the collection\n<br />[/b][/color]Available only on steam or mod piracy, you will proabbly not download if you are a nexus aristocrat, but those mods are very good and simple. first, the quest mod are samlls but very enjoyable. Those mods could be confuse with vanilla stuff. Also, they aren't overdo and are very compatible with other stuffs. Second, he had mad 2 small immersives villages. Those villages are very smll, but integrated in vanilla game. They are part of radiant quest system and their guards switch with the civil war.  As I kow, the giant mod is incompatible with folkstead border of skyrim. But i prefer the quest mod.\n<br />[b][color=#00ff00]6. The Forgotten city (A-) \n<br />[/color][/b]An immersive addon eith multiple ends questline. This mod is very well voiced and should be in every one load order. Also, a new city is added under skyrim. Immersive and well writtes story No texture on some parts of an armor\n<br />[color=#00ff00][b]7. [/b][/color][color=#00ff00][b]Old Hroldan Ruins (A-)\n<br />[/b][/color]Best mod for Old Hrodan according to me, because this mod add a well done fortress similar to the lore. Not compatible with others who edit the place.  I use the enchanted version. Not overdo or overdesigned \n<br />[color=#6aa84f][b]8. Old Hroldan Town (Shrezrie) (A-)[/b]\n<br />[/color]Well crafthed mod with high standard and quality, but  I prefer the previous because this mod seems to be overdo and do not fit very well in skyrim vanilla with a lot of custom items.  Only, if you like fancy custom towns like JK Skyrim or overdesigned mod.\n<br />[b][color=#00ff00]9. ETAC Expanded city and towns (A-)[/color][/b]\n<br />For oldrim, it is my must be town mod. I can't play without this mod because vanilla morhal, dawnstar and Winterhold are simply garbage. It is a shame bethesda didn't take time to do thoses towns properly. The mod is modular also. Personally, I take the full version without south dragon bridge. Also, a new version is in wip and every body should harass the author to finish his new version.[color=#6aa84f]\n<br />[b]10. Holds of Skyrim Overhaul (A-)[/b][/color]\n<br />This is the most  ambitious project who aim to change every cities and towns in skyrim. I didn't try again, but i will  in near futur. I am waiting for the next release who will include Morhal and Markath at least. Also, I hope all lengendaries cities and towns will be included. But, why I  classified this mod maybe ? It is because it is currently incomplete and drasticly revamp each cities.  I had try and this mod will be my main city mod in a near futur. Less buggy and my cpu can handle it. This project have an enormous potential and will maybe a must be in futur when it will be completed. [b]\n<br />[color=#6aa84f]11. Arthmoor's Villages: (A-)[/color][/b]\n<br />[color=#f4cccc]Very good villages and vanilla friendly, but this mod is in competition with ETAC and I can't play with his towns. But, i had played with all his stuff on oblivion and I am confident thoses towns are very well done and immersive. So, I recommanda try if you don't use ETac. I have all compatible plugins with etac in my order. [/color][color=#6aa84f]\n<br />[b]12. Dragon Under Whiterun: (A-)[/b][/color]\n<br />A very well made small quest mod, I really like how is written and the shouting animals we can encounter. This mod is just made with vanilla assets. Unfortunately, It was removed from my load order because the reward is OP. If you tolarate to get a dragonplate armor at level 15 you can load  this mod.\n<br />[color=#00ff00][b]13.  Immersive weapons and armor (A+)[/b][/color]\n<br />Not a surprise, surely a classical weapon/armor mod in each load order. Those mods are the basic weapon and armor mods. Very lore friendly and add precious diversity\n<br />[b][color=#00ff00]14. Private Heavy armory (A)[/color][/b]\n<br />Excellent complement to immersive weapons with addition of a huge quantity of vaious arms. Campatible with wrye bash.\n<br />[b][color=#00ff00]15. Warmonger Armory (B+)[/color][/b]\n<br />Maybe the second best armor collection after immersive immersive armors, add a couple of new armors to leveled list and to the game. A good complement and weel  crafte armors. now i feel I have enought weapns in my game ! I will maybe add sole armors and weapons mod. \n<br />[color=#00ff00][b]16. Private royal armory-New artifacts: (A+)\n<br />[/b][/color]Adds very high quality unique weapons to key characters like tulius or ulfric. A must be in each load order.\n<br />[color=#6aa84f][b]17. Go to bed  (A)[/b]\n<br />[/color]A good immersive mod who allow the player to sleep like npcs. No too much scripted. I don't use this mod for now because my load order os full can't run more scripts. [b]\n<br />[color=#980000]18.  Immersive beds (E)[/color][/b]\n<br />obsolet and too much scripted.\n<br />[b][color=#00ff00]19. Diverses dragons collection (A-)[/color]\n<br />[/b] Good new dragons designs with custom assets. \n<br />A lot of bugs and crash ! It is a blacklisted mod ! Legendery cities instead very much more professionnal !\n<br />[b][color=#6aa84f]21. Frostfield, Loretius settlement (B)[/color][/b]\n<br />Good mod, but is it little bit overdo with a lot of fancy shops and custom assets.\n<br />[b][color=#00ff00]22. Settlements expanded (A+)[/color][/b]\n<br />A must be with vanilla friendly expansion of existing settlements. It is not in conflict with etac and have lot of patches to suport other mod.[b][color=#ffff00]\n<br />23.  The lost Wonders of Mzark (C+)[/color][/b]\n<br />Good mod to try one time, but it is full of bugs and this puzzle mod isn't my gender. It will not have a permanent place in my order. Also, it feel out of place with this gigantic dungeon and gigantic mobbs. Conclusion, one time mod\n<br />[b][color=#00ff00]24. Crash fixe (A++++)[/color][/b]\n<br />With engine bugs, the only mod for memmory optimisation you should have. No more ssme, safety load or enbseries. Dramatic increase of fps and no more crash\n<br />[b][color=#ffff00]25. Hoth (B+)[/color][/b]\n<br />A good looking companion, but not very compatible with other companions. He is also bugged with missing voice and naked npcs problems. But his quest system is great. Only play if don't have others comapnions mod or followers overhaul. \n<br />[b][color=#6aa84f]26. Arissa (A)[/color][/b]\n<br />Well voiced, very compatible, very godd small story line, for people who do not like Vilja long story. Also, bery good companion for thief guild quests [b]\n<br />[color=#6aa84f]25. Vilja (A-)[/color][/b]\n<br />Big immersive companion mod, vey long quest story, but  fun. Very kind and interactive follower with welle developped background But, the quality of the voice is medium and she was made to interract with Inigo. But follower mods are no longer in my load order those mod are too invasive and I c'ant use follower from other mod like interesting npcs. You should have those followers with you. \n<br />[b][color=#00ff00]26. Wheels of lull (A+)[/color][/b]\n<br />Immersive, lorefriendly mod, without glicth, definetely deser an esp in the load order. But, a little bit overdesigned and can rival with skyrim main quest. This quest is a samll dlc in itself. \n<br />[b][color=#ffff00]27. Madfrenchie thalmor's mods ( collection of 4 ) (B-)\n<br />[/color][/b]Old mod and well endossed, but this just a landcape explaration who bring nothing else. No longer supported and lot of landcape edditing and can conflict with more modern mods. But,  skyrim feel more immersive with this mod. Also, very dirty !\n<br />[color=#00ff00][b]28. Unique borders (A+)[/b][/color]\n<br />Add immersive border gates to the fronteir of skyrim, , should be in vanilla skyim.[b]\n<br />[color=#ff0000]29. Civil war overhaul (C)[/color][/b]\n<br />Buggy even if it the sole mod in my loader, abandonned, heavy scripted and unlore friendly with this diversity in legion or stormcloak. I prefer to do the vanilla civil war instead this mod. ( incompatible with diverse skyrim and more organised civil war equipement) The author have good modding skills, but with a poor judgement over the design. He had also tried to enforce a far left agenda in his mod. \n<br />[b][color=#00ff00]30. Aurora village (A)[/color][/b]\n<br />Good immersive mod, very well done village and vanilla friendly, supported by a lot of mods, good to use with moon and star,  small conflict with immersive creature, incompatible with mre bandit camps, incompatible with undeath\n<br />[b][color=#ff0000]31. Undeath (b-)[/color][/b]\n<br />Buggy a lot,  uneasy installation with all addons and bug fixes, only if want play as lich, i recommand only to play the updated version on sse. Akso, incompatible with aurora village and ordinator. Need a patch with moon and stars. but, deserve a try after a playthrought. But, skyrim modding is very competitive and I can't spare place in my load order for this mod. \n<br />[b][color=#6aa84f]32. Inigo (A+)[/color]\n<br />[/b]Balance between Arissa and Vilja. This companion have pertinent dialogs and an interesting background story. Arissa is too simplistic and Vilja complicated.\n<br />[color=#ffff00][b]33. Sophia ( B)\n<br />[/b][/color]Even if she is the most endossed companion on nexus, she will be not in my permanent load order. She speeak too much and have out of place dialogues and she is even immersif breaking with her vulgarity. She is really a slut and will be removed when I will finish to review her. She always talk about sex and alchool and she respect nothing. But, she is really well crafted fllower. [b][color=#00ff00]\n<br />34. Splendor dragon (A+)\n<br />[/color][/b]Add more than 700 dragon to leveled list with all kind of texture. Also, compatible with run for your live and All dragons mod. \n<br />[b][color=#00ff00]35. Dragon combat overhaul (A-)[/color]\n<br />[/b]The only mod from appolodown who deserve a download. Stable, but very scripted. Dragons are more present and have a ai upgrade. This mod could cause weid things to happens. A town, can be raided by three dragons at time. Dragons can call reinforcement. But i had dropped this mod because is abandonned and will be not ported on SSE. We should learn to replace it.  For the moment, i had found nothing on nexus skyrim.  But you have this mod waiting for you  on SSE https://www.nexusmods.com/skyrimspecialedition/mods/5745[b][color=#00ff00]\n<br />36. Project AHO (A-)\n<br />[/color][/b]Solide quest mod with high quality standars and lore friendly. But it hvae some flws in design. Firts the last dungeon of the las t quest is op with way tto much mods. Also, the good ending is too much long. I have the impression this mod will never end,it why I had prefered the bad ending. Also, difficult to find an accessible bed when you play with I need.\n<br />[b][color=#00ff00]37. Animalica (A)\n<br />[/color][/b]The only problem I have with this mod is the number or unlore friendly creatures in skyrim. But you should have the lore friendly edition at least. This mod is an overhaul of animals not monsters. It had a lot of diversity  to elks, fox and various predators. Also, the texture are high quality and I think this mod change the texture of vanilla creatures I think. It is a good complement to immersive creatures. Annimalica doesn't touch monsters like draug etc. \n<br />[b][color=#ffff00]38. Molag bal inferno (B)[/color][/b]\n<br />Good dungeon mod, but this mod is no more in my permanet load order.  This is not really lore friendly, but it have some good dungeons and well designed new world space. also, the difficulty of this mod is high we don't feal in skyrim. I just recommand this mod for high level character who have nothing to do after a playthrough. It is also a puzzle mod and the combats are very scripted. Also, a couple of bugs. Only use  if you like. \n<br />[b][color=#00ff00]39. Wildcat (A+)[/color][/b]\n<br />This mod is my only combat overhaul and it work very well and it is very light on the system. The combat is more immersive and qick. For now, it is my only combat mod and the author have a very solid reputation.[color=#00ff00]\n<br />[b]40. Ultimate combat (A)[/b][/color]\n<br />Good cambat mod and excellent compliment to wildcat. just need to disable timed pc block from one mod the overlap is not significant. new powers and animations. \n<br />[b][color=#00ff00]41. Ultimate dragon (A-)[/color]\n<br />[/b]good alternative to dco, new animations and powers, compatible avec dd and other dragon mods.\n<br />[b][color=#00ff00]42. Dwemertech (B+)\n<br />[/color][/b]a solid mod from a solid author, not less lore friendly than wheell of lulls, this is another dwemer thematic mod centred around magic. i recommand this to magic payers. B+ is for numerous crash i had experimented. \n<br />[b][color=#ff0000]43.Deadly Combat (B-)\n<br />[/color][/b]Mod like ultimate combat,  but this mod is broken and hrd to unistall in a game. A lot of alternatives exist and you should avoid this mod even the lit version. \n<br />[b][color=#ff0000]44. Dual Combat realism (B-)\n<br />[/color][/b]As deadly combat, should be avoided, better alternatives exist. can cause save bloat, instability,  was or is on dangerous mod list. the most endorssed mods are not necerry the best. \n<br />[b][color=#00ff00]45. Beast of tamriel (A-)[/color][/b]\n<br />Good complement to animalica and skyrim immersive creatures. It add more animals and monsters. But this mod don't much use leveled list. The new anmals are manually placed in world space. Also, it add a gobelin villag+ riekeling villages. No conflict as I know. You could disable all creature you don't like in mcm menu. Also, it is the best existing overlaul of water live with new fish, dolphins and sharks.  Animwlica+BOT+SIC made my wildlife perfect.\n<br />[b][color=#6aa84f]46. Apocalypse new spells (A+)[/color][/b]\n<br />New immersive spells, more variety and stable mod, should be used with ASIS. New npcs should enjoy that !\n<br />[b][color=#ff0000]47. Hroldan, nightgate and sawmill villages (C-)[/color][/b]\n<br />This mod should be avoided, because is dirty, not updated and not polished. Better settlement mod exist on nexus. Some sttlements are bugged. By exemple,the robber gorge have some items in the air. \n<br />[b][color=#ff0000]48. UFO (ultimate follower overhaul  (C)[/color][/b]\n<br />This mod is oudated and not supported. Also, it have a lot of compatibility issues.  EFF is the only follower overhaul who deserve a download. Even if UFO is one of the most endorsed mod on nexus.\n<br />[b][color=#ffff00]49. Amazing follower tweak (B)[/color][/b]\n<br />Old, not longer supported, some bugs, i don't recommand either this mod. (obsolet)\n<br />[b][color=#6aa84f]49. Immersive amazing followers tweaks (B+)[/color][/b]\n<br />This mod is ok, but this isn't the follower overhaul I recommand. It is a successor to amazing follower tweak with numerous fix, but it is an heavy mod. \n<br />[b][color=#00ff00]50. Extended follower framework (A-)[/color][/b]\n<br />This mod is the less endoersed, but the best follower overhaul mod. Lighter than immersive follower tweak, it should be in everyone load order.\n<br />[b][color=#6aa84f]51. Wet and cold (A-)[/color][/b]\n<br />From a good author, this mod is really well done and immersive.  But, it also very scripted, I had also experimented numerous crashes with this mod.  I had removed this mod now, and I had 159 scripts less. I only recommand this mod under some conditions.  ( light modded game, very good computer, combinaison with frostfall) If you play with frosfall, this mod is a must be. \n<br />[b][color=#6aa84f]52. Revenche of ennemies (A-)[/color][/b]\n<br />Good mod, but for balance reasons, this mod is no more in my permanent load order. It give to some enemeies like bandits, falmers, draugrs and vampire a beter ai and introduce new monsters in leveled list. (also powers and shouts) But, some ennemies are op in this mod and other monsters like giants are not touched.  Only for people who like the mod and its feature. \n<br />[b][color=#00ff00]53. I Need (A)\n<br />[/color][/b]The best fondamental need mods for now. Should, be in every load order to give to player an immersive routine. ( Mcm menu) Maybe, it will be outclassed by a new mod from chesko one day\n<br />[b][color=#6aa84f]54. Frosfall (A)[/color][/b]\n<br />From a good author and very immersive, but this mod is no longer in my load order because it have a lot of scripts it is relatively difficult to install. \n<br />[b][color=#6aa84f]55. Path of revenants (B+[/color][/b][color=#6aa84f])[/color]\n<br />A good small quest mod arround dawnstar, a must be for players who want to be necromancer. But, after the completation of the quest, this mod become an house mod. because, i am not fan of house mods and I am not a ne romencer this mod is no longer in my load order. But, the house is very good and immersive. Also, the mod have som bugs like the corpse of the vigilant doesn't always apperas in game. Also, the exit of the house is maybe glitched.\n<br />[b][color=#93c47d]56. sentries dawnguard plus (B)\n<br />[/color][/b]This mod have the potential to be great, but it suffer from bad implentation and designg. Basicly, this mod add guards to volkhinar castle and fort dawnguard. Also, it add extra guard in each cities and town of skyrim + 3 patrols I think for dawnguard. But, it have minor issues with running for your live and etac. I will grant another go  on SSE.\n<br />[b][color=#ffff00]57. Realistic needs and diseases (B+)[/color][/b]\n<br />First and good need mod, but this mod is no longer supported and is also bugged. Everyne should use I need if you are interested to survival features.\n<br />[b][color=#6aa84f]55. Camp fire (A-)[/color][/b]\n<br />If you don't want rant inn room and have more immersive set up with survival features like frostfall.\n<br />[b][color=#ffff00]56. War zone (B+)\n<br />[/color][/b]This mod was previoustly on dangerous mod list, but it was rebuild in 2015 because it was know by his glitch, crashes, bloat saves. But, even fixed, i doN't recommand this mod because i think i out of place. You will not feel in skyrim and this mod seem heavely scripted. Yhe civil war doen't become more dybnamic. Also, it have lot of compatibility issues with landscape mod and armor revamp mod. On ly play with if you are planning to do a civil war playthrought.\n<br />[b][color=#6aa84f]57. AMidianborn silent book (A+)[/color][/b]\n<br />My cpu had reached his limits with this mod. I had began to lag in very crowded areas. Bu the mod is fantastic, only if you have the system or a low modded playthrought. \n<br />[b][color=#6aa84f]58. Qaxe Questorium (A+)[/color][/b]\n<br />An hidden gem on nexus, this mod is truelly a master piece who have the quality of interesting npcs. This is for high level player.  Original without over design. *** Notice: helgen reborn should no be activated when you start a new game. The game will crash. It alslo slightly incomptible with old etac. You should choose until a patch exist.\n<br />[b][color=#00ff00]59. Interesting npcs (A)[/color][/b]\n<br />Huge mod to install, should be installed manually for me, but this mod become a must be for me with immersive quest an well writed contenant. \n<br />[b][color=#00ff00]60. immersive patrol (A-)\n<br />[/color][/b]Add dynamic patrols for main factions like the legion and dawnguard with big battles. Big must be for me. Notice: the rumor it glich with OBis is True. You should choose this mod or OBis. If you use both, random faaction will perpetualy attack you for nothing. This is a game breaking bug without fix. \n<br />[b][color=#6aa84f]61. Obis (B+)\n<br />[/color][/b]Great bandit overhaul, but it make bandits OP with too large variety. Addition of bandit patrols is great,  but I prefer immersive patrols Also, crefully read the glitch above. \n<br />[b][color=#6aa84f]62. Director cuts (A)[/color]\n<br />[/b]Good mod for improve cities, it add some houses and npcs (merchants) to cities, they are chances new clutter will conflict with other mods. (incompatible with bells of skyrim even with the patch, incompatible with pit fighter, incompatible with esf companions) \n<br />[b][color=#6aa84f]63. Unique Unique (A-)\n<br />[/color][/b]Good mod from a talented modder, but this mod is incomplete and abandonned. Also, it is completely overlaped by legacy. should b only present without legacy if you don't need esp.\n<br />[b][color=#ffff00]64. Lyngwi Village (A-)\n<br />[/color][/b]Promising mod village on a iceberg, but it was abandonned by author. It was supposely to be updated. The quality of the mod is goood, but it have teh default to have a fully discored marker on the map at the beganning of the game. But, this mod add life in the nord of skyrim. Only, if you are a village abbdict.\n<br />[b][color=#6aa84f]65. Approprietaly clothed Jarl (A)\n<br />[/color][/b] Shame to bethesda to no change the clothe of new jarls when they are appointed. But this mod is overlaped by clothe fixes. (not tested) \n<br />[b][color=#6aa84f]66. Dragon dawns (X)\n<br />[/color][/b]Good and wonderful dragon compilation  who include various aabandonned or free right mod. This mod include splendor dragons. But the splendor dragons were not updated and lot f dragons come from the obsolet and bugged diversified dragonsé Also, dremer dragons are included n syrim imersive creatures. I prefer to use dragon collection 3 and the original splendor to this mod. But, if you want more dragons, it derserve a try.\n<br />[b][color=#6aa84f]67. Falskaar (B+)[/color][/b]\n<br />A rue master piece, lore friendly, feel as integral part of the game. i recommand to use extings patches and animalica overhaul. But, the island is a little bit empty and bandits seems to be numerous than native people. The island have a similar size to solstheim. Update, after finishing the mod, i am scepthic about that. The island seem to be very empty. 2 of 3 main cities were destroyed or are innacessible. Also, the mod crash a lot with some very heavy script. ( tempory scripts) Also, I don,t recomamnde to have a ton  of very large dlcs mod in a playthrought. Also, my character begin falskaar  at level 1 and it was level 11 when he finished with morrowloot.  I will do beyond reach next ! Also, one mob have missing mesh.  I don,t thing thi mod will me in my permanent order. Also, the main city is a town like falkreath and the 2 other cities are not accessible.",
  "categoryId": "28",
  "version": "0.4",
  "author": "Marob 307",
  "createdUnix": "1528399986",
  "updatedUnix": "1534943922",
  "containsAdultContent": false,
  "uploadedBy": "marob307",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000274725",
      "name": "Marob's mod list",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Marob's mod list-91797-0-1.7z",
      "uploadedUnix": "1528399844",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/da4877cb2ffe8bbb5ea3e27a13149988ccf8a858a9f1d2c670f23d606d78388c/analysis/1528399923/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marob%27s%20mod%20list-91797-0-1.7z?fid=1000274725&ttl=1535882566&ri=8192&rs=8192&setec=c85f098d5338597d4e18c785ab680bf8"
    },
    {
      "fileId": "1000277725",
      "name": "mod list",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "mod list-91797-0-2.7z",
      "uploadedUnix": "1531881932",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/08b14b1ba7314baaf34a1b8ba8f3c9bef77beca77e2120dc143b8b2a614070f6/analysis/1531882023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mod%20list-91797-0-2.7z?fid=1000277725&ttl=1535882566&ri=8192&rs=8192&setec=5efa3598eecf45f49b77f0523592a963"
    },
    {
      "fileId": "1000278367",
      "name": "mod list",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "mod list-91797-0-3.7z",
      "uploadedUnix": "1532755130",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/8f0c319e190a25c19f60d9c1d43d8d9bad71b3ab404982418e560944f400be54/analysis/1532755162/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mod%20list-91797-0-3.7z?fid=1000278367&ttl=1535882567&ri=8192&rs=8192&setec=937d4b9758dea0414f1b9e74785ddc8b"
    },
    {
      "fileId": "1000280215",
      "name": "mod lis",
      "version": "0.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "mod lis-91797-0-4.7z",
      "uploadedUnix": "1534943922",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/d25a4b4465ebc6b9ed724668435d8331e72b0334929bdc5df5b01638aa998e0b/analysis/1534944004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mod%20lis-91797-0-4.7z?fid=1000280215&ttl=1535882567&ri=8192&rs=8192&setec=3e4e983f2a33764e9e0dddf28b0514c3"
    }
  ]
}