{
  "modId": 9181.0,
  "modName": "Magicka Tower Alpha",
  "summary": "A player home for Mage characters, still in early development",
  "descriptionHtml": "***NOTE: Since I have not worked on this mod for a long time and don\\'t know when I might get back to it, I hereby grant anybody permission to use any part of it in their own works without asking me first. I only request that I be credited if a substantial part of it is used, and perhaps notified so that I may see what becomes of it.***\r\n\r\n\r\n\r\nThis is a player home designed for Mage characters, in the vein of Oblivion\\'s Frostcrag Tower. In it\\'s current stage the house does not do or contain anything particularly useful, and for the time being serves as a test of architecture, room design and various other experiments.\r\n\r\nCurrent features:\r\n-[New]Atronach Spawner, creates friendly atronach familiars that will follow you\r\n-[New]More major changes to layout\r\n-[New]Kitchen and dining hall [unfinished]\r\n-Elevator system allows you to access all parts of the tower, including the new Sky Balcony.\r\n-Upper floor includes bedroom, Alchemy garden, display shelves, and a lounge with bar and hot tub\r\n-Large display room with mannequins and storage\r\n-Nonfunctional quest script and amateur navmesh\r\n-Some chests and bookcases. One of the chests spawns gems and jewellery, and some other random things.\r\n-Experimental lighting effects\r\n-Room with every crafting station including a Smelter. And the forge is a Skyforge, because why the hell not?\r\n-Lots of interiour space\r\n-Nice mountaintop location with scenic view, directly overlooking the elevator to Blackreach near Alftand\r\n-Fast travel marker\r\n-A khajiit with high level spells and really overpowered custom enchanted clothing. He doesn\\'t really do much right now.\r\n\r\n\r\nI am releasing this because I feel that it has reached a semi-useable state and therefore qualifies as an \\\"Early Alpha\\\". Any part of this mod may change at any time without warning. Do not leave items, objects, followers or anything else in the house or immediate surrounding area that you are not prepared to lose. You are advised not to use this mod with \\\"legitimate\\\" characters, as the current version gives no consideration to game balance. The Loot Generator chest creates large amounts of leveled loot every time it respawns, do not attempt to store items in it. Provoke the resident Khajiit at your own peril.\r\n\r\nAny comments, questions, tips, criticisms, suggestions or other communications will be reviewed and taken into consideration. Thank you for your interest.\r\n\r\n\r\nThis mod is also available on Steam Workshop:\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=10441\r\n",
  "categoryId": "68",
  "version": "0.3",
  "author": "BLOODGAZMS",
  "createdUnix": "1329058364",
  "updatedUnix": "1331440104",
  "containsAdultContent": false,
  "uploadedBy": "BLOODGAZMS",
  "primaryFile": null,
  "files": [
    {
      "fileId": "40933",
      "name": "MagickaTowerOld",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "72",
      "fileName": "MagickaTowerOld-9181.zip",
      "uploadedUnix": "1331093741",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/8701e965b0ba99d4312f2aefe5f584311a0f11600c820466e103546a277e51cc/analysis/1406735618/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MagickaTowerOld-9181.zip?fid=40933&ttl=1535768482&ri=8192&rs=8192&setec=f10dceaa0a6345497ab3c4009daed958"
    },
    {
      "fileId": "42209",
      "name": "Magicka Tower",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "188",
      "fileName": "Magicka Tower-9181-0-3.zip",
      "uploadedUnix": "1331440104",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/78065bb49839fae716d55efa94ab4ed760a18961541b69e2c2ad538f20778917/analysis/1406742805/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Magicka%20Tower-9181-0-3.zip?fid=42209&ttl=1535768482&ri=8192&rs=8192&setec=a851da12a3a4859e81f37b32f3b6a0dc"
    }
  ]
}