{
  "modId": 91822.0,
  "modName": "Additional Boss Battle - Champion of Hircine",
  "summary": "This mod adds a new additional superboss, Sivaas the Champion of Hircine. Located in South of Ustengrav.",
  "descriptionHtml": "[center][i]\"With the Dragon crisis arise, a shadowy figure lurks over the Skyrim in order scout and hunts the wild as commanded by the Lord of the wild, in the form of a wild beast, she is wandering throughout the northland, quietly, until . . . she met a hero with a dragon blood, as the Champion of the Wild, victorious battle against one of the Akatosh blood will surely pleases the one she serve for.\"\n<br />[/i][/center][center][/center]Anyway, have you ever . . . felt that when you play Skyrim long enough, having overpowered character and equipment, beat the crap out of strong superbosses, and somehow you want more difficulty/more harder boss battles?﻿ Then this mod for ya. So basically im sharing what i made when im having op mc and no more challenge the game can present to me.\n<br />\n<br />Add an additional boss battle, Champion of Hircine, Sivaas (in dragon language it literally means \"beast\"). And its not some cheap battles like thick hp and deadly damage and thats it, but she has unique abilities and has 3 forms to fight for, as she is Hircine's Champion, she is blessed by his power. But of course, this boss battle is aimed when you have nothing to beat out of the crap from game, means Ebony Warrior or even Kaarstag is out of the way, i assure you she is stronger. Anyway enough chitchat, and get to it.\n<br />[center]﻿[/center][b]OVERVIEW[/b]\n<br />Sivaas, the Champion of Hircine, has 3 forms, 1) Wolf form, 2) Human form, and laslty 3) Werewolf form. Each has unique abilities and strategy, and will be described below.\n<br />\n<br />[b]STATS[/b]\n<br />&gt; Wolf form\n<br />Level ﻿: 150+ (scaled with player 1.0, min. of 150)\n<br />HP : 1651+ (more hp as he has more level)\n<br />\n<br />&gt; Human form\n<br />Level ﻿: 150+ (scaled with player 1.0, min. of 150)\n<br />HP : 1791+ (more hp as he has more level)\n<br />\n<br />&gt; Werewolf form\n<br />Level ﻿: 150+ (scaled with player 1.0, min. of 150)\n<br />HP : 2739+ (more hp as he has more level)\n<br />\n<br />[b]ABILITY[/b]\n<br />&gt; Wolf form\n<br />[i]\"A form she always use, being a wild hounds means she has high mobility to go for, either for hunting or quests.\"\n<br />[/i]An oversized black wolf (1.5 scale) as her first form.\n<br />+Deadly attack\n<br />[i]\"As the Champion of Hircine, she is no mere of a wild hounds, blessed by him, her single attack is a difference between the hunt or being hunted.\"\n<br />[/i]Basically, her basic attacks deals a lot more damage than the usual wolf.\n<br />+Leader of the Packs\n<br />[i]\"In the Hunting Grounds or Mundus, she is an apex huntsman, she commands the aspect of herself to aids her in battle, in the form of a shade.\"\n<br />[/i]So during the battle, she may conjure up to 2-6 wolves shade, with the same stats and attacks, except its a shade, so 1 hit kills them. And she can conjure countless times, depending how long you battle or damage her, be sure to kill her fast in this form (but i doubt :p).\n<br />\n<br />&gt; Human form\n<br />[i]\"Her original form, once a Nord with a great magical capabilities, only when she is up for a battle with a worthy opponents.\"\n<br />[/i]Nord wearing full unique Nightingale Armor, has a spellsword combat style (1 hand sword, other hand spells.)\n<br />+Ebonyflesh\n<br />+Flame Cloak\n<br />+Wall of Storms\n<br />+Close Wounds\n<br />[i]\"She was once a mage with a great power, until she serves under the Lord of the Wild to acquire a new beastly power.\"\n<br />[/i]So during battle she cast the usual mage spells.\n<br />+Summon Wolf Companion\n<br />[i]\"Whenever she ventures and do wild quests, her beloved companion is always there by her side to aid.\"[/i]\n<br />The name is Silnir (means \"Soul Hunt\" in dragon language), so during battle, she may conjure her favorite pet, Silnir (not to be confused with her wolf form, this is [b]real[/b] wolf, size same as wolf, but more deadly.)\n<br />+Ebony Sword of Health Absorption\n<br />[i]\"A sword gifted to her from past wildhunt, a single swing to her enemies can drain the life of it.\"\n<br />[/i]Normal Ebony Sword with health absorb enchantment as her equipment.\n<br />+Hero Perks\n<br />[i]\"Being a champion, she has fought countless battles, and experience battlefield more than anyone.\"\n<br />[/i]Lots of perk she has, including: Armsman, Bladesman, Savage Strike, Critical Charge, Paralyzing Strike, Custom Fit, Unhindered, Deft Movement, Augmented Flames/Frost/Shock, blablabla lalala basically anything you find relating one-handed, destruction, and light armor.\n<br />\n<br />&gt; Werewolf form\n<br />[i]\"Beast form, as she is blessed by the Hircine, able to draw out the wild of her inner self, becoming the power of the true hunt.\"\n<br />[/i]Behold her true powah! Trust me, you need to watch out, because tbh, i hate this form.\n<br />+Werewolf Claws\n<br />[i]\"A single strike of her claws can tear the body and soul of her enemies apart\"\n<br />[/i]Her basic attacks deals a lot of damage, using werewolf unarmed damage bonus, and extra damage bonus.\n<br />+Werewolf Roar\n<br />[i]\"The moon awakes, the beast releases her wild roar, pushing anything stands at her side.\"\n<br />[/i]No different than Unrelenting Force Shout tbh.\n<br />+Ether Form\n<br />[i]\"As an experienced huntsman, she becomes the nature herself, rendering her almost invisible and invulnerable.\"\n<br />[/i]During battle, she may become ethereal, invulnerable and semi-invisible, effect lasts until she attacks.\n<br />+Beast Doppelganger\n<br />[i]\"By twisting the reality with the power of the wildhunt, she creates an illusion of herself, as powerful as she is.\"\n<br />[/i]Do you know whats more deadly than a Werewolf? 2 Werewolves haha! The Doppelganger is invulnerable, so dont try to attack it, waste of time. And like the description, its as strong as her Werewolf form.\n<br />\n<br />&gt; All form\n<br />+Avoid Death\n<br />[i]\"She knows death more than anyone, able to standout even at the risk of death itself.\"[/i]\n<br />All 3 forms has Avoid Death perks.\n<br />\n<br />[b]STRATEGY\n<br />[/b]&gt; Wolf form\n<br />Attack as usual, but once she conjure her aspect/shade, during the howl animation, pls, be fast killing them during the duration of animation, otherwise 2-6 packs of wolves attacking you at once is a huge ton of damage. Since her basic attack deals a lot of damage, i recommend using armor with a high armor rating.\n<br />\n<br />&gt; Human form\n<br />What you need: Armor with high resist fire and shock. If you are a warrior (using shield), her basic attack isn't something to worry about imo. Once she conjure her companion, there's trick to it if you dont want to fight both at once for the rest of the battle: Take out the wolf BUT dont kill it, make it in low/critical health, since default wolf combat style force the wolf to run away at low health, this leads you to duel with her 1 vs 1, while the wolf run away, and dont worry, as long as you didn't kill the wolf, she won't summon a new one, unless killed.\n<br />\n<br />&gt; Werewolf form\n<br />This is where things get nasty, huge ton damage from basic attacks, ragdoll shout, invulnerability at times, even better double the trouble from doppelganger. Normally, as usual, high rating armor. If at the start of combat she didn't conjure doppelganger, best way is to stay close to her, keep attacking her, make her busy so she won't have time to summon doppelganger, but of course when stay near her attacking, try to zig zag or move left-right a lot to avoid any incoming fus ro dah, worst case, she summon doppelganger, if that happens, prepare to use conjuration spells, at best to tank from doppelganger a bit, or, you can bring follower as a tanker (if you don't want its okay, but well, bite the dust, as fighting 2 deadly werewolves solo is a nightmare.) And if she become ethereal, move right left to avoid incoming fus ro dah or attacks, and if you use shield, prepare to block. And lastly, once again, don't even try to [b]attack [/b]doppelganger, its invulnerable. Oh almost forgot, her doppelganger can fus ro dah too.\n<br />\n<br />&gt; Universal strategy\n<br />Bring a lot of potions, either heal, resist, fortify, anything!\n<br />\n<br />[b]LOCATION\n<br />[/b]She is located at the South of Ustengrav, so just fast travel to Ustengrav, walks south (a bit west) you should find her (near small watery with trees), otherwise search the area around south of Ustengrav if you didn't found it (probs fighting thugs or such and walks away from original appointed position.) Worst case is using console command type \"help sivaas\" without \", then type \"player.placeatme &lt;sivaas id in the upper most&gt;\" without \".\n<br />\n<br />[b]REWARDS\n<br />[/b]Plenty of gold, plenty of flawless gem, daedra heart, her Ebony Sword, Spell Tome: Conjure Champion of Hircine, and her armor, importantly, her Nightingale Cuirass, as i enchant it with a unique effect, able call out Doppelganger at low health to fights for 10 seconds, fortify armor, or fortify health rate.\n<br />\n<br />[b]REQUIREMENTS\n<br />[/b]Original Skyrim.esm and no DLC needed.\n<br />\n<br />[b]INSTALLATION\n<br />[/b]Copy the Sivaas.esp to Skyrim/Data folder or install using NMM.\n<br />\n<br />[b]CLOSING\n<br />[/b]Forgive for the small mod i upload, first time uploading in a . . .years of playing Skyrim (not really, i played back at 2013-204, and decided to play again now), and still new to modding.\n<br />\n<br />Q: Its 2018, and still play vanilla Skyrim and not SSE?\n<br />A: Mind you yes, finished the final exam and the thing is, my pc is at low spec, and the only thing fun and worth playing is Skyrim, sad &gt;.&lt;\n<br />Also SSE has low mods count compared to the original, so i prefer the vanilla instead, given my pc spec too.\n<br />\n<br />Q: Just this? This is the mod?\n<br />A: Yes, well i planned to have a quest beforehand and fully voiced her using my own voice, but rip my creation kit and pc doesn't match up, everytime i open quest tab or adding voice to creation kit, it suddenly CTD for whatever unknown reason, so no chance to learn how the quest works or voice lines works.\n<br />\n<br />Q: What the hell u just using wolf images from wikia!\n<br />A: For some reason, the screenshot produces blurry, low res image, so yeah, forgive me.\n<br />\n<br />Q: Why dontcha just buy a new pc?\n<br />A: You think its cheap? Wait why unrelared question even . . .\n<br />\n<br />Q: How did you know its stronger than Ebony Warrior/Karstaag?\n<br />A: Obv because im fighting them and comparing them, much more, i even do 1v1 4 of them (1 more boss i created but not yet uploaded), Ebony Warrior defeated on 1st form, and Karstaag kneel and defeated on 2nd form.\n<br />\n<br />Q: Do you plan on adding more mod/to this mod?\n<br />A: Maybe yes, maybe no, tho i have idea at my head waiting to be realized, depends. Given the community (Skyrim vanilla) small rn, chance are slim.\n<br />\n<br />Q: This mod is shit! Wtf, its just adding small stuff etc etc lalalala\n<br />A: Thx for the compliment.\n<br />\n<br />Q: Sivaas is too hard/too ez, wtf!\n<br />A: Well, i tested her via my old character in which i think, a bit op (can defeat Ebony Warrior without much sweat.) if so too weak/strong, you can always tell/hit me and i will make an optional file to make it more weaker/stronger. I also open to suggestion in which adding more powers to her, if i redeem necessary.\n<br />\n<br />Q: Can i talk to you?\n<br />A: Yes u can always hit me and i will try to reply if im online, btw its getting into unrelated to mods, so stop right there, by the order of the Jarl!\n<br />\n<br />Anyway, thanks for anyone downloading, trying, or playing with my mods, much appreciated, also for those who still play Skyrim, gl hf.",
  "categoryId": "83",
  "version": "v1",
  "author": "ImCookie",
  "createdUnix": "1528513283",
  "updatedUnix": "1528513283",
  "containsAdultContent": false,
  "uploadedBy": "ImCookie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000274821",
      "name": "Sivaas",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Sivaas-91822-v1.rar",
      "uploadedUnix": "1528513248",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/bb4ea8c49e61dd45934db40e77fbde3ba698a2c94bb00fce729a94f4b001b431/analysis/1528513323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sivaas-91822-v1.rar?fid=1000274821&ttl=1535882609&ri=8192&rs=8192&setec=9864a042fe10d72aa3e0bcf78897eceb"
    }
  ]
}