{
  "modId": 91857.0,
  "modName": "Pretty Female Preset",
  "summary": "This mod is a downloadable female preset for your in game Skyrim female character. It's supposed to be pretty but I'm not deciding. I just made a character myself and thought it was pretty so i thought why not share it with u guys :).",
  "descriptionHtml": "Requirements for the preset:\n<br />- [url=http://skse.silverlock.org/]SKSE (Skyrim Script Extender)[/url]\n<br />- [url=https://www.nexusmods.com/skyrim/mods/29624]Racemenu[/url]\n<br />- [url=https://www.nexusmods.com/skyrim/mods/70363/]KSHairdosHDT[/url]﻿\n<br />- [url=https://www.nexusmods.com/skyrim/mods/56056]Mikan Eyes[/url]﻿\n<br />- [url=https://www.nexusmods.com/skyrim/mods/22701]Seductive Lips HD[/url]﻿\n<br />- [url=https://www.nexusmods.com/skyrim/mods/35267]SG Female Textures Renewal[/url]\n<br />\n<br />This preset works best with CBBE, however, if u want to, u can try it out on UNP or others as well and let me know if it works well or not. I for once haven't tried out how it looks on other body mods so you are free to experiment. This is actually my first mod, if sharing a preset classifies as a mod that is :P .\n<br />\n<br />Installation\n<br />Put the .jslot file in your Data&#92;SKSE&#92;Chargen&#92;Presets folder and load the preset from racemenu. If u want to change appearance of existing character to this preset, u need not start new game, just type 'showracemenu' (without the inverted commas) in console which is accessed with the \" ` \" key which is usually below the ESC button. If you use Mod Organizer, this folder is in your overwrite folder in your Mod Organizer Base Directory. So it should go like this ModOrganizerBaseDirectory&#92;SKSE&#92;Chargen&#92;Presets and inside the .jslot goes. I highly recommend installing it manually as I myself don't know how to install from Mod Managers :'/ (Sorry, it's my first mod. I apologize in advance for any inconvenience caused by my inexperience, if any other mod author has a problem with my mod, please let me know.)",
  "categoryId": "29",
  "version": "1.00",
  "author": "MTB1357",
  "createdUnix": "1528694733",
  "updatedUnix": "1528694733",
  "containsAdultContent": true,
  "uploadedBy": "talhabaig1357",
  "primaryFile": null,
  "files": []
}