{
  "modId": 91868.0,
  "modName": "Playable Gelebor's Armor (Includes Female Version)",
  "summary": "Do you ever want an armor that Gelebor wears in the Dawnguard DLC? You may have worn the Ancient Falmer armor with Pauldrons, but do you want the armor without pauldrons? Now you can! With this mod, you can obtain Gelebor's armor after you defeat Gelebor's brother, Vyrthur. The armor is in the chest along with Snow elf gauntlets, boots, and crown.",
  "descriptionHtml": "I want everyone to have the armor because I think it's fair to have an alternative standalone armor version for us to role play. Also, I like the armor. I also added the female version of it. If the Dragonborn is female, she can wear the armor and has no pauldrons! I had a guy to help me with that. However, I don't have CBBE and UNP compatible with that yet, and I don't know if it will ever happen. Hopefully it will. Maybe.\n<br />\n<br /> The chest is located outside Inner Sanctum where Vyrthur is, at the side of the stairs near the balcony. A Snow Elf chest with almost a full set of Snow Elf armor with the exception of the Snow Elf pauldron armor, because you can easily obtain it from Vyrthur, if you kill him that is. If you Fus Ro Dah'd Vyrthur off the balcony and still want the pauldron armor, then get your butt down there and find his body to loot. But I recommend you get the armor from the chest first, then go down to where he fell and died. If you want to obtain the armor early and not do the Dawnguard questline, then use console commands to add the ancient falmer armor into your inventory. I made Gelebor's armor playable, that means you can no longer just equip it with console commands, you can add it in your inventory and equip it manually. Not with console commands to equip, because it shows up in your inventory. I don't know if it's upgradeable for armor stats, let me know if it isn't and I will fix it.\n<br />\n<br /> As I said, the armor is playable for a female version. It's only shown vanilla, but that doesn't affect your CBBE or UNP mod, you can just wear it and take it off. It's just that the vanilla armor female version don't have their breasts big or something. But I'm pretty sure it won't cause issues. If you're good at converting the armor into CBBE version or UNP version (UUNP version to be exact), go ahead. You have my permission to make a patch for that. I do like for those conversions uploaded on Nexus. But I hope you get the creators of CBBE and UNP's permission for that. Be sure to ask. Be sure to credit me and the creators for the patches. Consider this mod to be kind of a resource for female snow elf NPCs or followers. Thank you, and enjoy my mod! :D",
  "categoryId": "54",
  "version": "1.1",
  "author": "Commando414",
  "createdUnix": "1528737568",
  "updatedUnix": "1535008045",
  "containsAdultContent": false,
  "uploadedBy": "Commando414",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000274979",
      "name": "Playable Gelebor's Armor",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "419",
      "fileName": "Playable Gelebor's Armor-91868-1-0.rar",
      "uploadedUnix": "1528737511",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/39ae5c43e389f1082d9cb07dc7093ca54529936fbd7efd2a511b3c7f818c55fb/analysis/1528737748/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Playable%20Gelebor%27s%20Armor-91868-1-0.rar?fid=1000274979&ttl=1535882679&ri=8192&rs=8192&setec=16d62f5709f874c76c21c1d5684a4b2f"
    },
    {
      "fileId": "1000280257",
      "name": "Playable Gelebor's Armor",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "419",
      "fileName": "Playable Gelebor's Armor-91868-1-1.rar",
      "uploadedUnix": "1535008045",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/97560b0a72ba7aa50d0e23fee1bcdd7bce950a7afbb21b901989de158625662e/analysis/1535008108/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Playable%20Gelebor%27s%20Armor-91868-1-1.rar?fid=1000280257&ttl=1535882680&ri=8192&rs=8192&setec=f44d2ed69f66b47d3537639f6297c8c2"
    }
  ]
}