{
  "modId": 91985.0,
  "modName": "Dangerous Friends and Enemies - DFE",
  "summary": "DFE attempts to make game harder by boosting up your allies and enemies to make them more challenging and dangerous.",
  "descriptionHtml": "Name: Dangerous Friends and Enemies (DFE)\n<br />Author: BlackerrR\n<br />Version: 0.9beta\n<br />Requirements: [url=https://www.nexusmods.com/skyrim/mods/71214/]Unofficial Skyrim Legendary Edition Patch\n<br />\n<br />[/url]﻿[color=#d5a6bd][size=3]Description:\n<br />\n<br />[/size][/color]First of all, sorry for bad english.This mod, simply said, attempts to make Skyrim battles more dangerous by boosting up most of allies (companions, conjured creatures) as well as enemies (from bears to bandits to daedra). All of them are going to be more deadly now. The main reason this mod exists is to make late game more challenging as well as early game but still trying to keep difficulty at reasonable level. Yes, this will make enemies much tougher, but at later levels, you're supposed to be the strongest and you'll be while your oppononents will still be a challenge. So don't expect level 60 Bandit Thug, but Boss for example will scale to much higher levels. My inspiration came from [url=https://www.nexusmods.com/skyrim/mods/9286]SkyRe[/url]﻿'s 'Scaling Enemies' plugin which does a good job in the beginning but fails at stabilizing late game,which means you can basically become a god at level 60.\n<br />\n<br />[color=#d5a6bd][size=3]Two extremely important notes:\n<br />\n<br />[/size][/color]- DFE requires [url=https://www.nexusmods.com/skyrim/mods/71214/]Unofficial Skyrim Legendary Edition Patch[/url]﻿. This mod fixes a lot of inconsistencies that I would have to fix myself if it weren't for USLEEP, besides, anyone serious enough about modding the game must have this mod in their load order.\n<br />\n<br />- This mod works fine by it's self, but I HIGHLY recommend using this as a base to build your mod list around. Experience with DFE can be improved dramatically (as it's meant to be played) by few recommended mods like combat mods, perk redistribution etc, list below.\n<br />\n<br />[color=#d5a6bd][size=3]Here's the summary of what to expect from DFE:\n<br />\n<br />[/size][/color]- Boosts up companions to level with you up to 100 level;\n<br />- Boosts up opponents to higher levels based on their rank;\n<br />- Some NPCs have static levels;\n<br />- Boosts up friends'/enemies' health/stamina/magicka by reasonable amount;\n<br />- Boosts up friends'/enemies' attack/spell damage;\n<br />- Many NPCs have been given perks and spells that suit their combat style (perks alone make them more dangerous);\n<br />- Really tough Dragon Priests;\n<br />- Changes NPC and Race records only with few exceptions;\n<br />- Boss is The Boss!\n<br />\n<br />[color=#d5a6bd][size=3]Here's the summary of what not to expect from DFE:\n<br />\n<br />[/size][/color]- No scripts;\n<br />- Does not create new NPCs;\n<br />- Does not make any changes to Dragons;*\n<br />- Does not give any fancy (again, with few exceptions) abilities to NPCs;\n<br />- No NPCs with unrealistic health and magicka pools;\n<br />- No changes to combat;\n<br />- No AI changes.\n<br />\n<br />*I've planned on making changes to dragons, but there are so many stable mods already that it would be pointless to expect from users to give up their favourite dragon mod/s so they could play mine. Besides, a lot of these mods do much better job than what I would do.\n<br />\n<br />[color=#d5a6bd][size=3]Q&amp;A:\n<br />\n<br />[/size][/color][color=#ead1dc]   ﻿- Q: Why BETA?\n<br />[/color]   ﻿- A: Mod is basically done, tested to some extent and playable, but too many records are changed that there's no way to test them all in different scenarios, which is the only reason to call it BETA. As with any other mod, there is a chance of minor bugs or inconsistencies that I haven't stumbled upon, but you might. For example, some enemy may be too overpowered when it shouldn't or vice versa, there are ton of stuff that can, but shouldn't, happen, so I rely on your feedback if anything goes wrong.\n<br />\n<br />[color=#ead1dc]   ﻿- Q: Is DFE hardcore like some other popular mods?\n<br />[/color]   ﻿- A: No, it really shouldn't be, my intentions are quite the opposite. I made this mod because I don't like the way these mods kill all the fun by boosting enemies so much, I love the challenge in combat, but I don't want to spend 30 minutes loading saves in single battle or using console to kill enemies, plus your allies quickly become useless. But, is it harder than vanilla Skyrim? Oh yes.\n<br />\n<br />   ﻿[color=#ead1dc]- Q: Load order?\n<br />   ﻿[/color]- A: I prefer manual approach, but if you want you can try using LOOT:\n<br />\n<br />   ﻿   ﻿If you're using kryptopyr's WAFR, CCOR, CACO or CCF put Dangerous Friends And Enemies - Stronger NPCs.esp BELOW them.\n<br />   ﻿   If you're using Immersive Weapons put Dangerous Friends And Enemies - Stronger NPCs.esp BELOW it.\n<br />   ﻿   If you're using Skyrim Immersive Creatures and High Leveled Enemies put Dangerous Friends And Enemies - Stronger NPCs.esp BELOW them.\n<br />   ﻿   If you're using any follower management mods put Dangerous Friends And Enemies - Stronger NPCs.esp ABOVE them.\n<br />   ﻿   If you're using any combat mods put Dangerous Friends And Enemies - Stronger NPCs.esp ABOVE them.\n<br />   ﻿   Every patch must go BELOW its' requirements!\n<br />   ﻿\n<br />   ﻿[color=#ead1dc]- Q: Compatibility?\n<br />   ﻿[/color]- A: Any mod that changes NPC records will not work well with DFE. As long as DFE is loaded AFTER those mods, DFE will work fine, but that other mod might not, unless you install patch. If there is no patch available at the moment you can make it yourself by using countless tes5edit tutorials available online or I might make it for you if I have time. Currently, there are few small patches that fixes some minor issues between these mods and DFE, but I plan on making more. Most popular mods work perfectly well with DFE without additional patches.\n<br />\n<br />   ﻿[color=#ead1dc]- Q: What mods do you recommend?\n<br />   ﻿[/color]- A: You can use this mod with 95% of mods on Nexus, but here's my list of stable mods that work perfectly with DFE, making it better actually:\n<br />\n<br />   ﻿   ﻿- [url=https://www.nexusmods.com/skyrim/mods/18436/]ASIS[/url]: This mod will dinamically distribute perks (even perks from other mods) among NPCs making DFE NPCs even more diverse and interesting. Also, this mod can optionally increase spawn rates, so I urge you download ASIS and its' improved [url=https://www.nexusmods.com/skyrim/mods/53047]INI[/url] file;\n<br />   ﻿   ﻿- Really any mod from [url=https://www.nexusmods.com/skyrim/users/3959191]EnaiSiaion[/url], but here are few relevant to this mod: [url=https://www.nexusmods.com/skyrim/mods/76529]Wildcat - Combat of Skyrim[/url], [url=https://www.nexusmods.com/skyrim/mods/68425]Ordinator - Perks of Skyrim[/url], [url=https://www.nexusmods.com/skyrim/mods/16225]Apocalypse - Magic of Skyrim[/url]. ASIS will take full advantage of last 2 mods;\n<br />   ﻿   ﻿- Really any mod from [url=https://www.nexusmods.com/skyrim/users/4291352]kryptopyr[/url], her fixes go beyond that of USLEEP and do much more: [url=https://www.nexusmods.com/skyrim/mods/49791]CCOR[/url], [url=https://www.nexusmods.com/skyrim/mods/34093]WAFR[/url], [url=https://www.nexusmods.com/skyrim/mods/43053]CCF[/url], [url=https://www.nexusmods.com/skyrim/mods/69306]CACO[/url] - you'll need improved alchemy to make potions and poisons worth something against now tougher enemies;\n<br />   ﻿   ﻿- [url=https://www.nexusmods.com/skyrim/mods/24913]Skyrim Immersive Creatures[/url]. If using High Leveled Enemies, I recommend installing SIC's version;\n<br />   ﻿   ﻿- [url=https://www.nexusmods.com/skyrim/mods/27644/]Immersive Weapons[/url] and [url=https://www.nexusmods.com/skyrim/mods/19733]Immersive Armors[/url]﻿;\n<br />   ﻿   ﻿- [url=https://www.nexusmods.com/skyrim/mods/3829]Deadly Dragons[/url] - HIGHLY recommended this or any other mod that boost dragons or you could find dragons too weak compared to late game enemies. If using DD and SkyUI, I suggest setting to EXPERT difficulty in MCM menu.\n<br />\n<br />[color=#d5a6bd][size=3]Issues:[/size][/color]\n<br />\n<br />- Dragon Priests could stop fighting when in combat and just stare at you with one hand in the air. Staggering will make them fight again. Happened to me only once in more than 5 hours of testing, I am not even sure if it's even this mod's bug.\n<br />- Brawls will be more difficult since a lot a NPCs have more health than before. Just lower down your difficulty level during brawl.\n<br />- There could be inconsistencies in difficulty with other mods that add their own NPCs, which is to be expected. For popular ones I plan on making a patch (3dNPCs, Helgen Reborn etc)\n<br />\n<br />[color=#d5a6bd][size=3]Install/Uninstall:[/size][/color]\n<br />\n<br />- To install just copy Dangerous Friends And Enemies - Stronger NPCs.esp to your Skyrim&#92;Data folder and don't forget to activate it in your favorite mod manager.\n<br />- To uninstall simply delete Dangerous Friends And Enemies - Stronger NPCs.esp from your Data folder. You can safely uninstall DFE mid playthrough, just wait for world to respawn (usually 30 days, or you could use SIC feature in MCM menu). \n<br />\n<br />For obvious reasons, I suggest starting a new game, but you can install this mod in mid playthrough, just wait for world to respawn to start seeing DFE enemies. However, to 'update' companions with levels and perks from DFE, simply open console, disable character, close then open console again, enable and your companion 'should' be updated.\n<br />\n<br />[color=#d5a6bd][size=3]Credits:[/size][/color]\n<br />\n<br />- [url=https://www.creationkit.com]creationkit.com[/url] for countless tutorials on their site;\n<br />- Thanks to xEdit Team for creating [url=https://www.nexusmods.com/skyrim/mods/25859]tes5edit[/url]﻿, probably the best modding tool for Skyrim.\n<br />- Thanks to [url=https://alphacoders.com/users/profile/54003]xGhostx[/url]﻿ for uploading image that I use for this mod.\n<br />\n<br />[color=#d5a6bd][size=3]Permissions:[/size][/color]\n<br />\n<br />You are not allowed to redistribute this mod without my explicit permission.",
  "categoryId": "79",
  "version": "0.9beta",
  "author": "BlackerrR",
  "createdUnix": "1529193578",
  "updatedUnix": "1529193578",
  "containsAdultContent": false,
  "uploadedBy": "BlackerrR",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000275430",
      "name": "Dangerous Friends and Enemies",
      "version": "0.9beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "511",
      "fileName": "Dangerous Friends and Enemies-91985-0-9beta.7z",
      "uploadedUnix": "1529192585",
      "modVersion": "0.9beta",
      "virusScanUrl": "https://www.virustotal.com/file/46e472691eac95069ef2dbc7f4d17db8a5bb44c7174db4b420c97441b7d6684e/analysis/1529192705/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dangerous%20Friends%20and%20Enemies-91985-0-9beta.7z?fid=1000275430&ttl=1535882812&ri=8192&rs=8192&setec=e47d726a326115355911d445ab747bc8"
    }
  ]
}