{
  "modId": 91990.0,
  "modName": "Hubris - A Roleplaying Device",
  "summary": "A problem many have, especially with a Roleplaying Overhaul like Requiem, is that their character grows too strong before their story is over. This mod sets the player back with an infirmity that they must overcome as their story progresses.",
  "descriptionHtml": "[center][img]https://i.imgur.com/P7eRcdK.png[/img][/center]\n<br />\n<br />[center]﻿[img]https://i.imgur.com/FD1xmyR.png[/img]﻿[/center][size=2]\n<br />Hubris is the downfall of the mighty, an overwhelming confidence and sense of self-worth. One might even think they are invincible, impervious to the injuries that befall mortal men. The Last Dragonborn may indeed become powerful enough that the enemies of Tamriel can no longer provide a challenge and begin feeling like a god. In that case, divine intervention, or the roll of the DM's die, may provide an [i]accident[/i] that will cause a crippling infirmity to put them back into their place.\n<br />\n<br />This is predominantly a Roleplaying tool, a twist in the player character's story in order to prevent them from becoming overpowered. A former sword saint may no longer be able to dance around his enemies with his crippled leg, forcing him to put down his sword and take up archery. The archmage of Winterhold may find herself unable to draw upon magicka, forcing her to rely on more primitive tools to accomplish her future goals.\n<br />[/size]\n<br />\n<br />[size=3][color=#d38c43][b]HOW THIS WORKS[/b][/color][/size]\n<br />[size=2]At a certain point, the player will find a book called \"Hubris\". Upon reading this book, the player may feel a dark omen about their future. The next time the player is struck below 50% health, they will receive an injury to their greatest asset. The current possible injuries are as follows:\n<br />\n<br />[list]\n<br />[*]A brain injury causing a constant 40 point drain on magicka, making casting spells all but impossible.\n<br />[*]A leg injury causing weaker attacks, slower combat movement, and full body staggers when hit, greatly impairing melee combat.\n<br />[*]An eye injury causing much less effective archery.\n<br />[*]A lung injury causing heavy breathing and uncontrollable coughing, making sneaking very difficult.\n<br />[/list]\n<br />[/size]\n<br />\n<br />[size=3][color=#d38c43][b]INSTALLATION[/b][/color][/size]\n<br />[size=2]Install like any other mod with your favorite mod manager. I recommend Mod Organizer.[/size]\n<br />\n<br />[size=3][color=#d38c43][b]INCOMPATIBILITY[/b][/color][/size]\n<br />[size=2]Possible incompatibility with any other mod that causes full body staggers, but that would not cause technical problems, just may affect whether the player gets full body staggers or not. When you turn off full body stagger with another mod, you'll also turn off full body stagger for this mod. Beyond that, none.[/size]\n<br />\n<br />\n<br />[center][color=#d38c43][size=4][b]~ CREDITS ~[/b][/size][/color]\n<br />[size=2]VictorF and the other members of the Prometheus Discord for providing help\n<br />MANLY MAN, CaucyBiops, and others from the Skyrim Requiem Discord for their ideas[/size][/center]\n<br />\n<br />[center][img]https://i.imgur.com/P7eRcdK.png[/img][/center]",
  "categoryId": "24",
  "version": "0.1.0",
  "author": "Aix",
  "createdUnix": "1529203287",
  "updatedUnix": "1529203287",
  "containsAdultContent": false,
  "uploadedBy": "Aixcalibur",
  "primaryFile": null,
  "files": []
}