{
  "modId": 92006.0,
  "modName": "Arctic Hunter Armor and Arrows",
  "summary": "Blend with the frozen wilds of Skyrim, and hunt your prey in a blink of an eye.",
  "descriptionHtml": "Inspired from the game \"Horizon Zero Dawn\" and it's DLC \"The Frozen Wild\".\n<br />This mod add retextured Skaal clothing as light armor, and a wide variety of arrows\n<br />You can craft these arrows and armor at any forge after completing the quest \"A New Source Of Stalhrim\"\n<br />[size=4]*UPDATED* Please read important and extra notes near the end of the description for known bugs, conflicts, etc. Otherwise, don't hesitate to ask me anything.[/size]\n<br />\n<br />--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n<br />\n<br />[youtube]JQny0A0QTjE[/youtube][youtube]ftvVXdJ9U48[/youtube]\n<br />\n<br />--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n<br />[img]https://i.imgur.com/ywBwQF6.png[/img]\n<br />[i]\"The Skaal are descended from the Nords who served the Dragon Cult on Solstheim. [/i][i]All life is sacred to the Skaal, and they try to live in harmony. [/i][i]Early in the 3rd century of the Third Era, a group of Skaal left the village, founded Thrisk Mead Hall, and lived like the Nords of old, hunting and fighting without restraint, with the mightiest warrior rising to leadership. There are another few who also left the Skaal, formed their own tribe, where each and every individuals who's capable of surviving on their own, are independent, to live a life of freedom, to embrace with everything nature has blessed upon the land and sea, mountain and forest, yet, nearly isolated from societies other than their own. Even among them self, there's little contact, as they only seek help from others in times of great need. Spending their life in the wilds, taught by nature, they soon possesses hunting skill beyond others, feared by the most ferocious predators, along with a vast [/i][i]knowledge of crafting , especially Stalhrim - colored apparel to match the environment, which help them blend in with the surrounding - arrows that flies as fast as a blink of an eye, to deliver a swift end to any who dare crossing their path.\n<br />[img]https://i.imgur.com/7iXI8Po.png[/img]\n<br /> In the Fourth Era, most hunters at the age of maturity and older began their journey to the south, seeking the world beyond their homeland. Luck has truly shunned them. When they're setting up camp along the coast, the Red Mountain began to erupts, the Hunters [i]met their [i]unfortunate, [/i]ultimate demise as the ash and lava[/i] consumes the l[/i][i]andscape, and a great number of people lost their lives while many cities were completely destroyed. These hunters were already small in population, yet too many was lost in the disaster, and, oddly, the rest who stayed at the northern part of the island remain unknown - no one know where they are, do they still exist until now. They had lived a life nearly isolated from societies other than their own. No scholars, historians or adventurers are able to reach the hunters, thus their legacy was never be recorded to history. It [i]slowly fade away from the memories of those who [i][i]lucky or unfortunate enough to encounter them, corpses, down to their very bones, their creations, inscriptions, everything, await to be adrift[i][i][i][i] and buried by the flow of time. But the hunters has formed a bond with the very land where their home is. Because of so, the remains of the hunters refuses to abide the law of time, immerge into the ice and snow of Solstheim, reaching to the Stalhrim deposits around the island.  According to tales and rumors: \"the one who mine those deposits, if they are worthy, are granted the [i]knowledge and memories of the Arctic Hunters, with a vision of a tribe, rises from ice and snow. [i]How they use what they were given to falls upon them, as it has to the others before them, but know that the consequences will show no mercy.'\n<br />[img]https://i.imgur.com/f8DIYQe.png[/img][/i][/i][/i][/i][/i][/i][/i][/i][/i]\n<br />[/i]\n<br />[size=3]Arctic Hunter Armor[/size]\n<br />[img]https://i.imgur.com/7XF01Py.png[/img]\n<br />While retaining the same overall design by the Skaal, the apparel has been greatly improved in many ways: Stalhrim as buckles and accent; reinforced leathers and pelts, allowing the apparel to be used as light armor; the pelt used in the recipe can be either one of four different type; most importantly -dyed to match the frozen environment, which give the wearer ability to blend into the surrounding while in stealth, thus making them much harder to be seen by prey or enemy.\n<br />[youtube]nB3pQptAmbg[/youtube]\n<br />\n<br />[size=3]Arctic Arrows[/size]\n<br />[img]https://i.imgur.com/mAGFqE8.png[/img]\n<br />The Arctic Hunter harnesses their crafting skill and knowledge, turning firewood and various ingredients into arrows that pierce through target in a blink of an eye, carries magic effect, or to be fired multiple arrows at once.\n<br />\n<br />[size=3]Blast Arrow[/size]\n<br />[img]https://i.imgur.com/iQr9SOP.png[/img]\n<br />Crafted with glow dust, or combination of fire, frost and void salt, these arrow will explode upon contact, flinging nearby target away. Be careful not to be too close where your arrow hit. The explosion doesn't deals any damage, however target can take fall damage or be killed if they fell onto lower ground. Dragons are able to hold their ground, as the force from the blast isn't strong enough to affect such heavy weight creatures. Knowledge of magic item crafting is needed to craft these arrow, unless they managed to get their hands on glow dust\n<br />[youtube]By_LjUCzk_E[/youtube]\n<br />\n<br />[size=3]Corruption Arrow[/size]\n<br />[img]https://i.imgur.com/Zymiyyi.png[/img]\n<br />Target shot by this arrow will experience temporary mental disorder, and if target is mechanical, their control core will be overridden, causing them to attack anything nearby insight. Moon sugar is used to craft these arrow. Troll fat can be used as alternative, but this would requires the skill to create magical item.\n<br />[youtube]PCQDvh3t3n0[/youtube]\n<br />\n<br />[size=3]Hunter Arrow[/size]\n<br />[img]https://i.imgur.com/FSy7hZT.png[/img]\n<br />Essential arrow for every Arctic Hunter, easily crafted from the very same recipe used to make regular steel arrow, yet these arrow are superior in every way.\n<br />[youtube]GD88hUIXBm0[/youtube]\n<br />\n<br />[size=3]Hunter Triple Nock Arrow[/size]\n<br />[img]https://i.imgur.com/V80v0cs.png[/img]\n<br />Same as Hunter arrow, but cost 3 times more resources to make, and deals 3 times more damage, these arrow will take down most unarmored target in a single shot.\n<br />[youtube]TyTGXvsvpq4[/youtube]\n<br />\n<br />[size=3]Fire Arrow[/size]\n<br />[img]https://i.imgur.com/wXEN922.png[/img]\n<br />Nature's most destructive element, delivered from afar. These arrow explode on contact, dealing damage over a small area and burn anything caught in the explosion for a while, effective against most target. With arcane smithing skill, these arrow can be crafted by using fire salt. However, it can also be crafted by the same way to make a torch - soaking linen wrapped firewood with dwarven oil.\n<br />The Fire arrow also have ballistic type, it has much shorter range and flies in an arc. which allow them to be fired from cover - without needing a clear line of sight to your target.\n<br />[youtube]ugwaruC80Zg[/youtube]\n<br />\n<br />[size=3]Freeze Arrow[/size]\n<br />[img]https://i.imgur.com/sUFGOfT.png[/img]\n<br />Carries whispers of blizzard, these arrow freeze target, slowing them down significantly, and cause them to be more susceptible to physical and magic damage. Frost salt can be used to craft these arrow, if one know how to create magic item, or ice wraith teeth as alternative if they don't.\n<br />The Freeze arrow also have ballistic type, it has much shorter range and flies in an arc. which allow them to be fired from cover - without needing a clear line of sight to your target.\n<br />[youtube]VCpEjsJpizs[/youtube]\n<br />\n<br />[size=3]Shock Arrow[/size]\n<br />[img]https://i.imgur.com/tB3dsbc.png[/img]\n<br />As fearsome as the thunder of nature, a burst of lightning from this arrow will stun anything over a huge area. Perfect for an ambush, or to turn the tie if you're overwhelmed by number. Take extra caution when firing this at mid-range, as your allies, companions, even yourself, might get stunned by the burst when caught in the explosion by accident.\n<br />[youtube]aFa7V0Aa8SY[/youtube]\n<br />\n<br />[size=3]Stalhrim Triple Nock Arrow[/size]\n<br />[img]https://i.imgur.com/8CbxRzj.png[/img]\n<br />Favorited among many Arctic Hunters, these arrow deliver a swift end to those who dare crossing the hunter's path. Mastered the material by heart, the Arctic Hunter can craft large amount of these arrow, while using little resources of this already rare enchanted ice. Combine with triple nocking, these arrow are the most efficient.\n<br />[youtube]ZEI4TsW3IHE[/youtube]\n<br />[size=3]------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------[/size]\n<br />[size=3][b]Important and extra notes:[/b]\n<br />\n<br />******************************************************[b]VERY IMPORTANT[/b]***********************************************************\n<br />- For god-know-why reason, magic effect delivered through explosion can only be applied on actor(npc and pc) [b]if[/b] [b]the explosion's radius is covering the ground AND their body part that's touching the ground[/b]. This is most noticeable on large-sized npcs such as mammoth, giant and dragon, while barely on smaller npcs, because the explosion's radius already as big as/bigger than their size.\n<br />\n<br /> * Meanwhile, how magic effect are delivered by spells/powers is different. (This applies to Fire And Forget spells). The \"spell\", which the actor equips, serve as 'activator\" or \"launcher\", which contains magic effect(s). when the actor \"charge\" and \"release\" the spell, you can see a projectile flying out from their hand or staff. That projectile, unlike arrow or bolt, is not a physical object, but, created by the magic effect itself, which mean the magic effect are delivered by the projectile. Any additional effect such as AoE are also created by magic effect, while the explosion is merely for, well, \"realism\", \"common logic\", and eye candy.\n<br />\n<br />   * Imagine: you are firing a Blast arrow to a giant's chest, head, arm, thigh, waist -&gt; the explosion will occur, but nothing happened, because their those parts aren't touching the ground, and Blast's explosion radius isn't large enough to reach the ground. But if you shoot at their foot, or the ground/wall near their foot, they will be knocked away, because the explosion were able to cover the ground AND their foot touching the ground. \n<br />Moreover, if the giant is knocked down, they will enter \"ragdoll\" state, and, mostly, their whole body will collapse, making them lying flat on the ground. At this moment, their whole body is touching the ground, so you can shoot magic arrows freely, and they'll be affected by explosion's magic effect, no matter which part it is hitting.\n<br />\n<br />-&gt; I have experimented and tested various methods in hope to overcome this limitation. There's this one solution that will work, but it's not perfect: by making explosion always be aligned to the ground. no matter where the arrow land - When you shoot at high wall, ceiling or tree, the explosion will occur at the ground instead, which is quite... illogical and unrealistic. \n<br />That's why i have decided to leave everything as-it, while providing you this important note and... how you can exploit this \"limitation\" for a better gameplay experience. Read bellow.\n<br />\n<br />-&gt;So, this \"limitation\" can be serves as a level of difficulty and strategy, making its usage more enjoyable and rewarding: \n<br />  When fighting against huge enemy, shoot Blast arrow at their foot to put them off-balance, knocking them down, forcing them into vulnerable state, which then allow you to easily afflict magic effect with magic arrows on that target before they got back on their feet.\n<br />\n<br />* This applies to all Arctic arrows with magic effect: Blast, Corruption, Fire, Freeze. However, Shock arrow is exception, because its explosion radius is already much bigger than any large-sized actor.\n<br />*************************************************************************************************************************************\n<br />\n<br />[/size]- For balance, some arrow doesn't deals any physical damage by itself, but target hit directly by the arrow will take damage, depend on the bow's base damage. This is vanilla behavior, and as far as i know, this cannot be prevented unless the bow's base damage is adjusted, or to rely on scripting, which is something i try to avoid, unless really necessary.\n<br />\n<br />- There's a known conflict with the mod \"Racial Body Morphs - Diverse body types and height by Race and Gender\". Nothing game-breaking, but it cause npcs altered by the mod immune to Push and Knock down effect used by Blast and Shock arrows. Unrelenting Force shout still work, because the shout's magic effect is delivered by a cone projectile, aimed, while the Arrow's magic effect is delivered through explosion triggered on contact.\n<br />\n<br />[size=3][b]Other mods used[/b] (only some worth mentioning, but don't hesitate to ask me if you spot something interesting)\n<br />[/size]WARNING: some mods was acquired from certain mod site that contains NSFW content.\n<br />- [size=2]Lover girl race\n<br />[/size]- Valiant Nord bow\n<br />- White Wolf: Mononoke from Like a Boss - New Mounts Mod\n<br />- Spear from Heavy Armory\n<br />- Harvest feather - head accessory\n<br />- ARTA Vindictus hair\n<br />- XP32 Maximum Skeleton Extended for sheathed weapon placement\n<br />- Ordinator Perk\n<br />- NobleSkyrimMod texture\n<br />- Purity 2018\n<br />- imaginator (saturation slider all the way up, nothing more, nothing less)\n<br />- Followers: Tania the Hermit, Tanker Neisa, Healer Onean\n<br />\n<br />No ENB are used. too much for my convertible laptop.",
  "categoryId": "36",
  "version": "1.0",
  "author": "Kat Jill",
  "createdUnix": "1529269353",
  "updatedUnix": "1530212224",
  "containsAdultContent": false,
  "uploadedBy": "KatJill",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000275489",
      "name": "Arctic Hunter Armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7127",
      "fileName": "Arctic Hunter Armor-92006-1-0.zip",
      "uploadedUnix": "1529269248",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/64f51c11a3ebf6cdefee87e0241c7dd5e75f05b3e2c9d12577d32a11025c67fe/analysis/1529269319/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arctic%20Hunter%20Armor-92006-1-0.zip?fid=1000275489&ttl=1535882835&ri=8192&rs=8192&setec=5be3e36efa2ef7a7aed7a36ffc5b21d3"
    },
    {
      "fileId": "1000275490",
      "name": "Arctic Arrows",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18476",
      "fileName": "Arctic Arrows-92006-1-0.zip",
      "uploadedUnix": "1529269305",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/40920af3ac5473b51337ae01ec204b003e968989e0dc4b74a1bc84a91e549f37/analysis/1529269446/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arctic%20Arrows-92006-1-0.zip?fid=1000275490&ttl=1535882835&ri=8192&rs=8192&setec=4b673ec23c6c5a9077b11b1b8d24960e"
    },
    {
      "fileId": "1000276366",
      "name": "Adjusted Armor Rating Patch",
      "version": "1.0-Patch",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "10",
      "fileName": "Adjusted Armor Rating Patch-92006-1-0-Patch.zip",
      "uploadedUnix": "1530212008",
      "modVersion": "1.0-Patch",
      "virusScanUrl": "https://www.virustotal.com/file/a912aeabf4645a67ebfc98985c2b53e3b5dfccd6fe78bc229cb8a189774b450f/analysis/1530212103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Adjusted%20Armor%20Rating%20Patch-92006-1-0-Patch.zip?fid=1000276366&ttl=1535882835&ri=8192&rs=8192&setec=8cdb80903ae537ad11c04def0b7074e1"
    },
    {
      "fileId": "1000276368",
      "name": "Recipe change for Blast arrow",
      "version": "1.0-Patch",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "16",
      "fileName": "Recipe change for Blast arrow-92006-1-0-Patch.zip",
      "uploadedUnix": "1530212224",
      "modVersion": "1.0-Patch",
      "virusScanUrl": "https://www.virustotal.com/file/d7fb091dda3b04dfdd18d660315ac2d6fabcc274cbf4dedd73fb42e7e2528df3/analysis/1530212343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Recipe%20change%20for%20Blast%20arrow-92006-1-0-Patch.zip?fid=1000276368&ttl=1535882836&ri=8192&rs=8192&setec=4dd411c69e7381b90561cbe0718ad301"
    }
  ]
}