{
  "modId": 92065.0,
  "modName": "VMS Patch",
  "summary": "This is a general overhaul of Skyrim.  It is designed to make the game challenging even at high levels.  Magic has been touched up, craftable/exploding arrows have been added, speed enchantments have been added, new perks are available, and more!  This mod is intended for players who play on Legendary difficulty, and want to further the challenge.",
  "descriptionHtml": "As-is, Skyrim is, like so many other MRPG games, too easy.  This patch is a targeted effort to overcome that deficiency.  If you're like me, you found that Legendary Mode at high levels can be way too easy to the point of being boring.  Skyrim allows for NPC's to be based on YOUR level, and so it is with this patch.  Creatures and undead I pretty much left alone, but most humanoid NPC's received a major elevation in aggression and overall stats.  The Forsworn Warlord class has been unlocked, and bandits are significantly more of a threat!\n<br />\n<br />Destruction magic has been overhauled to provide more powerful spells, additional mastery perks, and a new line of pure magic damage destruction spells.  Fair warning, they do not contribute to skill progression.  Not sure why, actually, and the Entropy spell does not work even though it should according to the settings so far as I know, but I didn't make the game.  If someone else finds a way to get it to work, please let me know what you did so I can change it here.  Another fair warning, if you do not take the time to gain resistances to the elements, you may well find yourself facing a foe that can spell you down in one or two hits.  High level foes do benefit from the new Augmented Fire/Frost/Shock/Magic percs.  You will find foes wielding magic damage spells to be particularly challenging as resistance to Magic Damage is more difficult to obtain.\n<br />\n<br />Fire Breath and Frost Breath have also been seriously upgraded from the pathetic versions they once were, but be warned!  Draugr using Frost Breath can totally devastate you if you don't ward, resist, or otherwise avoid the blast!  Even as a vampire.\n<br />\n<br />Blacksmithing enhancements have been slashed in half for both the percs and in alchemy.  I find bows dealing 600+ damage to be a bit ridiculous, and the extreme armor ratings possible with the vanilla game to be excessive.\n<br />\n<br />New percs include a two-handed sneak attack which requires that you are an expert in two-handed weapons and have 3 points added to enhanced sneaking, a new level for Elemental Potency, and the Trick Shot perc has been unlocked.\n<br />\n<br />As for the speed enchantments, a movement speed enchantment has been added, as well as a weapons speed enchantment.  Sadly, the weapon speed enchantment is Static because of the design of the game.  Weapon speed enchantments stack properly now.  All characters are granted a base weapon speed stat which can then be modified with enchantments.  The movement speed is just that.  You run fast.  Good for covering long stretches of turf, or evading an enemy.  Additionally, the robe enchantments have been modified so that the magica regen rate also benefits from enchantment enhancements when crafting.\n<br />\n<br />Aside from making things more balanced and generally harder, this mod also adds constructible arrows, and exploding arrows!  You'll find a book on the Skyforge entitled \"Beyond Enchanting: Exploding Arrows\" which puts the arrows in context, and describes how they are crafted.  Arrows can be crafted that explode for a variety of effects: Calm/Slow, Stagger/Paralyze, Damage Fatigue/Turn Undead, Fire/Flee, Frenzy/Speed Up, Frost/Slow, and Shock/Disintegrate.  The secondary effects are only available at high levels, and require a tremendous number of perks to craft.  These arrows do not show in the creation list unless you have all the appropriate items in your inventory AND you have all the correct perks and skill level requirements!\n<br />\n<br />Another major change is dragon spawning.  I've had problems with dragons not spawning when I change the TimeScale global, so I've introduced a new script that changes the dragon spawning timer to a randomized real-time value instead of a game-time value.  This script also corrects the issue of dragons not spawning when you obtain the Dragonstone before going to Whiterun.\n<br />\n<br />A few dialog bug-fixes have been added as well, most notably of which being those that prevent you from being able to invest in certain merchants.\n<br />\n<br />Merchant gold is also randomized and has been generally increased.\n<br />\n<br />This is a work-in-progress.  The companion patches for Dragonborn, Dawnguard, and Hearthfire are being re-constructed presently.  There are literally thousands of entries made in this patch, so please, if you find a bug/typo, report it to me and I'll attempt to fix it.  Or, if you have a fix for a bug, please tell me what you did so that I can make it a part of this patch.  Also, because of the sheer number of entries required for each patch, please be patient with the release of the Dragonborn and Dawnguard patches.\n<br />\n<br />Once upon a time, I had a full catalog of all the changes I made to the game, but due to a system failure, data was lost, including the ReadMe for this mod.  So, this is an effort as much as anything, to \"immortalize\" this mod.  There was a Dragonborn, Dawnguard, and Hearthfire patch as well, but alas, those files could not be recovered.   They wound up looking like ooblec on the disc.  This file is the Master File for them.\n<br />\n<br />This Mod uses content from the Left-Hand Rings Mod 21720.\n<br />Many Thanks for your hard work!\n<br />\n<br />!!! MAY OR MAY NOT CONFLICT WITH OTHER MODS !!!\n<br />ALWAYS BACKUP YOUR FILES IN CASE OF CONFLICT!!!\n<br />\n<br />Update Pending:  A new breed of Bandit is coming: The Pirate!  They are above you in level, and always have the best quality gear.  I'm currently integrating 110 Bandit Templates with dozens of new faces to the primary patch for a richer experience, including 3 archer classes: Archer, Archer w/ Shield, and Marksman.  Archer's use both bows and one-handed weapons instead of simple daggers. [It's taking a lot of time]\n<br />\n<br />Please feel free to use any part of this mod in your own as your own, simply credit me, or the other appropriate author for their work as it does take A LOT of work to make mods like these!",
  "categoryId": "24",
  "version": "v1.1.1",
  "author": "Victor Morten Stelein",
  "createdUnix": "1529560464",
  "updatedUnix": "1532491006",
  "containsAdultContent": false,
  "uploadedBy": "StygianAngel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000275727",
      "name": "VMS Patch.esm",
      "version": "v1.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "599",
      "fileName": "VMS Patch.esm-92065-v1-1.rar",
      "uploadedUnix": "1529559229",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c1a2cff4e2c16dd398a3bae7546c70fd4b1b473d818f0bece0181e3d90c43c61/analysis/1529559304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VMS%20Patch.esm-92065-v1-1.rar?fid=1000275727&ttl=1535882905&ri=8192&rs=8192&setec=df8fb6894d2c2a915fe57ec616ef54cb"
    },
    {
      "fileId": "1000275730",
      "name": "VMS Patch",
      "version": "v1.1.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "601",
      "fileName": "VMS Patch-92065-v1-1-1.rar",
      "uploadedUnix": "1529580102",
      "modVersion": "v1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/50c73edcacf032eff0aaded52295645e6f25afe661a1054137548609344ac5f4/analysis/1529591104/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VMS%20Patch-92065-v1-1-1.rar?fid=1000275730&ttl=1535882905&ri=8192&rs=8192&setec=f8d91ef10323223c3d1ce65e71770190"
    },
    {
      "fileId": "1000276004",
      "name": "VMS Patch - Master File",
      "version": "v1.1.2",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "601",
      "fileName": "VMS Patch - Master File-92065-v1-1-2.rar",
      "uploadedUnix": "1529859504",
      "modVersion": "v1.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/f3add29c737f3082885fb544f1f865a098a017d575eafe2d16ed1a9e70f229ba/analysis/1529859634/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VMS%20Patch%20-%20Master%20File-92065-v1-1-2.rar?fid=1000276004&ttl=1535882906&ri=8192&rs=8192&setec=3fbf3039edef98adb08fe84e145c5e1b"
    },
    {
      "fileId": "1000278214",
      "name": "VMS Patch - Dawnguard",
      "version": "v0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "VMS Patch - Dawnguard-92065-0-1.rar",
      "uploadedUnix": "1532490786",
      "modVersion": "v0.1",
      "virusScanUrl": "https://www.virustotal.com/file/07d068276ca49588bf9dcc9aea8909b6d2405c92ce680e140f781e6bfebc56ab/analysis/1532490906/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VMS%20Patch%20-%20Dawnguard-92065-0-1.rar?fid=1000278214&ttl=1535882906&ri=8192&rs=8192&setec=cb22148827a6859a99711ac6c8380f29"
    },
    {
      "fileId": "1000278215",
      "name": "VMS Patch - Dragonborn",
      "version": "v0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10",
      "fileName": "VMS Patch - Dragonborn-92065-v0-1.rar",
      "uploadedUnix": "1532490898",
      "modVersion": "v0.1",
      "virusScanUrl": "https://www.virustotal.com/file/3115ef971eadd2ec036b8a25f000b5d5a8631b1729507c3b51f6a1cbb1759843/analysis/1532490962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VMS%20Patch%20-%20Dragonborn-92065-v0-1.rar?fid=1000278215&ttl=1535882907&ri=8192&rs=8192&setec=0161353b137f9bf21b8fcb825824528c"
    },
    {
      "fileId": "1000278216",
      "name": "VMS Patch - Master File",
      "version": "v1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "743",
      "fileName": "VMS Patch - Master File-92065-v1-2.rar",
      "uploadedUnix": "1532491006",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/16877bb28810b488eddc7b09c6c9cbdbfe5c9ea52bf2605bd4f4ad530af715d8/analysis/1532491086/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VMS%20Patch%20-%20Master%20File-92065-v1-2.rar?fid=1000278216&ttl=1535882907&ri=8192&rs=8192&setec=b6adcd2c2b0af584039cec16d23b9b68"
    }
  ]
}