{
  "modId": 92102.0,
  "modName": "Sacrificial Maidens - VF",
  "summary": "Traduction française du mod Sacrificial Maidens de PLUNKET. Des vierges (ou jeunes filles) sacrifiées aux dragons par les villageois.",
  "descriptionHtml": "[size=4][center]Le mod original [url=https://www.nexusmods.com/skyrim/mods/75939]Sacrificial Maidens - UNP Shift and Bloomers[/url]﻿ de [url=https://www.nexusmods.com/skyrim/users/4193097]Plunket [/url]﻿est nécessaire au préalable.\n<br />(Ici vous n'avez que l'ESP en français)[/center]\n<br />\n<br />\n<br />[/size][size=4]10 PNJS (jeunes filles), 14 nouveaux vêtements UNP, 4 nouvelles potions. \n<br />Libérez les filles avant qu'elles ne soient mangées par les dragons !\n<br />\n<br />Les villageois en panique sacrifient des vierges (ou jeunes filles) aux dragons ! Pas de quête, juste un bref dialogue avec les sacrifiées.\n<br />Les familles des jeunes filles les ont anesthésiées avec une potion ! Elle est si puissante que les filles seront encore dans les vapes quand elles seront attaquées par les dragons. Vous devez leur dire de fuir, de courir, de s'échapper et insister ! Elles vont alors fuir vers la ville la plus proche, même si le dragon est mort. Elles ne sont pas essentielles et peuvent mourir en route donc votre tâche est de les protéger de la tanière du dragon à la ville la plus proche ! Elles ne parleront pas durant une période variable une fois en sécurité.\n<br />\n<br />Dans l'espoir que leurs filles puisse s'échapper, les mères ont caché sur elles des produits :\n<br />- un gâteau coeur qui restaure toute la santé, vigueur et magie et qui guérit les maladies et les poisons.\n<br />- une figue qui fortifie la furtivité, le crochetage, le détroussage, l'illusion et la persuasion ainsi que l'invisibilité.\n<br />- un biscuit ferrugineux qui augmente la résistance au feu, froid, foudre, magie et poison.\n<br />- l'épine somnifère sans usage pratique mais curieuse.\n<br />[/size]\n<br />\n<br />NDT : les sacrifiées se trouvent sur les aires des dragons. L'idéal est de ne pas leur parler avant d'attaquer le dragon sinon elles peuvent être prises pour cible et mourir. Le challenge consiste à les raccompagner saines et sauves en ville une fois le dragon mort.",
  "categoryId": "33",
  "version": "1.0",
  "author": "Jihan02",
  "createdUnix": "1529746952",
  "updatedUnix": "1529746952",
  "containsAdultContent": false,
  "uploadedBy": "jihan02",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000275882",
      "name": "Vierges sacrificielles VF LE",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "47",
      "fileName": "Vierges sacrificielles VF LE-92102-1-0.rar",
      "uploadedUnix": "1529746943",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f08f8da6dcc42c6333eb8f9cde9f950d7ed1da4c8b1ba98bd365918b8f5bcb30/analysis/1529747042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vierges%20sacrificielles%20VF%20LE-92102-1-0.rar?fid=1000275882&ttl=1535882965&ri=8192&rs=8192&setec=d4ef1d9d9d981fb04ca6cae510d05e28"
    }
  ]
}