{
  "modId": 92100.0,
  "modName": "True-fantasy Skyrim",
  "summary": "Changing skill trees, spells, weapon damage and some other things.",
  "descriptionHtml": "(In advance, please forgive me - I myself from Russia and translated into English, I was provided with a translator by Google)\n<br />\n<br />\n<br />Hello! My name is 1ex0. This mod I started doing long 3 years ago, when I was still in the team to create one global modification, which, unfortunately, was never completed.\n<br />\n<br />\n<br />Why did I start creating this mod? There are 3 reasons:\n<br />1) I was not satisfied with the standard Skyrim skill trees. In particular, a tree dedicated to Conjuration. Especially necromancy.\n<br />\n<br />2) There were a lot of mods that changed the gameplay, spells, etc., for example, Vile Art of the Necromancer or the ORDINATOR, but none of them even nearly did what I wanted.\n<br />\n<br />3) While working on the \"ORDO: Dawn of the Jiggalag\" mod, I acquired many skills that allowed me to direct my efforts to create what now you see.\n<br />\n<br />\n<br />What does this mod do?\n<br />- Changes absolutely all skills trees, from Conjuration to Pickpocket. Completely removed all the talents that can be developed more than once - now their benefits will depend on the skill level.\n<br />\n<br />-Made small differences between heavy armor and light, as well as between one-handed weapons and two-handed (the first was almost a complete copy of the second).\n<br />\n<br />- Also, magic spells were added to every school of magic, aimed at causing damage, including to the Restoration school (do not be afraid - everything logically fits into the atmosphere of each school).\n<br />\n<br />- The damage and the resist index of some things in the game are recycled:\n<br />1) that would slightly diversify the game (previously the damage to the weapon was line: if you have a wooden bow, the hunting one will be better, then Dwemer, orch, ebonite and daedric.) Now in each material there is one type of weapon that surpasses analogues from other materials, for example, an elven bow, warax and battleax of orcs, ebonite hammer and mace, glass swords and daggers.\n<br />2) In Skyrim, dragon armor and weapons were superior to the Daedric. I think, this is complete nonsense. It is clear that dragons are an innovation in the game, so they must somehow stand out. But not to the same extent that the bone and scales become stronger than ebonite, hardened in the blood of the daedra. Therefore, now the Daedric outfit exceeds the dragon in everything ... or almost everything.\n<br />\n<br />- In all the skill trees I made 1 talent, which are only available to Dovakin. And these talents often affect dragon armor and weapons. The blood of the dragon flows in us? Do we know how to absorb the souls of dragons? Do we know their language? We dress in their flesh? It must all somehow be combined.\n<br />\n<br />Unfortunately, so far the mod is in Russian. Also I will not write a long and meaningful description, that would not torment you with a technical translation from Google.\n<br />The main purpose of why I put the mod here - to show that there is such a large-scale mod, and that he needs a literary translation into English. If there are those who wish and can help in the translation of mod, I would gladly accept such help and allow the assistant to spread the translation of this mod on any site.",
  "categoryId": "79",
  "version": "1.2.2",
  "author": "1ex0",
  "createdUnix": "1529761272",
  "updatedUnix": "1529761272",
  "containsAdultContent": false,
  "uploadedBy": "inquisitorLexo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000275903",
      "name": "True-fantasy Skyrim",
      "version": "1.2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "182355",
      "fileName": "True-fantasy Skyrim-92100-1-2-2.7z",
      "uploadedUnix": "1529761077",
      "modVersion": "1.2.2",
      "virusScanUrl": "https://www.virustotal.com/file/7b297ee5be3f4d6846946a8031a4682dbd60d0e488c28c1f8b77efb1a218498f/analysis/1529761361/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/True-fantasy%20Skyrim-92100-1-2-2.7z?fid=1000275903&ttl=1535882961&ri=8192&rs=8192&setec=7169f144b07ab260e32a9c7cbe0698fb"
    }
  ]
}