{
  "modId": 92111.0,
  "modName": "Dwarven Boltcaster",
  "summary": "Add a new type of crossbow to your game: the Dwarven Boltcaster",
  "descriptionHtml": "[img]https://i.imgur.com/KMxXm7F.png[/img]\n<br />My skyrim build has a little bit of role playing. A party of four, each has their own class. While three of them, including me, had their own type of ranged weapon, I couldn't find some kind of heavy artillery for a heavy, tank character. Well turn out I found one: \"Siege crossbow collection\", but somehow the crossbow's additional meshes doesn't appear when it's being wielded by any NPCs/followers (it looks fine on player character though), also i think that they look overkill and cramped with too much decoration parts. \n<br />[img]https://i.imgur.com/CIf3wMF.jpg[/img] I decided to made my own, using parts from Dwarven traps inside those Dwemer ruins, some struts -  attached them to a Dwarven crossbow... And here it is: the Dwarven Boltcaster. \n<br />It comes in 2 sizes: one large regular and a compact(smaller) version. \n<br />[img]https://i.imgur.com/hXfIQAR.png[/img]\n<br />I also made 2 new types of bolt: the Quadshot bolt and Dwarven siege bolt; both deals high damage, but requires more resources to craft\n<br />[img]https://i.imgur.com/n1y1QUm.png[/img]\n<br />You can follow this table to see all kind of items needed to craft. \"Dwarven Smithing perk\" is needed.\n<br />----------------------------------------------------------------[size=3]----------------------Important and extra notes--------------------------------------------------------------------------------\n<br />[/size]- The regular Boltcaster will obstruct your view in first person due to it large size; it also clips through the wielder's arm a little bit - something i couldn't fix, maybe I'll figured it out, however everyone are welcomed to fix this issue, make sure that you let me know and review it.\n<br />- This mod uses and includes vanilla textures in its own separate folder (found in Data/textures/Dwarven Boltcaster). If you use any dwarven retexture mod, you will have to manually replace included vanilla textures with those from retexture mod.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Kat Jill",
  "createdUnix": "1529764543",
  "updatedUnix": "1529764543",
  "containsAdultContent": false,
  "uploadedBy": "KatJill",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000275910",
      "name": "Dwarven Boltcaster",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9582",
      "fileName": "Dwarven Boltcaster-92111-1-0.zip",
      "uploadedUnix": "1529764435",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c4186fbafda6a96304ac6f4b2f3f6ae8ea0aae79db4f4a0bbdbce650a0732875/analysis/1529764596/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwarven%20Boltcaster-92111-1-0.zip?fid=1000275910&ttl=1535882978&ri=8192&rs=8192&setec=fd041f9a77f1d6e8e7fb5bff07039776"
    }
  ]
}