{
  "modId": 92127.0,
  "modName": "Ultimate Deadly Encounters - The Way of the Dovahkiin aka Sands of Time LE Edition ( increased spawns ) With a Sexy Banana German",
  "summary": "Deutsche Übersetzung von Ultimate Deadly Encounters - The Way of the Dovahkiin aka Sands of Time Legendary Edition ( increased spawns ) With a Sexy Banana vom SOT-Team<br />German Translation of Ultimate Deadly Encounters - The Way of the Dovahkiin aka Sands of Time Legendary Edition ( increased spawns ) With a Sexy Banana by SOT-Team",
  "descriptionHtml": "[center][color=#1e84cc][font=Verdana][size=6]Deutsche Übersetzung von\n<br />[b]Ultimate Deadly Encounters - The Way of the Dovahkiin aka Sands of Time[/b][/size][/font][/color][size=6] [/size]\n<br />von [b][url=https://www.nexusmods.com/skyrim/users/213669]Tonycubed2[/url]﻿ + [/b]SOT-Team[/center]\n<br />\n<br />[size=3][font=Verdana][color=#b6d7a8]SOT ist eine tolle, hocheinstellbare Mod, die aus einem einfachen Spaziergang in Himmelsrand [b]ein[/b] [b]tödliches Abenteuer[/b] macht!\n<br />Sie wird definitiv Eure Spielweise verändern!\n<br />Von einfachen Ratten bis zu einer Zombie-Apokalypse ist alles dabei (und einstellbar!). Die Mod fügt - neben den Vanilla-Gegnern - neue Gegner und (glücklicherweise) auch neue Waffen hinzu.\n<br />Wem bei Skyrim die Abläufe und Gegner zu vorhersagbar waren, findet hier die nötige Abwechslung. Kein Spielablauf gleicht mehr dem anderen. Je nach Stufe werdet Ihr auch alleine kaum eine Chance haben.\n<br />\n<br />Die voreingestellten Stufen gehen dabei vom \"Milchtrinker\" bis zum \"Albtraum\"-Level, von dem selbst die Autoren sagen, dass er eigentlich nicht mehr spielbar sei (aber auch hier sind überall Anpassungen möglich).[/color][/font]\n<br />\n<br />\n<br />[color=#ff00ff][size=4][center][b][font=Verdana]Wer \"The Walking Dead\" mag, wird SOT lieben![/font][/b][/center][/size][/color]\n<br />[/size][center][font=Verdana][size=3][color=#ffe599]Dies ist nur die ESP-Datei (mit Scripten), die [/color][color=#ea9999]Original-Mod wird benötigt[/color][color=#ffe599].[/color]\n<br />[/size][/font][/center][size=3][font=Verdana][color=#ffe599][center]Ihr könnt sie hier herunterladen: [url=https://www.nexusmods.com/skyrim/mods/12452]Ultimate Deadly Encounters[/url]﻿, anschließend mit meiner Übersetzung überschreiben.\n<br />Die Datei enthält nur die Übersetzungen zum Text. Die Sprachausgabe bleibt englisch. \n<br />Also bitte Untertitel einschalten.[/center][/color][/font][/size]\n<br />\n<br />\n<br />[size=3]Zum Stand der Übersetzung: [color=#fff2cc]dies ist nach wie vor ein WIP! Die Übersetzung ist noch nicht ganz komplett, da die ESP viele Scripte enthält, von denen ich nicht immer erkennen kann, ob ich diese übersetzen muss/darf. [/color]\n<br />[color=#fff2cc]Die Mod ist jetzt auch über ein MCM-Menü aktivier- und steuerbar. Die Texte für das MCM-Menü sind auch [/color][color=#f4cccc]fast vollständig[/color][color=#fff2cc] übersetzt. Einige Teile im Menü kann ich nicht übersetzen ohne das Menü unbrauchbar zu machen. [/color]\n<br />[color=#ea9999]Wenn hier also fehlende, relevante Übersetzungen auffallen, bitte ich um Nachricht.[/color][color=#fff2cc] \n<br />[/color][s]\n<br />[/s][font=Verdana][color=#ffe599][b]Die relevanten Teile zum Spielen der Mod und alle Bücher sind übersetzt![/b][/color][/font]\n<br />\n<br />[color=#ffe599]Hier noch der Anfang aus der Beschreibung des Autors:[/color][/size]\n<br />[color=#b4a7d6][size=3][quote]\"Die Dämonen essen meine Seele und zerreißen meine Haut, die Art, wie ich gelebt habe, gab ihnen Macht durch meine Sünden. Ich schaue zu den Himmeln und bete um Vergebung der Göttlichen, während die Dämonen mein Fleisch verschlingen und mein Blut trinken ... wie Wein.\"\n<br />\n<br />\"In seinem Kern ist \"Ultimate Deadly Encounters: Sands of Time\" (\"SoT\") ein Immersionsmod, der ein konsequentes Element der Gefahr an jeder Ecke hinzufügt\"\n<br />\n<br />\"Wenn ihr Skyrim durchgespielt und letztlich gedacht habt, es fehle etwas an einem Element, das dieses Spiel über die Gattung herausragen lässt - zufällige Ereignisse - dann könntet ihr schnell ein Bewunderer von SoT werden!\"[/quote][/size][/color]\n<br />[size=3]Viel Spaß bei einem völlig neuen Skyrim-Erlebnis!\n<br />\n<br />Dies ist die Version für Skyrim LE. Die Version für SSE findet Ihr hier: [url=https://www.nexusmods.com/skyrimspecialedition/mods/11046]Ultimate Deadly Encounters - The Way of the Dovahkiin aka Sands of Time with a Sexy Banana German[/url][/size]",
  "categoryId": "78",
  "version": "29.0",
  "author": "Yanxxgeist",
  "createdUnix": "1529826044",
  "updatedUnix": "1529826044",
  "containsAdultContent": false,
  "uploadedBy": "yanxxgeist",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000275969",
      "name": "SOT 29.0 SLE GE",
      "version": "29.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2147",
      "fileName": "SOT 29.0 SLE GE-92127-29-0.7z",
      "uploadedUnix": "1529824713",
      "modVersion": "29.0",
      "virusScanUrl": "https://www.virustotal.com/file/807698de991858cffc2bed43d3e1c647b3d084c9e17843fab2b01e512c9e667a/analysis/1529824810/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SOT%2029.0%20SLE%20GE-92127-29-0.7z?fid=1000275969&ttl=1535882999&ri=8192&rs=8192&setec=45edc846c6ff48847daebe1a14b66985"
    }
  ]
}