{
  "modId": 92142.0,
  "modName": "Hobgoblin Character Race",
  "summary": "Play as one of the \"Hidden People\" of Nordic tales.  The mod includes a complete character race, a player home, and new equipment",
  "descriptionHtml": "Small and stealthy, at home in the dark, Hobgoblins are rarely seen.  Unless they want to be.  They are skilled with bows and axes, and with illusion.\n<br />This mod allows you to play as a Hobgoblin.  These are not the goblins of Cyrodilic lore, but they're similar to the huldre-folk or \"hidden people\" who are common in Nordic folklore.  Mostly, this mod is for fun.  Rather than trigger any of the main quest lines at the beginning, you might like to build a character using Arthmoor's Alternate Start mod (https://www.nexusmods.com/skyrim/mods/9557) and flo27's extension New Beginnings (https://www.nexusmods.com/skyrim/mods/70959/).\n<br />You'll find a complete Hobgoblin race menu, which you can use in character creation.  You'll also find a small player home, in the Hobgoblin Cave south of Riverwood.  The cave has bedding, a cooking fire, a chopping block, and safe storage in a chest, a useable crate, and two barrels.  In the crate you'll find some basic equipment:  a pointy hat, a leather jerkin, steel bracers, and a goblin axe.  (I've imagined this character as very lightly armored.  Some of the other items in this mod are rather powerful, but if you stick to \"Hobgoblin\" armor the game should be well enough balanced.  As you gain smithing skill you'll be able to craft improved armor and weapons while keeping the basic appearance of the character.)\n<br />You'll get some illusion starting spells, and a Hobgoblin night vision power:  equip it like a shout and turn it on or off with the Z key.\n<br />As you gain experience, you'll be able to craft other things.  Once you've got the Illusion Adept perk and Elven smithing, you can craft paralyzing Elfshot flint arrows.  Special goblin bows and axes also become available.  When you have both Elven smithing and Advanced Armors, you can reinforce your leather armor with chaurus chitin, and Glass smithing will allow you to use malachite-cured leather.  Leather goods can be crafted at the tanning rack, the rest at the forge; at higher smithing skills, the tanning rack will also have \"Elven\" and \"Glass\" categories.",
  "categoryId": "34",
  "version": "1.0",
  "author": "blueboar",
  "createdUnix": "1529930585",
  "updatedUnix": "1529930585",
  "containsAdultContent": false,
  "uploadedBy": "blueboar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000276073",
      "name": "Hobgoblin Character Race",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8946",
      "fileName": "Hobgoblin Character Race-92142-1-0.7z",
      "uploadedUnix": "1529930525",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/88355d9fd4dfab8bed130ecdff916114ab2557c0e44878f8687a4ade6f6a8a3f/analysis/1529936493/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hobgoblin%20Character%20Race-92142-1-0.7z?fid=1000276073&ttl=1535883023&ri=8192&rs=8192&setec=57bf0bd77b1877e1c7504e059c6d846a"
    }
  ]
}