{
  "modId": 92165.0,
  "modName": "Physics enabled clothing for Dovahkiin Mercenary Gear (CBBT Bodyslide - HDT - Havok) - DELETED",
  "summary": "Adds a top and loincloth based on the forsworn armor, and Lustdesign Dovahkiin Mercenary Gear textures. Both use CBBEv3 and bodyslide compatible, and use HDT-PE for the classic bouncy effect but also to add physics to the dangling parts of the clothing (loincloth, back of the top). Also includes panties so your Dovahkiin doesn't go commando.",
  "descriptionHtml": "[font=Trebuchet MS][color=#a4c2f4][size=4][b]Summary\n<br />[/b][/size][/color][/font][font=Trebuchet MS]This mod adds two pieces of armor and one piece of underwear.\n<br />\n<br />The top and loincloth are based on the Forsworn Armor mesh, and the textures from the LustDesign Dovahkiin Mercenary Gear textures. Theay feature :\n<br />- CBBE v3 compatibility\n<br />- Bodyslide sliders (based on the CBBE HDT body type)\n<br />- HDT-PE physics : breasts, butt, belly; also the back of the top and the loincloth are now havok-enabled, which was the primary objective of this mod.\n<br />\n<br />The panties are modified LSAR panties, that feature :\n<br />[/font]- CBBE v3 compatibility\n<br />- Bodyslide sliders (based on the CBBE HDT body type)\n<br />- An alternate slot so they don't conflict with the loincloth.\n<br />\n<br />All pieces can be enchanted.\n<br />\n<br />[color=#a4c2f4][size=4][b]Installation\n<br />[/b][/size][/color]Install the prerequisites, and their dependencies.\n<br />Use a mod manager or just unzip the files to your Skyrim data directory.\n<br />Run bodyslide and build meshes for \"Mercenary Top 4\", \"Mercenary Skirt 4\" and \"LSAR2-2\". You can enable generating .tri files, too.\n<br />\n<br />[b][color=#a4c2f4][size=4]Use\n<br />[/size][/color][/b]All pieces are craftable at a tanning rack\n<br />\n<br />[color=#a4c2f4][b]Note about armor rating[/b][/color]\n<br />I know this has a probably too big armor rating, after all it's almost just underwear. Oh well.\n<br />\n<br />[b][color=#a4c2f4][size=4]Credits / Thanks[/size][/color][/b]\n<br />Caliente and ousnius for CBBE and Bodyslide\n<br />Dint999 for the skeletons / physics setup\n<br />Cotyounoyume for LSAR mesh and texture\n<br />Lustrianna for the Dovahkiin Mercenary textures\n<br />Bethesda for Skyrim\n<br />\n<br />[i][color=#f6b26b]Note : I asked Lustrianna for permission to use her textures, but she didn't answer. The way I understand her TOS / conditions (dated back from 2012-13), I cannot publish or distribute her textures, or modify them without permission. That's why I didn't package them in this mod, and made her mod a prerequisite. If this somehow doesn't satisfy her by the time she answers my message, I may have to take this down.[/color][/i]",
  "categoryId": "60",
  "version": "1.0.0",
  "author": "icepanther",
  "createdUnix": "1530035808",
  "updatedUnix": "1530035808",
  "containsAdultContent": true,
  "uploadedBy": "icepanther",
  "primaryFile": null,
  "files": []
}