{
  "modId": 92207.0,
  "modName": "Arctic Sharpshot Bow - Retextured Predator Bow",
  "summary": "A mysterious bow, bearing an otherworldly design, found by the Dragonborn as they wander the lonely places on Solstheim.",
  "descriptionHtml": "[size=4][i]\"Near the lonely icy shore, lies an otherworldly artifact, formed from enchanted ice, which safeguard the Nords of old\"\n<br />[/i][img]https://i.imgur.com/7hn2DbU.png[/img]\n<br />[/size]This mod add a retextured Predator bow from the game Crysis 3, which i believe was originally ripped and ported to skyrim by an author nicknamed \"Toxa01\", who is banned for ripping, porting and distributing contents from other games. This made me hesitant to upload this mod, however, seeing the mod \"Compound Bow Collection\" also includes this Predator bow but sightly modified, made me feel safe to upload this. \n<br />The model and texture was from a mod i found on \"modtype.doorblog\" about more than a year ago, recently found it in a mod backup folder by accident after unable to find them on the internet; every download links to the bow are dead. (very lucky me).\n<br />Well, even if original author Toxa01 was banned, they still did a pretty good job porting this bow to Skyrim, and deserves credit.\n<br />I retextured the bow to Stalhrim design, adjusted its size slightly and removed the ammo container/loader, because it's unnecessary, archers in Skyrim already has a quiver, however I'm unable to remove the ammo box's attacher base and the stabilizer/bipod, because those are bound with other important parts of the bow. Also if I export the model to edit them in Blender, i will have to skin and weight them again before importing it back into nifskope, unfortunately, I'm lacking skinning and weighting skill.\n<br />\n<br />The bow has it own unique firing sound, as heard from the game Crysis 3.\n<br />It's non-craftable, and can only be found somewhere on Solstheim by solving this (badly written) riddle:\n<br />          \n<br />[i][size=4][i]\"Near the lonely icy shore, lies an otherworldly artifact, formed from enchanted ice, which safeguard the Nords of old\"[/i][/size][/i]",
  "categoryId": "55",
  "version": "1.0",
  "author": "KatJill",
  "createdUnix": "1530217484",
  "updatedUnix": "1530217484",
  "containsAdultContent": false,
  "uploadedBy": "KatJill",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000276376",
      "name": "Arctic Sharpshot Bow",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16868",
      "fileName": "Arctic Sharpshot Bow-92207-1-0.zip",
      "uploadedUnix": "1530217464",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cc4fc3297ef78b3445387a89827ccc62dc3ce5b846c959b2eda2e1a1e27f3dd7/analysis/1530217621/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arctic%20Sharpshot%20Bow-92207-1-0.zip?fid=1000276376&ttl=1535883134&ri=8192&rs=8192&setec=e0231ce442913f200e6742f21c1032ef"
    }
  ]
}