{
  "modId": 92219.0,
  "modName": "Blood Magic for Requiem",
  "summary": "Adds a spell that allows the player to toggle a mode in which spells use health instead of magicka.",
  "descriptionHtml": "[size=2][b]NOTE[/b]: This mod is designed for use with [url=https://www.nexusmods.com/skyrim/mods/19281]Requiem - The Roleplaying Overhaul[/url]. I tested it while using Requiem and have balanced it accordingly (you'll notice I  wrote this description assuming you also use Requiem). That said, I did not make any explicit dependencies to Requiem, and in theory the script effect I made is generalized enough that it should work in vanilla and with spells added by other mods. Therefore, I did not mark Requiem as being a required mod. SKSE is still required, however.\n<br />\n<br />Blood magic is easily my favorite mage specialization in Dragon Age Origins and Dragon Age II, and I've always wanted to make a similar build in Requiem. Transmute Blood works, but why deal with trying to convert health to magicka (taking up a hand in the process) instead of using it directly to cast spells like in DA?\n<br />\n<br />Most of the blood magic mods I could find applied the health cost based on the base cost of the spell (as opposed to the actual cost after factoring mass effect or cost reduction) or simply took a percentage of your health. They also tend to add a bunch of OP spells that I don't want (I just wanted the mode). So I decided to make the mod myself. Considering I have never made any mods involving extensive scripting before this one, I'd say it turned out quite well (though it took a lot of work and tuning). [/size]\n<br />\n<br />[size=4][u]What this mod does[/u]:\n<br />[/size][size=2]The spell toggles the Blood Magic mode. While it is active, spells cost half as much but use health instead of magicka. There are safeguards in place to prevent you from casting spells that would kill you (I recommend you do not depend on this system and play carefully to avoid killing yourself).  In addition, most healing effects from potions and Restoration spells do not work while Blood Magic is active. You can disable the spell at any time to allow them to work, of course. Vampires do not receive the halved spell costs to offset their very large health buffs and additional sources of healing (see below). In any case, vampires are undead and shouldn't be able draw as much power from their blood. Don't want them to become even more broken!\n<br />\n<br />Valid sources of healing while Blood Magic is active:\n<br />[/size][list]\n<br />[*][size=2]Absorb Spells (Absorbing Grasp, Vampiric Drain, Absorb Health, Absorb Essence)[/size]\n<br />[*][size=2]Surpassing Potions[/size]\n<br />[*][size=2]Power of Life[/size]\n<br />[*][size=2]Histskin[/size]\n<br />[*][size=2]Regeneration (the Alchemy perk)[/size]\n<br />[*][size=2]Fortify Health Regeneration effects*[/size]\n<br />[*][size=2]Become Ethereal with the Eternal Spirit ability[/size]\n<br />[*][size=2](Vampire only) Feeding from a corpse or victim[/size]\n<br />[*][size=2](Vampire only) Elixirs of Blood (both the 100 health and the restore health over time effects)[/size]\n<br />[/list][size=2]\n<br />*I added an additional effect to Fortify Health Regeneration enchantments and potions that reduces spell costs by another 10% (multiplicative) while Blood Magic is active. Hopefully that makes this particular effect more useful, as Requiem makes it very underwhelming.\n<br />\n<br />All other sources of healing are (supposed to be) blocked. If you want specifics, any effect with the \"MagicAlchRestoreHealth\" and \"MagicRestoreHealth\" keywords are blocked (except surpassing potions). To obtain the spell, I placed spell tomes near all of the Transmute Blood spell tomes. There are 4 locations. You probably know where to find at least one, and if not you can just add the tome or spell through the console (the spell's name is \"Blood Magic\").[/size]\n<br />\n<br />[size=4][u]Known Bugs:[/u][/size]\n<br />[list]\n<br />[*][size=2]Circle of Palladium/Guardian Circle still heals you. I haven't been able to figure out how its healing effect is applied so I can block it. Any insight would be appreciated.[/size]\n<br />[*][size=2]Spells cast by a staff cost no staff energy. This is a side effect of the fact that magicka costs are reduced to 0 while Blood Magic is active. I intend to fix this, but it's a low priority since no one uses staves anyway :P[/size]\n<br />[*][size=2]Spell costs in the magic menu are all listed as 0. Again, this is a side effect of the magicka cost being 0. The health costs are still applied correctly, but you can't just look at the menu to tell how expensive a spell will be before casting. You can very quickly equip and unequip a spell (or deactivate Blood Magic) to see the costs, but I would like to have them visible at all times in the future.[/size]\n<br />[*][size=2]The only scenario I have found where the protection system fails is when you charge a fire and forget spell while you have sufficient health to cast it, but then take enough damage such that releasing the spell will kill you. For FF spells, the script only checks once whether it is safe to cast the spell as you begin to charge it, not continuously like with concentration spells. Until I fix this, try not to charge a spell for too long while you're close to the death threshold.[/size]\n<br />[/list]\n<br />[size=4]Compatibility[/size]\n<br />[size=2]I did my best to make this mod as un-intrusive as possible, so I don't foresee many compatibility issues with other mods. If you have spells added to your game with different keyword conventions from the base game, then Blood Magic may have issues correctly identifying the spell type and applying the health costs accordingly.\n<br />\n<br />\n<br />If you're curious as to how I scripted the spell or would like to make suggestions for improvement, I included the source code in the download file.[/size]",
  "categoryId": "75",
  "version": "1.0",
  "author": "Auraxade",
  "createdUnix": "1530337392",
  "updatedUnix": "1530337392",
  "containsAdultContent": false,
  "uploadedBy": "Auraxade",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000276483",
      "name": "Blood Magic For Requiem 1.0",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "7",
      "fileName": "Blood Magic For Requiem 1.0-92219-1-0.7z",
      "uploadedUnix": "1530333172",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6769c02c54abc1ee15f966934bd0569d12d3147f48b4b1cf2270211343939bdf/analysis/1530333243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20Magic%20For%20Requiem%201.0-92219-1-0.7z?fid=1000276483&ttl=1535883144&ri=8192&rs=8192&setec=c2d327dbc92a63df00d64e1526f944c2"
    },
    {
      "fileId": "1000276484",
      "name": "Blood Magic for Requiem 1.0",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "7",
      "fileName": "Blood Magic for Requiem 1.0-92219-1-0.7z",
      "uploadedUnix": "1530335068",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cbba6b7e0ae3dfebca00ad74c3d83a469e219339ed754672197dcd2ab5a07a95/analysis/1530335222/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20Magic%20for%20Requiem%201.0-92219-1-0.7z?fid=1000276484&ttl=1535883145&ri=8192&rs=8192&setec=d3dc22c2d8755395d951a10717d95a92"
    },
    {
      "fileId": "1000276485",
      "name": "Blood Magic for Requiem Ver 1.0",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "10",
      "fileName": "Blood Magic for Requiem Ver 1.0-92219-1-0.7z",
      "uploadedUnix": "1530335414",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/917c69eae7e4f50a7208ffb21e62ee0dc1c815dba0145206fbe4bf28ebd0d97c/analysis/1530335522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20Magic%20for%20Requiem%20Ver%201.0-92219-1-0.7z?fid=1000276485&ttl=1535883145&ri=8192&rs=8192&setec=ad3cbf50c469621f46d0ea8693c6cd0e"
    },
    {
      "fileId": "1000276486",
      "name": "Blood Magic for Requiem 1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Blood Magic for Requiem-92219-1-0.7z",
      "uploadedUnix": "1530336157",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5691be8e27f2de76e01b3d5f08793b77aeabda4514360da1fee3b53c1c75878f/analysis/1530336243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20Magic%20for%20Requiem-92219-1-0.7z?fid=1000276486&ttl=1535883146&ri=8192&rs=8192&setec=20e11ca9a5815f313a83a4e88cac996d"
    }
  ]
}