{
  "modId": 92261.0,
  "modName": "Bosmeri Cuisine",
  "summary": "A lore-friendly mod introducing eight food items tailored towards an immersive Bosmer playthrough.",
  "descriptionHtml": "[b][font=Georgia][size=1][b][font=Georgia][size=4][i]\"They are exclusively and religiously carnivorous. They cannot, or will not, eat anything that is plant-based.\"[/i][/size][/font][/b]\n<br />[/size][/font][/b][size=3][right]Eric of Guis on the Bosmer\n<br />(Pocket Guide to the Empire, First Edition)[/right]\n<br />[/size]\n<br />The Bosmer follow a strict mandate known as [b]The Green Pact[/b]. It was an oath sworn to the forest god Y'ffre in times long past but holds still for the Wood Elves today. The Green Pact forbids any Bosmer from harming or eating vegetation of any kind. This means that the Bosmer cannot use timber for construction or, more relevantly to this mod, consume any food made with vegetables or fruit.\n<br />\n<br />For anyone wishing to do an immersive and lore-friendly playthrough with a Bosmer, this raises an issue: many of the foods and potions in Skyrim require vegetation as an ingredient. This mod aims to provide a solution, or part of a solution to this dilemma, but it is not exclusive to Bosmer players. It is also a part of a wider project to add a wider selection of culturally unique foods to Skyrim, and is perfect for anyone seeking to include more lore-friendly detail in their games.\n<br />\n<br />For those who do not want such restrictions in their Bosmer playthrough, there is justification for a non-carnivorous Wood Elf in Skyrim. Pocket Guide of the Empire, Third Edition says \"they swore never to kill, injure, or eat any of the vegetation of the new home\" which suggests that the terms of the Green Pact applies strictly to Valenwood. It is not clarified if this is the case, but as Bosmer in many games have been seen with vegetables/plant-based food, this detail does make sense. However, if your Wood Elf is a very traditional character, or just came from Valenwood, they'll likely follow the Green Pact because they are just so used to eating only meat.\n<br />\n<br />This mod includes [b]no new textures[/b] and simply uses vanilla food textures to create foods with more different names, ingredients and effects. Most of the new foods are not placed in the game world and can only be made from [b]crafting at a cooking station[/b] with exception of one new beverage, which has a chance of spawning in innkeeper's shops. Bosmeri Cuisine [b]includes cannibalism[/b], which is a part of the Green Pact; it is a game mechanic in vanilla Skyrim as well, so if you are playing the game you likely won't have an issue with it being included, though the warning is here anyways just in case.\n<br />\n<br />\n<br />[size=4][b]Requirements\n<br />[/b][/size]Bosmeri Cuisine requires [b]only the base game[/b] to run.\n<br />\n<br />\n<br />[b][size=4]Conflicts[/size]\n<br />[/b]Bosmeri Cuisine only makes minor changes to the game that should not conflict with most other mods, but do let me know if issues are found! The only potential conflict is if you have something that alters the inventory of food vendors in the game.\n<br />\n<br />\n<br />[size=4][b]The New Additions\n<br />[/b][/size]Bosmeri Cuisine adds eight food items- six foods and two alcoholic drinks. They are all made from Green Pact friendly ingredients for tradition-honouring Bosmer characters and some of them provide bonuses tailored towards archers, which the Wood Elves are known for. They are as follows:\n<br />\n<br />\n<br />[b][img]https://i.imgur.com/iOIDDxom.jpg[/img]\n<br />[/b]Ever wonder why you can't make such a common food from the various eggs in the game? Well now you can! Using either Chicken's Eggs, Pine Thrush Eggs or Rock Warbler Eggs, you can cook yourself a delicious pan fried egg! It's there mostly for immersive purposes and those using a Real Needs mod; although light it will only heal 5 health and lose its use in the later game.\n<br />\n<br />\n<br />[b][img]https://i.imgur.com/iy5P2Jfm.jpg[/img]\n<br />[/b]In the real world, pemmican is a survival food used by the First Nations of North America, and later adopted by the European colonists. It is known to many as the ultimate survival food, being an extremely condensed and nutritious mix of animal meat and fats. In a land as harsh and unforgiving as the northern province of Skyrim, there should definitely be a food that fills this role. Pemmican is traditionally made from bison or deer, so in Skyrim it is craftable using either beef or venison. The only fat you can get in vanilla is a bit more rare though, but if you can gather enough, you will soon have some very light pemmican that can heal as much as a minor potion while weighing only a fraction of one!\n<br />[b]\n<br />\n<br />[img]https://i.imgur.com/iuHl8DIm.jpg[/img]\n<br />[/b]The Green Pact dictates that a fallen enemy must be eaten completely before three days pass, as to not waste the meat from the kill. While this can easily be achieved with Namira's Ring in vanilla, it is not very realistic to just consume a foe's entire body just after killing them. The cooked human meat is designed to work in conjunction with meat harvesting mods such as [url=https://www.nexusmods.com/skyrim/mods/80651]Corpse Harvesting Gear[/url] or [url=https://www.nexusmods.com/skyrim/mods/8609]More Hearts and Flesh[/url] that allows you to harvest or loot body parts off fallen enemies. It works just as well on its own, just that it won't be very useful given the rarity of Human Flesh ingredients in the vanilla game. Cooked human meat is just reskinned cooked beef made from the Human Flesh ingredient and heals the same. Like most of this mod it is for the immersion of Bosmer players (and potentially cannibal players).\n<br />[b]\n<br />\n<br />[img]https://i.imgur.com/34nmTCEm.jpg[/img]\n<br />[/b]Another food item designed to work with the aforementioned harvesting mods, but is just as good on its own. This variant makes use of a human heart, but there is a real-life basis for soups which use blood as a base, seen in some Asian cultures as well as the Czech Republic (they use pig's blood, not human of course!).\n<br />[b]\n<br />\n<br />[img]https://i.imgur.com/0heEoLem.jpg[/img]\n<br />[/b]Can't just eat the meaty bits. Got to get the bony bits too. This food lets you cook bone meal with another common ingredient into something that doesn't harm you, so you waste absolutely nothing. Bone meal can be used to make a variety of potions and poisons as well, but with the amount of draugr and skeletons that drop them in Skyrim, you very easily end up with more than you know what to do with. But the Green Pact dictates that your Bosmer has to eat your kills, so you end up hurting your own stamina a lot!\n<br />[b]\n<br />\n<br />[img]https://i.imgur.com/yl4DEpvm.jpg[/img]\n<br />[/b]Because the Bosmer are not allowed to harm vegetation, they have come up with increasingly creative dishes over the years. Part potion and part delicacy, the Glowing Delight is a rare dish made from torchbugs, which can be found in Valenwood as well as Skyrim. It takes advantage of the torchbug's stamina enhancing attributes to give one who consumes this exotic dish a significant boost in their stamina regeneration. Like some of our other foods, it is geared towards providing benefits for a survival or archery playthrough. Consuming the Glowing Delight will give you enough stamina regeneration to completely counter the stamina drain from bow zoom for a short time.\n<br />[b]\n<br />\n<br />[img]https://i.imgur.com/POE65uEm.jpg[/img]\n<br />[/b]The terms of the Green Pact has forced the Bosmer to develop alcohol with products not usually used for this purpose by the other peoples of Tamriel. Kumis is a real world light alcoholic beverage made from fermenting horse milk. In the early 20th century, it was believed that kumis had medicinal properties and could treat certain diseases. Skyrim's variant, created by the Bosmer, actually will cure you of any disease you contract on your travels. While this isn't the most useful benefit, it's sure more useful than most vanilla alcohol you'll find. It cannot be crafted like other alcohol in the base game, as Skyrim does not give you a way to ferment your own drinks.\n<br />\n<br />\n<br />[img]https://i.imgur.com/dA7jvdzm.jpg[/img]\n<br />Arkhi is another alcoholic drink made from horse milk. It is much stronger than kumis and was actually the strongest alcohol available to the Mongolian clans who distilled it. In the real world, arkhi is not usually sold commercially, so in Skyrim it is not found at any merchants. Instead, the player must craft it themselves by adding a rare local ingredient to Bosmeri Kumis to make a very intoxicating but also powerful drink. Homemade Bosmeri Arkhi gives you a massive boost to stamina and one-handed for those times when your enemy gets too close during an archery playthrough, so you can show those Nords just how tough a milk drinker can be. However, the strong arkhi will not only slow stamina regeneration like other drinks but stop it entirely for a short time, so use it only for that emergency boost!\n<br />\n<br />\n<br />[b][size=4]Special Thanks\n<br />[/size][/b]Special thanks to [url=https://www.nexusmods.com/skyrim/users/2722734]LegacyCloud[/url] for teaching me how to work with the Creation Kit, [url=https://www.nexusmods.com/skyrim/users/945745]Cheez99[/url], whose Cannibals Cuisine mod served as the primary inspiration for Bosmeri Cuisine and [b]Ray Lederer[/b], whose concept art for The Elder Scrolls V: Skyrim is used in the mod image.",
  "categoryId": "100",
  "version": "1.0",
  "author": "The Mod Gourmet",
  "createdUnix": "1530427735",
  "updatedUnix": "1530427735",
  "containsAdultContent": false,
  "uploadedBy": "TheModGourmet",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000276549",
      "name": "Bosmeri Cuisine",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Bosmeri Cuisine-92261-1-0.zip",
      "uploadedUnix": "1530427715",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8051f83afd3ed6de4ba1fdb2b9cd2bc7f1c3b331204a4fd69a0881f669f6c8c8/analysis/1530427862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bosmeri%20Cuisine-92261-1-0.zip?fid=1000276549&ttl=1535883198&ri=8192&rs=8192&setec=fe638b70fbcc706580d65f989f6db794"
    }
  ]
}