{
  "modId": 92310.0,
  "modName": "Whistle Commands for Followers and Animal Companions",
  "summary": "Adds 2 new Powers for issuing commands to your Follower and Animal companion in an Immersive way similar to the whistle in the Inigo mod.",
  "descriptionHtml": "This extremely lightweight mod adds 2 new multi-functioning Powers to the game for issuing commands to your Follower and Animal Companion in a completely immersive way.  It removes the need to open menu's or talk to your followers in order to get them to do what you want!\n<br />\n<br />The powers are called \"Whistle to Follower\" and \"Whistle to Animal\" and will be taught to your character automatically upon starting the game with the mod installed.\n<br />[size=4][b]\n<br />Teach me to Whistle.[/b][/size]\n<br />If you have used the whistle included in the [url=https://www.nexusmods.com/skyrim/mods/40960]Inigo mod[/url] then you already know how to use this.  It works in exactly the same way! If not,  then I highly recommend you get Inigo and let him teach you to whistle.  He is amazing and has some dialogue and a book that explains how to whistle in an immersive way.\n<br />[b]\n<br />[size=3]How it works:[/size][/b]\n<br />[spoiler]Whistle while looking at follower to tell them to Wait where they are.\n<br />\n<br />Whistle while not looking at follower to tell them to Follow.\n<br />\n<br />Whistle while looking straight down to bring up the Favor Controls.  This is the normal interface controls you get to by talking to your follower and asking them to do something.  It lets you tell them to wait/attack/use/sit/etc what ever you point them at.\n<br />\n<br />Whistle with weapons drawn to set follower to Aggressive\n<br />\n<br />Whistle with weapons sheathed to set follower to Passive.\n<br />\n<br />Whistle while follower is in combat to stop them from attacking and tell them to follow. (use this to break up fights and run away,  just make sure you sheath your weapons first!)\n<br />\n<br />You can also combine the above commands.  So if you have weapons drawn when you tell them to follow it will also set them to aggressive.\n<br />[/spoiler]\n<br />[b][size=3]Follower Compatibility List:[/size][/b] \n<br />[spoiler]Post your findings in the comments and i'll update this list.\n<br />[b]Works:[/b][list]\n<br />[*]All Vanilla + DLC Followers and Animals\n<br />[*]Any custom Follower that uses the default follower system\n<br />[*]Toccata\n<br />[*]Garm\n<br />[/list]\n<br />[b]Doesn't Work:[/b]\n<br />[list]\n<br />[*]Inigo (obviously, he has his own)\n<br />[*]Villja\n<br />[*]Interesting NPC's - 3DNPC\n<br />[/list][/spoiler]\n<br />[b][size=3]Install / Uninstall[/size][/b]\n<br />This mod does not modify any existing records and should be safe to add or remove mid play through.\n<br />\n<br />Install and uninstall just like you would any other mod.\n<br />\n<br />[b][size=3]Recommended Mods[/size][/b]\n<br />[url=https://www.nexusmods.com/skyrim/mods/59171]AH Hotkeys[/url] - This will allow you to set up hotkeys in a better way then the default game allows.  You will be able to bind the whistle commands to what ever key you want and use them instantly without having to switch your powers.\n<br />[url=https://www.nexusmods.com/skyrim/mods/40960]Inigo[/url] - the greatest follower [i]of all time[/i] and the inspiration for this mod.  If you have never had Inigo accompany you on your travels through Skyrim then you are missing out.  Seriously,  get this mod.\n<br />\n<br />[b][size=3]FAQ[/size][/b]\n<br />[spoiler]\n<br />[b]Q. Did you get permission from Smartbluecat and CdCooley before you released this?[/b]\n<br />A. Of course! They were both very generous in giving permission and encouragement for this project.  All credit goes to them for the original Idea for the whistle.\n<br />\n<br />[b]Q. Why did you make this?[/b]\n<br />A. Because I really enjoyed using the whistle with Inigo and wanted to be able to control my animal follower (Garm) in the same way. It just so happened that it was trivial to make it work for the default follower as well so I added that in.  Now I can control the 3 followers I use in my game (inigo, Garm, and Toccata) all with whistle commands and never have to open a menu.\n<br />[b]\n<br />Q.  Does it work with 3rd person camera views?[/b]\n<br />A.  Yes,  but you need to remember one important fact.  Its based on what your character is looking at, not the camera. I also found that it is some times hard to look down and pull up the favor controls in 3rd person,  So I usually just switch to first person when I want to do that.\n<br />\n<br />[b]Q. Will this work with custom followers like Sophia, Vilja, Toccata, Garm, etc...[/b]\n<br />A.  Short answer: [i]Maybe[/i].  Long Answer:  It depends how the follower was made.  The whistles use the vanilla DialogueFollower quest so they should work with any follower built using the default system.  Some custom followers use their own system though and therefore will not listen to whistle commands. \n<br />\n<br />[b]Q.  Will this work with follower management systems like AFT, EFF, etc...[/b]\n<br />A.  Kind of,  I tested it with AFT a bit and it will work with what ever your first follower and animal follower is set to,  I assume it would do the same on EFF.  Ultimately though I created this so that I could stop using follower management mods,  so the interactions are mostly untested. What I can say is that this mod does not force any new packages onto your followers or anything like that,  it uses the same way of interacting with your followers as the Vanilla game. Its basically just shortcuts for what would be done by the vanilla dialogue menu options.\n<br />\n<br />[b]Q. Can I safely Merge this mod?[/b]\n<br />A. Yes. You should have no problem merging this mod in with others to reduce your ESP count.\n<br />\n<br />[b]Q. Why cant I tell them to relax when i'm close to them like Inigo.[/b]\n<br />A. Mainly because \"relax\" is not a default follower mechanic.  If you have another mod that makes your followers relax while waiting though then they will do so.\n<br />\n<br />[b]Q. [/b][b]Why cant I tell them to move out of the way when i'm right on top of them like Ingo does?[/b]\n<br />A. Again,  because this is not a default follower mechanic.  It would require applying a custom scene/package to the follower which I thought was a little outside the scope of this mod.  I may add it in if people really want it though. I've personally not found it necessary.\n<br />\n<br />[b]Q. Can you make them whisper when i'm sneaking like Inigo does?[/b]\n<br />A. No,  This would require voice lines of all the default voice types whispering,  which do not exist.\n<br />[/spoiler]",
  "categoryId": "96",
  "version": "1.0",
  "author": "jgz",
  "createdUnix": "1530643725",
  "updatedUnix": "1530643725",
  "containsAdultContent": false,
  "uploadedBy": "jgz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000276722",
      "name": "Whistle Commands",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30",
      "fileName": "Whistle Commands-92310-1-0.7z",
      "uploadedUnix": "1530642187",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f06c2aa326787554bda34be3f1c30001c4794da3d0d91d1ef1cd5d94e1cfc630/analysis/1530642326/",
      "changelogHtml": " Initial Upload <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whistle%20Commands-92310-1-0.7z?fid=1000276722&ttl=1535883281&ri=8192&rs=8192&setec=9175a3b563c0cac25a35c911d31a87af"
    }
  ]
}