{
  "modId": 92403.0,
  "modName": "Elegant Ladies for brave knights 2ce2 with BBP",
  "summary": "This is an unusual companions’ mod that adds two splendid, unique vampires Ladies, that look and behave like “real” women. Their bodies are outstanding in terms of feminine details down to the smallest intimate anatomical parts. They own a very advanced AI system allowing them to be \"alive\". They are two wonderful women to love.",
  "descriptionHtml": "[size=5][center][b][u][color=#ff7700]Elegant Ladies for brave knights 2ce2 with BBP[/color][/u][/b][/center][/size]\n<br />\n<br />[b][color=#ffff00]Full description in colours and with wonderful pictures, as deserved by these [/color][color=#ff7700]Elegant Ladies[/color][color=#ffff00], is available under the [/color][color=#00ff00]Files [/color][color=#ffff00]section. Please get this file and fully read it leisurely to better understand the value, the beauty and the many features of this mod.\n<br />\n<br />This is a simple plain text description that doesn't adequately credit this mod.\n<br />[/color][/b]\n<br />[b][u][color=#00ffff][size=3]Notice[/size][/color][/u][/b]\n<br />- This mod is the complementary edition of:\n<br />\n<br />         [b][color=#ff7700][size=4]   ﻿&lt; Elegant Ladies for brave knights 2 &gt;[/size][/color][/b]\n<br />\n<br />- You must install [color=#ff7700][b]“Elegant Ladies for brave knights 2”[/b][/color] before installing this add-on;\n<br />- This mod could also operate without [b][color=#ff7700]“Elegant Ladies for brave knights 2”[/color][/b], but reading the description you will understand why it doesn't make any sense to install it without having the main one active.\n<br />- This mod does not contain nudity, but some pictures do. \n<br /> \n<br />[b][u][color=#00ffff][size=3]Notes[/size][/color][/u][/b]\n<br />- This mod is WYSIWYG; what you see in the pictures is what you will actually get. All presented images are real pictures taken from the game.\n<br />\n<br />[u][b][color=#00ffff][size=3]Index[/size][/color][/b][/u]\n<br />- Description\n<br />- Content and Enhancements\n<br />- The vampires Ladies\n<br />- The story and the legend\n<br />- AI (artificial intelligence) modules\n<br />° The bodies\n<br />° The vampires Ladies and love!\n<br />° Seductive features\n<br />° Sensual features\n<br />- The vampires Ladies in combat\n<br />- Location - where are the Ladies?\n<br />- Images gallery\n<br />- Prerequisites\n<br />- Technical features\n<br />- Load order\n<br />- Compatibility\n<br />- Conflicts\n<br />- Installation\n<br />- Uninstallation\n<br />- Credits\n<br />- Permissions\n<br />\n<br />[b][u][color=#00ffff][size=3]Preface[/size][/color][/u][/b]\n<br />This mod has required some side research work in order to provide a complete historical context and truthful information regarding included characters.\n<br />\n<br />- This add-on completes and enhances [b][color=#ff7700][size=3]“Elegant Ladies for brave knights 2”[/size][/color][/b].\n<br />\n<br />This mod will fulfil Queen Valeria’s maternal wish to have, at last, both her daughters, Princess Serana and Princess Viviana, reunited and living with her under the same roof.\n<br />\n<br />With this mod you’ll end up having a total of eight (8) outstanding “true” women as partners and/or spouses!\n<br />\n<br />This mod is an unusual companions’ mod. To really understand the conceptual and philosophical differences with other mods, please read the complete information under [b][color=#ff7700]“Elegant Ladies for brave knights 2”[/color][/b].\n<br />\n<br />[b][color=#ffff00]§[/color][/b] This mod adds to the magic fantasy era that Skyrim offers, some further interesting ingredients: femininity, elegance, sensuality, love, eroticism and sex!\n<br />\n<br />[b][color=#ffff00]§[/color][/b] It also aims to give the opportunity to all players, who don’t have “Dawnguard” DLC and Elder Scrolls Online, to enjoy the company of its two most important vampire personages.\n<br />\n<br />No fantasy game is complete without vampires, everyone knows that and this mod adds two special Vampires Ladies! But vampires included in this mod are wonderful women, fascinating, aggressive, but also sweet and extremely sensual; they are a very different kind of vampires...\n<br />\n<br />In short you'll find a new reason to keep playing Skyrim, but with a completely different perspective. For a while you will forget dragons, beasts and draugrs and you will enjoy your companions and your home with: \n<br />      [b][color=#ff7700][size=3]&lt; Elegant Ladies for brave knights 2ce2 &gt;[/size][/color][/b]\n<br />\n<br />[b][u][color=#00ffff][size=3]Description[/size][/color][/u][/b]\n<br />The two vampires Ladies added by this mod are unique in the sense that they are like “real” women. I can’t say they aren’t beautiful, but are not top models or women with fictitious beauty. Their faces and bodies are natural and perfectly textured to reproduce true women and, above all, their personality, their intelligence and what they do, make them appear like living women in a computer game.\n<br />\n<br />Of course all that said is a question of personal taste, but I’m pretty sure that among them you’ll find the right partner to love and to live with.\n<br />\n<br />Moreover this add-on, as his parent, is rather elaborated and includes, further to the players, several objects, functions and specific technical features, that even more than 15 separate mods installed together, wouldn’t provide the same result.\n<br />\n<br />[b][u][color=#00ffff][size=3]Content and enhancements[/size][/color][/u][/b]\n<br />This mod includes two beautiful vampires Ladies, they are:\n<br />\n<br />[b][color=#ffff00]§[/color][/b] Princess Serana; a splendid female vampire, the long lost daughter of Lord Harkon and Queen Valeria and the twin sister of Princess Viviana. Only when dressed she is aesthetically a perfect clone of Serana found in original Bethesda “Dawnguard” DLC, although she is much stronger. This DLC is not required in order to use this mod. The only visible differences that make her recognizable, is her varnished nails and the dark lipstick - see attached picture S22 and The bodies section;\n<br />\n<br />[b][color=#ffff00]§[/color][/b] Lamae Beolfag, better known as Lamae Bal or the Blood Matron; the very first and the most ferocious vampire in Tamriel. A prominent historical figure inspired by Elder Scrolls Online, (ESO) game that cannot be missed by any lover of Skyrim and vampire characters. She is a wonderful female vampire, very sweet, sensual and refined;\n<br />\n<br />- Both vampires Ladies may be partners and spouses;\n<br />- Each vampire Lady has a different body in terms of meshes and textures - see The bodies section for individual details;\n<br />- Each vampire Lady has a different voice;\n<br />- Each vampire Lady has a personal sensual walk;\n<br />- Lamae Bal wears unique white high heel shoes. They are specifically textured for this mod and have high quality double stitching. In the soles, of matching colours, the brand and the size are imprinted in low relief - see attached images [color=#ffff00][b]LB19[/b] [/color]and [b][color=#ffff00]LB19a[/color][/b];\n<br />\n<br />[b]&gt; These shoes, in 14 colour variations, are available on sale by Vanna only, the elegant Lady who can be found in mod “Elegant Ladies for brave knights 4 with BBP”;\n<br />[/b]\n<br />- Added two noble chairs to the large table in the side hall;\n<br />- Added one complete table set;\n<br />- The table is now properly set for the vampires Ladies;\n<br />- Added Nocturnal bronze statue on a wooden base, two small candlesticks and a special pulsing dark bluish light, that perfectly recreates the atmosphere for the rituals accomplished by Lamae Bal; \n<br />- Corrected and improved original navigation meshes of the area;\n<br />- Added customised powerful ice spike spell;\n<br />- Added customised powerful fire ball spells;\n<br />- Added customised powerful lightning bolt spell for Princess Serana;\n<br />- Added customised conjure powerful dead spells;\n<br />- Added customised powerful Elven dagger for Princess Serana;\n<br />- Implemented more than 60 AI (artificial intelligence) modules that give life to the vampires Ladies.\n<br /> \n<br />[b][u][color=#00ffff][size=3]The vampires Ladies[/size][/color][/u][/b]\n<br />If you never had Dawnguard and Elder Scrolls Online edition this mod will offer you the possibility to have two prominent vampire characters.\n<br />\n<br />If you do have Dawnguard you well know that you can’t marry Princess Serana. \n<br />\n<br />While in Dawnguard Princess Serana politely refuses a proposal of marriage, mentioning her unease with temples and complicated history, with this mod instead she would be happy to be your spouse.\n<br />\n<br />If you never had ESO, in this mod you will find the famous Lamae Beolfag, the very first and most ferocious vampire in Tamriel and she too is prone to marriage.\n<br />\n<br />Therefore with this add-on you’ll be able to love and marry one of the two most renowned vampires, the choice is yours; either Princess Serana or Lamae Bal.\n<br />\n<br />Princess Serana, like her twin sister Viviana, is an ancient pure-blood vampire. She is one of the few pure-blood vampires known to exist. She gained her vampirism through a ritual in which young virgin females pledge themselves to Molag Bal, the creator and deity of vampires. The very few who survive the horrific ordeal, like Serana, are honoured with the title of \"Daughters of Coldharbour\".\n<br />\n<br />Unfortunately Valeria was not able to spare her daughter from physical violence. Shattered by this she didn’t repeat the same mistake with Viviana - see the parent mod.\n<br />\n<br />Lamae Bal is a very ferocious and aggressive vampire, but she also is a wonderful and sensual young Lady with a splendid body. In this mod her original aggressiveness has been slightly reduced, otherwise she would attack on sight. Read The story and the legend section to know her better and love her more.\n<br />\n<br />[b]&gt; These vampires Ladies are still authentic vampires and stay awake  at night and sleep during the day. [/b]\n<br />\n<br />Furthermore Lamae Beolfag has not renounced to suck blood, hence at night-time she bites now Josephine, now Daphne while they are asleep. Princess Serana instead, living with Fardosa for a while, has become more “humanised” and doesn’t do that anymore.\n<br />\n<br />[b]&gt; Both are very powerful necromancer and are able to raise the corpses of humanoids and creatures to fight by their side.\n<br />[/b]\n<br />[b][u][color=#00ffff][size=3]The story and the legend[/size][/color][/u][/b]\n<br />[b][u][color=#00ff00]Vampire Princess Serana [2][/color][/u][/b]\n<br />[b]Serana [/b]is a Nord ancient vampire Princess found asleep by Fardosa, the Dragonborn, inside a sarcophagus in Dimhollow crypt. She is the long lost daughter of Lord Harkon and Queen Valerica, and is in possession of an important Elder scroll. \n<br />\n<br />When she is rescued by Fardosa, initially she is very hesitant towards this human, but gradually the charm and charisma of the Dragonborn attract Princess Serana a lot. In short, from that day she became her best friend and lover.\n<br />\n<br />Asking her a few questions Fardosa realises that she has been imprisoned for a very long time, since even before the rise of the First Empire of Cyrodiil (i.e., about 4,200 years before current events).\n<br />\n<br />But when Fardosa asked her about her age she simply said she is 25!\n<br />\n<br />[b][u][color=#00ff00]Molag Bal [3][/color][/u][/b]\n<br />Molag Bal is a Daedric Prince whose sphere is the domination and enslavement of mortals. He is known as the God of schemes, the King of rape, the Harvester of souls, the Lord of brutality, and the Prince of rage. His main desire is spreading seeds of strife and discord in the mortal realms.\n<br />\n<br />A legend claims that Molag Bal created the first vampire when he raped a Nedic virgin named Lamae Beolfag, who in turn massacred a group of nomads. He also made pacts with other mortals and turned them into vampires such as Lord Harkon and his family.\n<br />\n<br />[b][u][color=#00ff00]Coldharbour [4][/color][/u][/b]\n<br />Coldharbour is a realm of Oblivion created and ruled over by Molag Bal. As befits his sphere, Bal's realm is a desolate, apocalyptic image of Nirn, which is achieved by both mocking imitation and outright theft of parts of the mortal realm. It is inhabited by Daedra and the eternally tormented souls of mortals called Soul shriven. The plane is a dismal, cold, and largely lifeless realm.\n<br />\n<br />[b][u][color=#00ff00]Vampire Lamae Beolfag [5][/color][/u][/b]\n<br />Lamae Beolfag, better known as [b]Lamae Bal [/b]or the Blood Matron was a Nedic priestess of Arkay. The Nedes (also known as the Nedic people) were a human race of unknown extraction, which inhabited much of Tamriel during the Merethic and First Era circa ME 1000. [6]\n<br />\n<br />She is a young woman simple and very sweet who, against her will, has suffered a devastating abuse that left her a deep and incurable wound, turning her into a creature in which she no longer recognizes herself.\n<br />\n<br />One day, when Tamriel was still young and filled with dangers, she has been brutally raped by Molag Bal in the wilds of Skyrim. Once Molag Bal finished his attack, he left a droplet of his blood on the injured girl's brow before disappearing back into Oblivion.\n<br />\n<br />Before and during the assaults of the Daedra the young woman begged and implored Arkay to help her and free her from that monster, but in vain.\n<br />\n<br />Her weeping and cries were so loud that they echoed through the mountains of Tamriel. Savage and loveless, the Daedric Prince profaned her body more than once and the harrowing screams of Lamae Beolfag became the [b][color=#f1c232]Shrieking Winds[/color][/b], which still haunt certain winding fjords of Skyrim. [7]\n<br />\n<br />In the end the poor woman, traumatised by the violence of the event, was laying on the ground trembling all over with uncontrolled shakes. Her body covered in mud and leaves had, here and there, long bleeding wounds left by the claws of the horrific creature. In tears, unable to recover, the woman felt her strength giving out and fainted.\n<br />\n<br />Shortly afterward the comatose Lamae Bal was discovered by a tribe of human nomads, who took her in and attempted to care for her wounds. As the tribe tended to the young woman, they noticed that her injuries began to rapidly heal on their own. Horrified, the tribe attempted to cremate the young woman, but as the pyre was lit Lamae Bal awoke from her coma. [b][color=#f1c232]She had become the very first vampire![/color][/b]\n<br />\n<br />Disoriented and enraged, Lamae Bal still aflame began to massacre the nomads. She ripped the throats of the women, ate the eyes of the children, and raped the men as savagely as Molag Bal had ravished her, seemingly passing on the gift of vampirism in the process.\n<br />\n<br />After finishing her rampage, Lamae Bal began to return to her senses. Horrified at her recent actions and what she had become, she desperately prayed again to Arkay for help. But no matter how many times she called upon him, Arkay did not answer. Embittered by Molag Bal's attack and Arkay's subsequent betrayal, Lamae Bal cursed them both and began to turn Arkay's followers to spite him.\n<br />\n<br />From that day the young woman denied the cult of Arkay, and hating with all herself Molag Bal and all men, vented her grief and anger over the inhabitants of Tamriel.\n<br />\n<br />This led her to sow horror and blood with rage and ferocity for centuries through vast areas of Tamriel.\n<br />\n<br />Over time, her wrath had subsided and when, after having chased her for a long time to kill her, Fardosa managed to capture Lamae Bal, the Dragonborn unexpectedly found herself in front of a wonderful young woman, fragile and frightened, in need for love and tenderness, which she never had nor received.\n<br />\n<br />Fardosa's amiability, charisma and good words were able to sweeten her even further. For the first time she felt accepted and loved for what she was. She admired Fardosa for that and better tolerated her condition.\n<br />\n<br />In full tears Lamae Bal threw herself in her arms and begged pardon for her actions, she was sincere. \n<br />\n<br />Well knowing her old sad story Fardosa decided not to kill the vampire, but to protect and help her, so she offered her to come and leave with her in her house.\n<br />\n<br />Lamae Bal was initially a bit hesitant, but attracted by Fardosa’s charm and strong will, agreed to follow her and live with her for some time. However she didn’t redeem herself completely.\n<br />\n<br />For the future, who knows...\n<br />\n<br />[b][u][color=#00ffff][size=3]AI (artificial intelligence) modules[/size][/color][/u][/b]\n<br />This mod has a very advanced AI system allowing the vampires Ladies to be alive and perform several activities on their own, some independent to each other, some combined with others and also with the vampires Ladies from [b][color=#ff7700]“Elegant Ladies for brave knights 2”[/color][/b], as in the real world. \n<br />\n<br />Further actions are randomly performed.\n<br />\n<br />Pauses are included on purpose between particular events, allowing the vampires Ladies to behave somewhat differently, preventing them from doing always the same things like robots.\n<br />\n<br />The vampires Ladies have a night full with activities and will bring the light in your house.\n<br />\n<br />Please note that their actions are not executed by means of a ring, a spell or other, they are automatically carried out by the vampires Ladies in virtue of their own AI modules. In short they behave as real women, creating an atmosphere full of life.\n<br />\n<br />[b][u]Here are some of their main activities:[/u][/b]\n<br />The vampires Ladies have breakfast all together (also with Queen Valeria and Princess Viviana) - they sleep during the day - eat raw meat - read books - prepare magic potions - pray - perform vampire rituals (with Queen Valeria and Princess Viviana) - suck blood - gather ingredients - collect herbs and seeds and much more...\n<br />\n<br />When they feel cold they get warm before the fireplace.\n<br />\n<br />The final result is a high degree of realism applied to a game, giving the clear impression of a true life atmosphere.\n<br />\n<br />Staying with the vampires Ladies and knowing them better, you’ll gradually see why they are more than simple partners. They are true women to live with and love.\n<br />\n<br />[b][u][color=#00ffff][size=3]The bodies[/size][/color][/u][/b]\n<br />- Their bodies are outstanding in terms of natural feminine details. Regarding realism they could be considered the precursors of 3D characters of future games. Looking at pictures [b][color=#ffff00]LB5b[/color][/b], [b][color=#ffff00]LB7[/color][/b], [b][color=#ffff00]S4[/color][/b], [b][color=#ffff00]S7 [/color][/b]and similar, you will have a better idea of the high level of realism of their bodies. With this mod you don’t simply have two partners; you’ll bring in your home two wonderful women to love and make love with.\n<br />\n<br />- Each vampire Lady, like all other Ladies of the series, has her own unique body, in terms of meshes and specific customised textures, down to the smallest intimate anatomical details;\n<br />\n<br />- Each body is completely different as in the real world;\n<br />\n<br />[b][color=#ffff00]§[/color][/b] [b]Princess Serana[/b] is 25 and has fire red eyes. Unlike her twin sister who is very coquette, Serana is rather tough and a fighter. She is a dark Lady par excellence and her body reflects her temperament. She doesn’t like coquettish or eccentric clothing; this is why she always wears the vampire royal uniform with a pair of vampire boots. She loves dark tints and her only feminine caprices are her dark brown varnished fingernails and the brown lipstick that she uses. However Princess Serana doesn’t need much to enhance her beauty, because naked she is a magnificent woman and has a strong erotic charge, rather feline and aggressive, which makes her irresistible. She has a slim well-proportioned body, very flexuous and sensual. Her moves are refined and elegant. Her breasts, not very big, are firm and pear-shaped. Areolas are medium sized, dark and wrinkled - see attached picture S5a. She is very hairy and pubic hairs are raven black. Very thick and long, they scatter to the inner parts of her thighs, go up to the navel, with a very exciting thin line and flow to the sides of outer lips and beyond. These are very fleshy and protruding, with very thick and dark edges, furrowed by dense pleats. The inner part is dark red. \n<br />\n<br />[b][color=#ffff00]§[/color][/b] [b]Lamae Bal[/b] is a sweet 29 years old, red haired, long-limbed Nord Lady. Her eyes are fiery red. Her body is curvy and her beauty is wild and attractive. Her skin is as white as milk and her beauty marks are light.  She has big boobs touching each other with a very exciting cleavage. Her areolas are medium sized, rather smooth and light. Sometimes she’s affected by a light Venus squint on the right eye that makes her a more attractive Lady. She has white varnished fingernails, white high heels shoes and dresses in all white in memory of the time she was virgin. But, after all, she is always a woman and loves to be desirable and is very attracted by Fardosa. She is obsessed to get her attention, so she decided not to wear panties and to be completely shaved - see picture [b][color=#ffff00]LB6 [/color][/b]and wears a transparent gold embroidered long dress, with two ample cuts on the sides, that shows her statuary body. Perhaps to compensate for the severe affront suffered, Mother Nature gifted her a nice, elongated, thin and adorable pink slit. Naked Lamae Bal is a Venus of female beauty and abundance.\n<br />\n<br />[b][u]Following are further specific body details added to the vampires Ladies:[/u][/b]\n<br />- Beauty marks placed one by one in various places. Lamae Bal beauty marks are lighter;\n<br />- Freckles;\n<br />- Customised areoles, nipples and private parts (that you may better discover by yourself);\n<br />- Accurately reproduced realistic breast veins that can be seen through the skin;\n<br />- Different pubic hair colour, shape and “coiffure”;\n<br />- Different hair and particular hairstyle;\n<br />- Custom sensual dark red tint for Lamae Bal hair;\n<br />- Varnished fingernails of matching colour with the dress, and high-heel shoes. Fingernails don’t take extra slots, they are textured and not add-ons, so they are always in place and perfectly aligned;\n<br />- Bouncing breast and butt;\n<br />- Individual sensual walk;\n<br />- Elegant dresses and footwear;\n<br />- High-heel shoes, matched to the clothes;\n<br />- Their bodies have the exclusive feature, made especially for them, to have no unpleasant halos visible under certain lighting conditions, without degrading complexion’s brightness and brilliance.\n<br />Everything has been studied with great attention to the smallest details in order to have splendid and authentic vampires Ladies as partners.\n<br />\n<br />[b][u][color=#00ffff][size=3]The vampires Ladies and love![/size][/color][/u][/b]\n<br />Useless to say that for obvious reasons both vampires Ladies hate men, therefore and also for their own nature, they prefer women, however, in general I would say they might have a bisexual behaviour?\n<br />\n<br />- The vampires Ladies may be partners and spouses;\n<br />- They are bisexual women?;\n<br />- They can accompany you for a stroll around the city, go for shopping, have a swim in the lake, etc.;\n<br />- Princess Serana has a strong and brave character and some traits of her face, her voice and dialogues denote it;\n<br />- Deep inside they both are very romantic and passionate;\n<br />- If you are gentle, valiant and know how to do, you could conquer their hearts. They agree to be kissed, and you can love them passionately (additional animation is required for this);\n<br />- Back home at the end of each mission we always kiss and make love;\n<br />- They are prone to marriage (through the normal marriage system).\n<br />\n<br />[b][u][color=#00ffff][size=3]Seductive features[/size][/color][/u][/b]\n<br />The vampires Ladies are already inclined to move their breast and butt. To make it happen you need to install following mod:\n<br />[b]- HDT Breast and Butt Physics - TBBP BBP supported*, [/b]which in turn requires:\n<br />- HDT physics extensions*\n<br />- SKSE - Skyrim Script Extender\n<br />- Realistic ragdolls and force\n<br />- FNIS - Fores New Idles in Skyrim\n<br />- XP32 Maximum Skeleton Extended - XPMSE\n<br />\n<br />If you already have these mods installed, you don’t need to do anything, \n<br />\n<br />* Both mods have a similar file containing settings, called “hdtPhysicsExtensionsDefaultBBP.xml”. Only \n<br />one must be used. With the file included in HDT Breast and Butt Physics - TBBP BBP supported, boobs move a bit more and longer, which is much sexier, while using the other file boobs are firmer and sometime you can’t even notice their bounce. Up to you the choice.\n<br />\n<br />[b][u][color=#00ffff][size=3]Sensual features[/size][/color][/u][/b]\n<br />The final touch that makes the beauty and sensuality of the vampires Ladies perfect, is their feminine way of walking, swinging their hips seductively. Each Lady is already predisposed, through special soul gems, for a different walk. To accomplish this [b]FNIS - sexy move[/b] mod should be installed separately, no need to change/assign any setting, everything will be automatic.\n<br />\n<br />If you already have this mod installed, you don’t need to do anything.\n<br />\n<br />Both vampires Ladies have different sensual walks.\n<br />\n<br />It is a wonderful and irresistible show to look at the vampires Ladies walking around and doing things in your house!\n<br />\n<br />[b][u][color=#00ffff][size=3]The vampires Ladies in combat[/size][/color][/u][/b]\n<br />If required the vampires Ladies are very powerful mage warriors and have unique magical weapons and dagger especially made for them.\n<br />[b][u]\n<br />Following are their main capabilities:[/u][/b]\n<br />- The vampires Ladies cannot be killed;\n<br />- They can accompany you in your adventures;\n<br />- They hold a destruction master degree from the Mages College of Winterhold.\n<br />\n<br />[b][u]These are the exclusive magic spells and weapons in their possession:[/u][/b]\n<br />- Powerful customised ice spikes (right hand) for long and short range combat (Lamae Bal only);\n<br />- Powerful customised burst of fire balls (left hand) with lasting effect for long and medium range combat;\n<br />- Powerful customised lightning bolt (right hand) for medium and short range for Princess Serana;\n<br />- Powerful customised Elven dagger for Princess Serana;\n<br />- Restore health and stamina; \n<br />- Invisibility;\n<br />- Customised conjure a powerful dead - and use it to fight for them;\n<br />- Resist frost and resist fire;\n<br />- The vampires Ladies are very powerful necromancers. If required they will frequently raise the corpses of humanoids and creatures to fight for them;\n<br />&gt; Princess Serana is much stronger than her original counterpart and is also able to disintegrate an opponent;\n<br />- They are also very smart to elude traps and pressure plates, so they will never trigger them if they follow or precede you;\n<br />- They have an exclusive fighting technique with lateral stealth moves, lightning attacks and fast recover capability;\n<br />- They don’t get equipped with bow and arrows, as normally happens with other followers without weapons (Bethesda automatic mechanism).\n<br />\n<br />The vampires Ladies do not use swords or bows (Princess Serana very seldom might use her dagger) as not to spoil the beauty of their bearing.\n<br />\n<br />Don’t give them weapons; what they have are more than enough to protect themselves and to protect you.\n<br />\n<br />It's a show to see them fighting. Aloof and quiet with their slow sexy walk, they break loose as soon as they sniff out danger. Their help is invaluable; alone they can vanquish an entire group of bandits or draugrs and then come back to you with their quiet sensual walk as if nothing had happened.\n<br />\n<br />Even their attacks against dragons are very effective and, to let them do, lethal.\n<br />\n<br />[b][u][color=#00ffff][size=3]Location - where are the vampires Ladies?[/size][/color][/u][/b]\n<br />Both vampires reside in Vlindrel Hall in Marcarth and, if you have one of them as your partner in a mission and don’t need her help anymore, that's where she returns.\n<br />\n<br />You must own this house first, completing related quests and become Thane of the Reach, before activating this mod - see Prerequisites section.\n<br />\n<br />[b][u][color=#00ffff][size=3]Images gallery[/size][/color][/u][/b]\n<br />Images presented are artistic pictures, shot giving high importance to scenes, poses, facial expressions and lighting, using 3/4 light sources. They all are real photos taken from true situations of the game.\n<br />\n<br />Original full size images (1280 x 1024) may be available on request to be used as a souvenir or as desktop wallpaper. They come in a luxury frame with title engraved on a high quality polished solid brass plaque - see picture [b][color=#ffff00]S4[/color][/b], in jpeg format and discreetly signed by Fardosa. Simply indicate the number as a reference.\n<br />\n<br />[b][u][color=#00ffff][size=3]Prerequisites[/size][/color][/u][/b]\n<br />- You must install [b]“Elegant Ladies for brave knights 2”[/b] first;\n<br />You must have following mods for the bodies to work properly:\n<br />[b]- XP32 Maximum Skeleton Extended - XPMSE;\n<br />- HDT Breast and Butt Physics - TBBP BBP supported;\n<br />- FNIS - sexy move;\n<br />[/b]\n<br />- You must own the house Vlindrel Hall in Marcarth first, completing related quests and become Thane of the Reach, before activating this mod;\n<br />\n<br />- You must also have/purchase the Alchemy lab room (required by the vampires) and NOT the children room (both use the same area).\n<br />\n<br />[b][u][color=#00ffff][size=3]Technical features[/size][/color][/u][/b]\n<br />Except for the skeleton, this mod is autonomous and does not need other mods.\n<br />Load order\n<br />Must be loaded after (below) [b][color=#ff7700]“Elegant Ladies for brave knights 2”[/color][/b].\n<br />\n<br />[b][u][color=#00ffff][size=3]Compatibility[/size][/color][/u][/b]\n<br />This mod is fully compatible with Dawnguard, Dragon born and Hearthfire Bethesda’s official add-ons.\n<br />\n<br />[b][u][color=#00ffff][size=3]Conflicts[/size][/color][/u][/b]\n<br />None, except for: any mod that alters the interior of Vlindrel Hall such as:\n<br />Vindrel Hall TNF - Hearthfire\n<br />Vlindrel Hall Reborn\n<br />Nicer Vlindrel Hall\n<br />Vlindrel Hall TNF Beds Plus\n<br />Vlindrel Hall Overhaul\n<br />Markarth Vlindrel Hall Redecoration...\n<br />\n<br />and the like. There are about 16 mods that modify the interior of the house and will interfere with the actions and habits of the vampires Ladies and with their AI modules. Most may also cause a failure of loading the game. Apart from that, their companion and spouse functionality remain unaffected.\n<br />\n<br />[b][u][color=#00ffff][size=3]Installation[/size][/color][/u][/b]\n<br />Installation is very simple and should be done manually. Only 2 files are required.\n<br />\n<br />You need 110 MB of free disk space to install this mod (22 MB can be recovered at the end of installation).\n<br />\n<br />1 - Decompress the downloaded file [b]F2ce2818.7z[/b] in ... [b]Skyrim&#92;Data[/b] folder (i.e. where you find Skyrim - Meshes.bsa file);\n<br />You will find following two files:\n<br />   &gt; [b]Fardosa2ce2.bsa[/b]\n<br />   &gt; [b]Fardosa2ce2.esp[/b]\n<br />   Both files must stay where they are, i.e. in …Skyrim&#92;Data folder;\n<br />Now you may delete the F2ce2818.7z file (optional to save space);\n<br />2 - Run [b]Generate FNIS for Users[/b];\n<br />3 - Run Skyrim Launcher and activate Fardosa2ce2.esp (mark the check box. It should be already active anyway);\n<br />4 - The priority (order of execution) is not critical and you can position Fardosa2ce2.esp as you prefer with respect to other mods, but it must be loaded after Fardosa2.esp. In case of doubts it is recommended to put it after other mods, i.e. at the bottom of the list;\n<br />5 - Close Skyrim Launcher;\n<br />6 - Run Skyrim and play; do not forget to go to Vlindrel Hall in Markarth.\n<br />\n<br />[b][u][color=#00ffff][size=3]Uninstallation [/size][/color][/u][/b]\n<br />1 - Run Skyrim Launcher and deactivate Fardosa2ce2.esp;\n<br />2 - Deleted from ...Skyrim&#92;Data folder these two files:\n<br />   &gt; [b]Fardosa2ce2.bsa[/b]\n<br />   &gt; [b]Fardosa2ce2.esp[/b]\n<br />3 - Load your last save and click on OK when notified that the content is obsolete;\n<br />4 - Play a bit (without the mod) and make a new save in a separate file;\n<br />5 - Exit the game;\n<br />6 - Load this new save and save once again in another new file;\n<br />7 - When you want to play load this last new save.\n<br />\n<br />[b][u][color=#00ffff][size=3]Credits[/size][/color][/u][/b]\n<br />Bethesda: for Skyrim game\n<br />Nexus: kindly hosting the modders’ community\n<br />\n<br />Some text and pictures are based on following UESP articles licensed under the &lt;\"http://creativecommons.org/licenses/by-sa/2.5/\"&gt;?Creative Commons by-sa license&gt; and can be found at following links: \n<br />[1] https://en.uesp.net/wiki/Skyrim:Awakening\n<br />[2] https://en.uesp.net/wiki/Skyrim:Serana\n<br />[3] https://en.uesp.net/wiki/Lore:Molag_Bal\n<br />[4] https://en.uesp.net/wiki/Lore:Coldharbour\n<br />[5] https://en.uesp.net/wiki/Lore:Lamae_Beolfag\n<br />[6] https://en.uesp.net/wiki/Lore:Nede\n<br />[7] https://en.uesp.net/wiki/Lore:Opusculus_Lamae_Bal_ta_Mezzamortie\n<br />\n<br />[b][u]Objects/mods used for the pictures, but not included in this mod[/u][/b]\n<br />Fore: base animations\n<br />Halo’s poser: poses\n<br />Gomapero: poses\n<br />Ceo: animations\n<br />Kapaer: face expressions\n<br />Jaxonz: pose positioning\n<br />\n<br />[b][u]Objects used in the mod[/u][/b]\n<br />Turbosundance: UNP-BBP body meshes\n<br />Remymartin1986: UNPBO body meshes\n<br />Dimon99: base body texture\n<br />Electionis and jclyde6108: high heel shoes\n<br />Kalilies Stealthic Khaos and Shocky: hair\n<br />Severus616: necklace\n<br />Zonzai and Kalell and UKC: dress\n<br />\n<br />[b][u][color=#00ffff][size=3]Permissions[/size][/color][/u][/b]\n<br />- This mod and all its assets, including pictures, MUST reside here on Nexus only. You CANNOT upload, publish or release it as a whole or any part of it elsewhere, including Steam workshop.\n<br />- You can mention, refer or link to it as long as you inform me and give me credit.\n<br />- You are not allowed to modify this mod or any part of it.\n<br />- Any item of the mod that has not been created by me could only be used with permission of her/his original owner.",
  "categoryId": "66",
  "version": "1.0",
  "author": "Fardosa",
  "createdUnix": "1531238888",
  "updatedUnix": "1531238888",
  "containsAdultContent": true,
  "uploadedBy": "fardosa",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000277093",
      "name": "F2ce2818.7z",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22967",
      "fileName": "F2ce2818.7z-92403-1-0.7z",
      "uploadedUnix": "1531049267",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/45cdae203cbd062727111f8f92bfedfc8e89431481b76e59f10b6647f1e86cdf/analysis/1531049484/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/F2ce2818.7z-92403-1-0.7z?fid=1000277093&ttl=1535883406&ri=8192&rs=8192&setec=0205989699e13ed6f7e28fd572201804"
    },
    {
      "fileId": "1000277157",
      "name": "Fardosa2ce2 - Complete description English",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "3264",
      "fileName": "Fardosa2ce2 - Complete description English-92403-1-0.7z",
      "uploadedUnix": "1531134092",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7544b09562ec3d3ab8726a3e0fe6d179ba31adbf0e4cc5d22e9ac8969ea77382/analysis/1531134254/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fardosa2ce2%20-%20Complete%20description%20English-92403-1-0.7z?fid=1000277157&ttl=1535883407&ri=8192&rs=8192&setec=d7bcd6066d2235002719c92f973b68e2"
    },
    {
      "fileId": "1000277212",
      "name": "Fardosa2ce2 - Presentation eng.7z",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3265",
      "fileName": "Fardosa2ce2 - Complete description English-92403-1-0.7z",
      "uploadedUnix": "1531200941",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7544b09562ec3d3ab8726a3e0fe6d179ba31adbf0e4cc5d22e9ac8969ea77382/analysis/1531200973/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fardosa2ce2%20-%20Complete%20description%20English-92403-1-0.7z?fid=1000277212&ttl=1535883407&ri=8192&rs=8192&setec=6cd7979e75ec3bd6e6e85a3f608d8876"
    }
  ]
}