{
  "modId": 92413.0,
  "modName": "Nede Race",
  "summary": "",
  "descriptionHtml": "The Nedes were a human race of unknown extraction, who inhabited much of Tamriel during the Merethic and First Eras. Their society largely revolved around the study of the constellations, and worship of beings known as the Celestials. Nedic culture experienced a sharp decline over several centuries as they began to assimilate into other cultures, before being completely exterminated by the Yokudan invasion of the Deathlands.\n<br />\n<br />The Adabal-a reveals they consisted of several indigenous tribes in Cyrodiil, including the Kothringi, the Al-Gemha, Men-of-Ge, Al-Hared and Men-of-Ket. While Nedes are often considered a single race of man, it has been said that they are more accurately a wide panoply of extremely varied mannish cultures and tribes who eventually would become more united through interactions within Tamriel. The Imperial race can trace their roots to the Nedic people after they bred with the Atmorans.\n<br />\n<br />-----------------------\n<br />\n<br />To be honest, I just wanted to create a new race to house my skin/eyes/whatever else, and I could only justify it if I made it lore-friendly. Little is known of the Nedic people, like many races of Tamriel. I used this to my advantage.\n<br />\n<br />-----------------------\n<br />\n<br />What I have learned of the Nede race is they were fair (likely silver) haired, and descended from many races, but notably the Kothringi; which have silver skin and are also known as the \"Lustrous Folk\".\n<br />\n<br />Since the Nedes are known as a tribal race, I've taken the libery of creating their own tribal warpaints. \n<br />This race comes with custom skin, eyes, and more. This is a custom race I created mostly for myself.\n<br />\n<br />------------------------\n<br />\n<br />[b][u]DISCLAIMER:[/u][/b]\n<br />I probably won't reply to comments. I've received a lot of hate on here (specifically for Skyrim). I am currently working on my health, and it's healthier for my stress levels to remain low. If you have any issues, please send me a PM and I'd be happy to assist. \n<br />And if you do leave a comment asking a question, it just means you didn't read the description, so no cookies for you.\n<br />\n<br />[And yes, I could just not release my mods, but I have a fan base who I love and appreciate each one of... So I release my mods for them]",
  "categoryId": "34",
  "version": "1.0",
  "author": "Gearhog",
  "createdUnix": "1531079677",
  "updatedUnix": "1531079677",
  "containsAdultContent": false,
  "uploadedBy": "Gearhog",
  "primaryFile": null,
  "files": []
}