{
  "modId": 92421.0,
  "modName": "Elegant Ladies for brave knights 2 with BBP",
  "summary": "This unusual companions mod adds 2 splendid vampire Ladies, 2 gorgeous bard Ladies, 2 wonderful Housecarl Ladies, 4 beautiful fashion model/mannequin Ladies and a female flame Atronach. Their bodies are outstanding in all feminine details and they behave like \"real\" women to love, having advanced AI modules.",
  "descriptionHtml": "[b][color=#ff7700][size=5][u][center]Elegant Ladies for brave knights 2 with BBP[/center][/u][/size][/color][/b]\n<br />[b][color=#ffff00][size=3]Full description, usage, features, installation, etc. in colours and with wonderful pictures, as deserved by these Elegant Ladies, is available under the Files section.\n<br />\n<br /> Please get this file and fully read it leisurely to better understand the value, the beauty and the many features of this mod.\n<br />\n<br />This is a simple plain text description that doesn't adequately credit this mod.\n<br />[/size]\n<br />[/color][u][color=#00ffff][size=3]Notice[/size][/color][/u][/b]\n<br />- This mod will also be released in French and Italian. Read below for respective versions.\n<br />- This mod is aimed at adult players as it contains nudity.\n<br />- This mod also has two complementary edition add-ons named “Elegant Ladies for brave knights 2ce” and  “Elegant Ladies for brave knights 2ce2”\n<br />\n<br />[b][u][color=#00ffff][size=3]Version Française[/size][/color][/u][/b]\n<br />La version Française de ce mod sera bientôt disponible avec le titre \"Dames élégantes pour chevaliers vaillants 2 avec BBP\".\n<br />Vous pouvez aussi le rechercher par Auteur en cherchant de Fardosa.\n<br />\n<br />[b][u][color=#00ffff][size=3]Versione Italiana[/size][/color][/u][/b]\n<br />La versione Italiana sarà presto disponibile col titolo \"Dame eleganti per prodi cavalieri 2 con BBP\".\n<br />Potete anche fare una ricerca per Autore cercando Fardosa.\n<br />\n<br />[b][u][color=#00ffff][size=3]Notes[/size][/color][/u][/b]\n<br />- This mod is the second of the “Elegant Ladies for brave knights” series.\n<br />- This mod is WYSIWYG; what you see in the pictures is what you will actually get. Images presented are all real pictures taken from the game and have required a lot of work and patience.\n<br />\n<br />[b][u][color=#00ffff][size=3]Index[/size][/color][/u][/b]\n<br />- Description\n<br />- Content and Enhancements\n<br />- The vampires Ladies\n<br />- The stories\n<br />- AI (artificial intelligence) modules\n<br />° The bodies\n<br />° The Ladies and love!\n<br />° Seductive features\n<br />° Sensual features\n<br />- Complementary edition mods\n<br />- The Ladies in combat\n<br />- Elegant special fashion models/mannequins\n<br />- The books\n<br />- Images gallery\n<br />- Additional elegant containers\n<br />- Special Ring of Light\n<br />- Location - where are the Ladies?\n<br />- Prerequisites\n<br />- Technical features\n<br />- Load order\n<br />- Compatibility\n<br />- Conflicts\n<br />- Installation\n<br />- Uninstallation\n<br />- Credits\n<br />- Permissions\n<br />\n<br />[b][u][color=#00ffff][size=3]Preface[/size][/color][/u][/b]\n<br />This mod is not the 1000 + 1 companions’ mod.\n<br />Quite the contrary it aims to introduce a new dimension to the game, a totally different way of playing and to consider the partners.\n<br />\n<br />Skyrim is already full of so many fellow fighters, poorly dressed, or with armours and armed to the teeth.\n<br />But Skyrim is an advanced and realistic game that offers, in addition to the fighting and killings, also a different way to play; stroll around the city in the company of a lady, go for shopping, have a swim with her in the lake, kiss her, love her, etc.\n<br />\n<br />Obviously it is more enjoyable if you are in company of a beautiful lady, well dressed, or maybe scantily clad… is even better!\n<br />\n<br />[b]&gt; Well, this mod adds to the magic fantasy era that Skyrim offers, some further interesting ingredients: femininity, elegance, sensuality, love, eroticism and sex!\n<br />[/b]\n<br />[b]&gt; It also aims to give the opportunity to all players who don’t have “Dawnguard” DLC to enjoy the company of its two most important Vampire personages.\n<br />[/b]\n<br />And, speaking of which, let’s not forget that no fantasy game is complete without vampires, everyone knows that. But vampires added by this mod aren’t ugly, they are wonderful women, fascinating, aggressive but also sweet and extremely sensual; they are a very different kind of vampires...\n<br />\n<br />In short you'll find a new reason to keep playing Skyrim, but with a completely different perspective. For a while you will forget dragons, beasts and draugrs and you will enjoy your companions and your home with:\n<br />         [b][color=#ff7700][size=3]&lt; Elegant Ladies for brave knights 2 &gt;[/size][/color][/b]\n<br />\n<br />[b][u][color=#00ffff][size=3]Description[/size][/color][/u][/b]\n<br />The Ladies added by this mod are unique in the sense that they are like “real” women. I can’t say they aren’t beautiful, but are not top models or women with fictitious beauty. Their faces and bodies are natural and perfectly textured to reproduce true women and, above all, their personality, their intelligence and what they do, make them appear like living women in a computer game.\n<br />\n<br />Reading their stories of adventures, love and sex - many episodes are rather risqué - will make them even more interesting and attractive.\n<br />\n<br />Of course all that said is a question of personal taste, but I’m pretty sure that among them you’ll find the right partner to love and to live with.\n<br />\n<br />This mod is rather elaborated and adds several players, objects, functions and specific technical features, that even more than 15 separate mods installed together, wouldn’t provide the same result.\n<br />\n<br />[b][u][color=#00ffff][size=3]Content and enhancements[/size][/color][/u][/b]\n<br />[b][color=#00ff00]=[/color][/b] [b]Two splendid female vampires[/b]: [b][color=#00ff00]Queen Valeria[/color][/b] and her daughter [b][color=#00ff00]Princess Viviana[/color][/b], the twin sister of Serana, inspired by the original Bethesda “Dawnguard” DLC. This DLC is not required in order to use this mod. They love to go around completely naked. They weren’t undressed when Fardosa, the Dragonborn (the player), initially met them in the Soul Cairn. Reading their story you’ll understand why they decided to adopt this choice;\n<br />\n<br />[b][color=#00ff00]=[/color][/b] [b]Two stunning bard Ladies[/b]: [b][color=#00ff00]Josephine[/color][/b], an elegant Imperial blonde woman with a wonderful voice and [b][color=#00ff00]Daphne[/color][/b], a petite sweet tanned Nord. They both have a varied repertoire of ballads and are able to very well play the flute, the drum and the cithara. They don’t love to wear panties;\n<br />\n<br />[b][color=#00ff00]=[/color] Two beautiful female Housecarls[/b]: [b][color=#00ff00]Alga[/color][/b], a very sensual Breton and [b][color=#00ff00]Solidea[/color][/b], a slender topless Nord. They have been hired as guards, to protect the vampires. They don’t wear panties either and both had a hot affair with Argis “the Bulwark”;\n<br />\n<br />[b][color=#00ff00]=[/color] A non-aggressive female flame Atronach[/b] named [color=#00ff00][b]Nar[/b][/color], who living with all these Ladies has learned a few words (Atronachs usually don’t speak);\n<br />\n<br />[b][color=#00ff00]=[/color] Four special elegant female fashion models/mannequins[/b] - see Elegant special fashion \n<br />models/mannequins section for further details;\n<br />\n<br />[b][color=#00ff00]=[/color] Five (5) outstanding illustrated books[/b] having 60 to 100 pages each - see The books section for further details. They tell the secret story of the vampires, the stories of the songsters and the Housecarls, their stories of love and sex with Fardosa and Argis;\n<br />\n<br />- All the Ladies may be partners and spouses;\n<br />- Each Lady has a different body in terms of meshes and textures - see The bodies section for individual details;\n<br />- Each Lady has a different voice;\n<br />- Each Lady has a personal sensual walk;\n<br />- Each Lady wears unique high heel shoes of different colour. These shoes are specifically textured for this mod and have high quality double stitching. In the soles, of matching colours, the brand and the size are imprinted in low relief - see attached pictures [b][color=#ffff00]ST1[/color][/b], [b][color=#ffff00]ST2 [/color][/b]and [b][color=#ffff00]ST3[/color][/b];\n<br />\n<br />[b]&gt; These shoes, in 14 colour variations, are available on sale by Vanna only, the elegant Lady who can be found in mod “Elegant Ladies for brave knights 4 with BBP”;\n<br />[/b]\n<br />- Argis “the Bulwark” now has his second eye (originally he was blind from an eye);\n<br />- Addition of two noble single beds for the bard Ladies;\n<br />- Addition of a complete toilette set (seat, bucket, toilet paper, etc.); \n<br />- Added 6 small Dwemer cabinets and 2 urns to store player’s objects - see Additional elegant containers section for full details;\n<br />- Replaced the ugly black pot in the basin with a silver jug for the morning washing of the Ladies;\n<br />- Set up of a private table for the guard meals;\n<br />- Addition of flower vases and flowers for Princess Viviana (read Tome II);\n<br />- Corrected and improved original navigation meshes of the house;\n<br />- Added a noble chair to the large table in the main hall;\n<br />- The main table now is set as for a feast;\n<br />- Added customised light sources to enhance the illumination of the house;\n<br />- Added a bowl with Jazbay grapes for Nar (Atronachs only eat these);\n<br />- Added on the table in the smaller hall, two large dishes with raw meat dripping with blood for the vampires (read Tome III - vampires rituals);\n<br />- Added customised powerful ice spike spells;\n<br />- Added customised powerful fire ball spells.\n<br />- Added powerful conjure dead spells; \n<br />- Added two customised powerful swords for the Lady guards;\n<br />- Added a special Ring of Light useful to take good pictures and/or for any specific lighting situation - see Special Ring of Light section for full details;\n<br />- Added special animations for dancing and other AI functions;\n<br />- Implemented more than 180 AI (artificial intelligence) modules that give life to the Ladies.\n<br />\n<br />[b][u][color=#00ffff][size=3]The vampires Ladies[/size][/color][/u][/b]\n<br />[b]&gt; Look at Complementary edition mods section for how to also get vampire Princess Serana and Lamae Bal, the very first and most ferocious vampire lady in Tamriel!\n<br />[/b]\n<br />If you never had Dawnguard this mod will offer you the possibility to have its two main vampire royal highnesses.\n<br />\n<br />If you do have Dawnguard you well know that you can’t marry neither Queen Valerica (reading Tome I you’ll find out that her true name is Valeria) nor her daughter Princess Serana. \n<br />\n<br />While Princess Serana politely refuses a proposal of marriage, mentioning her unease with temples and complicated history, instead her twin sister Princess Viviana is favourable to become your spouse.\n<br />\n<br />Therefore with this mod you’ll be able to marry one of these two noble vampires, the choice is yours; either Queen Valeria or Princess Viviana.\n<br />\n<br />- Queen Valeria’s actual age is unknown and different hypotheses do exist. She told me to be 43..? However her birth date should be approximately placed at the beginning of the First Era, hence she should have about 4200 years! Despite this she’s a splendid woman for her age.\n<br />\n<br />- Princess Viviana is an ancient pure-blood vampire. She is one of the few pure-blood vampires known to exist. She gained her vampirism through a ritual in which young virgin females pledge themselves to Molag Bal, the creator and deity of vampires. The very few who survive the horrific ordeal, like Viviana and her mother Valeria, are honoured with the title of \"Daughters of Coldharbour\".\n<br />\n<br />Valeria however succeeded in protecting her daughter from any physical violence, hence keeping her virgin and hiding her in the Soul Cairn till she met Fardosa. \n<br />\n<br />Both are very powerful necromancer and are able to conjure the corpses of humanoids and creatures to fight by their side.\n<br />\n<br />To the touch, their bodies are a bit cold it’s true, but their sensuality and perversion are steaming hot. A night with them makes it very hard to get back to love ordinary women (read The night of the Vampires - Tome IV).\n<br />\n<br />[b][u][color=#00ffff][size=3]The stories[/size][/color][/u][/b]\n<br />Included books narrate the true story of the six Ladies, through various episodes of their lives. They are worthy reading to better understand their personalities.\n<br />\n<br />These are beautiful, fascinating and touching all feminine stories that reach high peaks of feelings, with a crescendo of adventure, action and love.\n<br />\n<br />They tell the very engaging relationship between Fardosa and the Ladies, particularly the vampires.\n<br />When Fardosa meets Queen Valeria the very first time, inexplicably, being both women, they feel strongly attracted to each other and a series of spicy events take place thereafter.\n<br />\n<br />The day of their first encounter, their private life together, the meeting with Princess Viviana and her “first time” with Fardosa, the secret love of Princess Serana, her twin sister, towards Fardosa, the relations between vampires and humans, the hidden desire of elegant Josephine towards Fardosa… and much, much more.\n<br />\n<br />Their adventures, combats side by side and their stories of love and sex are narrated in a fluid and realistic way. After all it’s their true life in Skyrim.\n<br />\n<br />The player, who has the sensitivity to appreciate it, will gradually feel how, day by day, a deeper relationship will grow to the Ladies or towards a favourite one in particular.\n<br />\n<br />Living with them, talking to them, loving them and having them fight by your side, you will soon realise why you will not be able to live without these [b][color=#ff7700]“Elegant Ladies for brave knights 2”[/color][/b].\n<br />\n<br />[b][u][color=#00ffff][size=3]AI (artificial intelligence) modules[/size][/color][/u][/b]\n<br />This mod has a very advanced AI system allowing the Ladies to be alive and perform several activities on their own, some independent to each other, some combined with others, as in the real world. \n<br />\n<br />Further actions are randomly performed.\n<br />Special pauses have been included on purpose between particular events, allowing the Ladies to behave somewhat differently, preventing them from doing always the same things like robots.\n<br />\n<br />[b]&gt; The Ladies have a day full with activities and will bring the light in your house.[/b]\n<br />\n<br />Please note that their actions are not executed by means of a ring, a spell or other, they are automatically carried out by the Ladies in virtue of their own AI modules. In short they behave as real women, creating a wonderful atmosphere full of life.\n<br />\n<br />Just to give an idea, the six Ladies and the Atronach have much more AI functions than the entire Riverwood village community.\n<br />\n<br />[b][u]Here are some of their main activities:[/u][/b]\n<br />The Ladies have breakfast (the vampires on their own) - lunch and dinner all together - sleep - read books - write music notes - play music - sing - dance - prepare magic potions (vampires only) - perform vampire rituals* (vampires only) - suck blood (vampires only) - go to the toilette (excluding the vampires Ladies, they have a different metabolism) - empty the toilette bucket - gather ingredients - collect flowers - cook - serve appetizers - serve soup - do housework (mainly carried out by Daphne) - go shopping for food (to the market) - clean swords (Housecarls only) and much more...\n<br />\n<br />[b]&gt; * If you also install complementary mod “Elegant Ladies for brave knights 2ce2” the vampire Ladies will perform their rituals together with the other two vampires.\n<br />[/b]\n<br />[b]&gt; Princess Viviana loves flowers and dancing and, as she is very coquette and exhibitionist, every afternoon she loves to show off in a different solo sexy dance.\n<br />[/b]\n<br />Sitting on a chair you will be delighted by the wonderful spectacle of this naked vampire Lady swaying her hips while her boobs swing. She is always accompanied by her dear friend Josephine, playing a different instrument every day.\n<br />\n<br />After lunch and dinner the Ladies got into the habit of sitting around the table and chatting as good friends, drinking a glass of liquor.\n<br />When they feel cold they get warm before the fireplace.\n<br />\n<br />[b]&gt; Before midnight mother and daughter (the vampires Ladies) go out on the small terrace, to admire the moon and get inspiration before initiating their magic rituals.\n<br />[/b]\n<br />The final result is a high degree of realism applied to a game, giving the clear impression of a true life atmosphere.\n<br />\n<br />Staying with the Ladies and knowing them better, you’ll gradually see why they are more than simple partners. They are true women to live with and love.\n<br />\n<br />[b][u][color=#00ffff][size=3]The bodies [/size][/color][/u][/b]\n<br />- Their bodies are outstanding in terms of natural feminine details. Regarding realism they could be considered the precursors of 3D characters of future games. Looking at pictures A4, D3, J5, Vi5 and MF4, to mention a few, you may have a better idea of the high level of realism of their bodies. With this mod you don’t simply have six partners; you’ll bring in your home six wonderful women to love and make love with.\n<br />\n<br />- Each Lady, like all other Ladies of the series, has her own unique body, in terms of meshes and specific customised textures, down to the smallest intimate anatomical details;\n<br />- Each body is completely different as in the real world;\n<br />\n<br />&gt; [b][color=#00ff00]Queen Valeria[/color][/b] is a 43 years old Nord mature Lady. She loves green, so she has green high heel shoes and all her jewels (diadem, necklace, collar, earrings and piercing) are made by emerald and gold. Also her fingernails are varnished in green. She has glowing gold eyes, a wonderful full body of mature woman, naturally hanging big boobs whose veins can be seen through the skin, large areoles, an emerald jewel piercing on the navel, a gold ring on each nipple and one on the outer lips. She is very hairy and pubic hairs scatter to the inner parts of her thighs. Her private parts are scarlet red and slightly open;\n<br />\n<br />&gt; [b][color=#00ff00]Princess Viviana[/color][/b] is 25 and has fire red eyes; maybe this is why she loves red. Her fingernails are varnished in red and she wears red high heel shoes. Her young body is flexuous, sensual and shiny; her boobs are big and firm (unlike her twin sister Princess Serana who is slimmer) and has full thighs. Viviana likes to emulate her mother, so she has a ruby jewel piercing on the navel, a gold ring on her left nipple and on the outer lips. Her private parts are elongated and surrounded by a thick dark contour. She loves to spend some time to comb her pubic hairs and give them an unusual “coiffure”;\n<br />\n<br />&gt;[b][color=#00ff00]Josephine [/color][/b]is a very elegant and sophisticated Imperial blonde and blue is her favourite colour. She is 28 years old. She is slim with a well-proportioned body, her firm boobs have small wrinkled areoles. She has a gold bar on her right nipple. Her soft hairs are reddish and a very sensual thin line of hairs goes up to the navel. She wears a blue long and tight, embroidered silk dress, with two ample cuts on the sides, that shows her statuary long legs. Her fingernails are varnished in blue, she prefers not to wear panties and has blue high heels shoes. Her moves are refined and elegant, making her very desirable. Mother Nature gifted her with equally refined private parts.\n<br />\n<br />&gt; [b][color=#00ff00]Daphne [/color][/b]is a sweet 27 years old Nord Lady, not very tall. Her tanned body is very curvy and her beauty is wild and attractive. She has big boobs touching each other and the cleavage is very exciting. She has very large dark areoles. Her private parts are fleshy and inner lips are long and hang out. She is rather hairy with curly dark chestnut hairs. Naked she is a goddess of female eroticism. She has a gold and emerald piercing on the navel and a gold ring on her left nipple. She is a perfect housewife, very active and does all homework; it’s then natural that she’s always a bit sweaty. Because of this her female smell is stronger and even more exciting. Her fingernails are varnished in green, she is very flexible and is able to do the splits (read Tome II). She doesn’t love to wear panties; \n<br />\n<br />&gt; [b][color=#00ff00]Alga [/color][/b]is 26. She is a very sensual petite Breton having a luxuriant young and full body, with big firm boobs, large areoles, full thighs and a big pronounced butt and an inviting mouth. She’s very feminine, a bit shy and naïve. She has a gold ring on each nipple and on the navel. Her private parts are very fleshy and hairy with a line of hairs going up to the navel. Alga naked is a statue of Venus. She has gold varnished fingernails and gold high heel shoes matching her Housecarl uniform. She doesn’t wear panties;\n<br />\n<br />&gt; [b][color=#00ff00]Solidea [/color][/b]is 27. She is a sexy slender Nord with a long-limbed body, naturally hanging boobs and long blond hair covering almost all her breasts. She has a gold ring on the left nipple and on the navel. On the navel she also has a gold jewel piercing. Her pubic hairs are amber and flow along the sides of her outer lips. She has gold varnished fingernails and gold high heel shoes matching her Housecarl uniform. She is a woman who feels the heat and easily sweats. My house is well heated, therefore Solidea always has a slightly sweat skin; this is why she doesn’t wear panties nor the top of her Housecarl outfit. She is the only Lady being still virgin and wants to remain as such (read Tome III);\n<br />\n<br />[b][u]Following are further specific body details added to the Ladies:[/u][/b]\n<br />- Beauty marks placed one by one in various places;\n<br />- Freckles;\n<br />- Customised areoles, nipples and private parts (that you may better discover by yourself);\n<br />- Accurately reproduced realistic breast veins that can be seen through the skin;\n<br />- Different pubic hair colour, shape and “coiffure”;\n<br />- Different hair and particular hairstyle, some partially covering the breasts;\n<br />- Varnished fingernails of matching colour with the dress, jewellery and high-heel shoes. Fingernails don’t take extra slots, they are textured and not add-ons, so they are always in place and perfectly aligned;\n<br />- Bouncing breast and butt;\n<br />- Individual sensual walk;\n<br />- Tattoos (the vampires Ladies only);\n<br />- Specific jewellery, piercings and sexy body accessories. Nipples and navel rings and bar don’t take extra slots, they are textured and not add-ons, so they are always in place and never disappear;\n<br />- Very skimpy outfit, if any;\n<br />- Elegant dresses and footwear;\n<br />- High-heel shoes, matched to the clothes, jewellery and fingernails colour;\n<br />- Their bodies have the exclusive feature, made especially for them, to have no unpleasant halos frequently visible under certain lighting conditions, without degrading complexion’s brightness and brilliance;\n<br />- Princess Viviana’s uses a special body lotion prepared by her mother, hence her body has a sensual glossy effect, made especially for her without using ENB;\n<br />- Daphne’s and Solidea’s bodies have an exclusive light sweating, modified in pubic hair and breast areas.\n<br />Everything has been studied with great attention to the smallest details in order to have splendid and authentic Ladies as partners. \n<br />\n<br />[b][u][color=#00ffff][size=3]The Ladies and love![/size][/color][/u][/b]\n<br />For one reason or another each Lady has had a negative experience with men, therefore and also for their own nature, they prefer women. This is why they have been deeply attracted by Fardosa. However, in general I would say they might have a bisexual behaviour?\n<br />\n<br />- The six Ladies may be partners and spouses; \n<br />- They are bisexual women?;\n<br />- They can accompany you for a stroll around the city, go for shopping, have a swim in the lake, etc.;\n<br />- Josephine has a strong and brave character and some traits of her face denote it;\n<br />- They all are very romantic and passionate, particularly the two vampires;\n<br />- If you are gentle, valiant and know how to do, you could conquer their hearts (read Tome II and III). They agree to be kissed, and you can love them passionately (additional animation is required for this);\n<br />- Back home at the end of each mission we always kiss and make love. I also found that some of them like to have sex in “unusual” places. This is better emphasized in “Elegant Ladies for brave knights 1 and 4”;\n<br />- Making love with one of the noble vampires on an altar in a crypt or one of the Ladies in the wilds is an unforgettable experience;\n<br />- They are prone to marriage (through the normal marriage system).\n<br />\n<br />The Ladies are conducive to marriage and are willing to accompany you in your adventures but, as you will see, they are scantily clad and more prone to love than to fighting. Of course you can take them with you in some grotto or cavern, but looking better at the beauty of their body, who would lead such a gorgeous lady in a damp, stinking place full of skeletons? But...\n<br />\n<br />[b][u][color=#00ffff][size=3]Seductive features [/size][/color][/u][/b]\n<br />The Ladies are already inclined to move their breast and butt. To make it happen you need to install following mod:\n<br />- [b]HDT Breast and Butt Physics - TBBP BBP supported[/b]*, which in turn requires:\n<br />- HDT physics extensions*\n<br />- SKSE - Skyrim Script Extender \n<br />- Realistic ragdolls and force\n<br />- FNIS - Fores New Idles in Skyrim\n<br />- XP32 Maximum Skeleton Extended - XPMSE\n<br />\n<br />If you already have these mods installed, you don’t need to do anything, \n<br />\n<br />* Both mods have a similar file containing settings, called “hdtPhysicsExtensionsDefaultBBP.xml”. Only one must be used. With the file included in HDT Breast and Butt Physics - TBBP BBP supported, boobs move a bit more and longer, which is much sexier, while using the other file boobs are firmer and sometime you can’t even notice their bounce. Up to you the choice.\n<br />\n<br />[b][u][color=#00ffff][size=3]Sensual features [/size][/color][/u][/b]\n<br />The final touch that makes the beauty and sensuality of the Ladies complete, is their feminine way of walking, swinging their hips seductively. Each Lady is already predisposed, through special soul gems, for a different walk. To accomplish this [b]FNIS - sexy move[/b] mod should be installed separately. No need to change/assign any setting, everything will be automatic. \n<br />\n<br />If you already have this mod installed, you don’t need to do anything.\n<br />\n<br />Princess Viviana has a very sexy walk. She’s young and very coquette! Queen Valeria has a less sexy walk, but still very inviting. After all she is a queen and a wonderful mature woman. The other Ladies have different very sensual walks.\n<br />\n<br />It is a wonderful and irresistible show to look at the Ladies walking around and doing things in your house!\n<br />\n<br />[b][u][color=#00ffff][size=3]Complementary edition mods[/size][/color][/u][/b]\n<br />- For those who may be interested in taking their own hot pictures with the Ladies, a complementary mod named [b][color=#ff7700]“Elegant Ladies for brave knights 2ce”[/color][/b] is available. It contains the nude muscular version of Argis. Look for that mod for full details.\n<br />\n<br />- Another very special complementary mod named [b][color=#ff7700]“Elegant Ladies for brave knights 2ce2”[/color][/b] includes the vampire Princess Serana in her original royal attire. At last you can let the twin sisters live together and make queen Valeria happy, plus you can also marry Princess Serana. And, as a final touch, this mod also includes the special very first vampire lady in Tamriel, Lamae Bal. By adding this exclusive mod you can have the best, most gorgeous and unique four vampires Ladies in the story of Skyrim! Look for that special add-on for full details.\n<br />\n<br />[b][u][color=#00ffff][size=3]The Ladies in combat[/size][/color][/u][/b]\n<br />If required the Ladies are very powerful mage warriors and have unique magical weapons and blades especially made for them.\n<br />\n<br />[b][u]Following are their main capabilities:[/u][/b]\n<br />- The Ladies cannot be killed;\n<br />- They can accompany you in your adventures;\n<br />- They hold a destruction master degree from the Mages College of Winterhold.\n<br />\n<br />[b][u]These are the exclusive magic spells and weapons in their possession:[/u][/b]\n<br />- Powerful customised ice spikes (right hand) for long range and close range combat (not for Alga and Solidea);\n<br />- Powerful customised burst of fire balls (left hand) with lasting effect for long range and medium range combat;\n<br />- Powerful customised glass sword for Alga;\n<br />- Powerful customised Dwemer sword for Solidea;\n<br />- Restore health and stamina;\n<br />- Invisibility (the vampires only);\n<br />- Conjure dead - and use it to fight for them (the vampires only);\n<br />- Resist frost and resist fire (the vampires only);\n<br />- The vampires Ladies are powerful necromancer. If required they will frequently raise the corpses of humanoids and creatures to fight for them;\n<br />- All the Ladies are also very smart to elude traps and pressure plates, so they will never trigger them if they follow or precede you;\n<br />-  They have an exclusive fighting technique with lateral stealth moves, lightning attacks and fast recover capability;\n<br />- Alga and Solidea belong to a customised Class of Witch blades making them very powerful with sword and spells;\n<br />- They don’t get equipped with bow and arrows, as normally happens with other followers without weapons (Bethesda automatic mechanism).\n<br />\n<br />The Ladies, excluding the two Housecarls, do not use swords or bows as not to spoil the beauty of their bearing.\n<br />\n<br />Don’t give them weapons; what they have are more than enough to protect themselves and to protect you.\n<br />\n<br />It's a show to see them fighting. Aloof and quiet with their slow sexy walk, they break loose as soon as they sniff out danger. Their help is invaluable; alone they can vanquish an entire group of bandits or draugrs and then come back to you with their quiet sensual walk as if nothing had happened.\n<br />\n<br />Even their attacks against dragons are very effective and, to let them do, lethal. \n<br />\n<br />[b][u][color=#00ffff][size=3]Elegant special fashion models/mannequins[/size][/color][/u][/b]\n<br />Elegant Ladies deserve graceful mannequins and this is what they actually get. Mannequins added by this mod should actually be considered as fashion models, in virtue of their beauty and realism, rather than simple mannequins. They have a unique and innovative management system, developed for this mod, which provides a double functionality and is totally immune from all serious issues that affect traditional mannequins such as: looking north, close to walls or corners, trigger spin, trigger bounds, etc. It’s not a surprise that in all Skyrim there only are 9 mannequins and only one in Vlindrel Hall, placed in the only spot where standard mannequins can work. Furthermore trying to use other bodies instead of the ugly conventional mannequins, the situation becomes even worse. To make it short, thanks to this system I have added four (4) wonderful ladies in spots were common mannequins could never be activated.\n<br />\n<br />[b][u]Features and usage[/u][/b]\n<br />Unlike traditional mannequins these double-function models offer several advantages, they are:\n<br />- They aren’t ugly, wooden, stone, marble, etc., but women akin mannequins based on beautiful completely naked women - see all pictures starting with M;\n<br />\n<br />Their names are:\n<br />&gt; [b][color=#00ff00]Donatella[/color][/b], a sexy blue eyed, wild young blonde Nord;\n<br />&gt; [b][color=#00ff00]Simonetta[/color][/b], a strong-willed mature Imperial brunette;\n<br />&gt; [b][color=#00ff00]Tiziana[/color][/b], a vamp mature Nord brunette with penetrating light green eyes and fleshy red lips - see picture [b][color=#ffff00]MT2a[/color][/b];\n<br />&gt; [b][color=#00ff00]Francine[/color][/b], a wonderful petite, very sweet and very young dark red-haired Breton. She is barely 22 years old - see picture [color=#ffff00][b]MF5a[/b][/color].\n<br />\n<br />- All models have moving boobs - see Seductive features above;\n<br />- When enabled each model has a different sexy walk - see Sensual features above;\n<br />- The models cannot be killed;\n<br />- The models are not companions and will not initiate any follower dialogue;\n<br />- They have a perfectly detailed body like all other Ladies, but different of course;\n<br />- Their body has freckles, beauty marks and light breast veins, but still visible through the skin;\n<br />- Each model has a different coiffure and hair colour;\n<br />- Their fingernails are varnished in red;\n<br />- All models are fully shaved;\n<br />- Their skin complexion is slightly different to emulate artificial material, but still very realistic, similar to a light tanned effect (perfect for a day on the beach) - see picture MF6 for comparison;\n<br />- Their skin is glossy for better realism (again, perfect on the beach after using a suntan cream);\n<br />- Each model, when enabled, has a different voice and dialogues, but obviously diverse from all other “true” Ladies;\n<br />- Their default standing position is natural and elegant and not with wide arms as with standard mannequins - see picture MS1;\n<br />- Trying to give them non clothing/armour items will not generate the usual warning message. Nothing will take place and wrong item will be back to your inventory; \n<br />- To activate these fashion models you must be at a greater distance from them, almost one step and a half;\n<br />&gt; Activation doesn’t normally take place in the centre, as with common mannequins. Central area is dedicated to talk to the model, while activation points are located on the sides, on the base and on the head. This is a very useful and practical feature, because activating a mannequin by clicking on her right side (recommended area) you’ll be able to see the whole figure dressing/undressing on the right, not being covered by the items list that opens to the left. \n<br />&gt; To wake up a model from her torpor, you must use the Tai command from the console, clicking on her first. Now she will assume and change the standard idle poses. She will talk to you and react to environment, but will never move from her spot and her mannequin functionality will always be operational. You may enable all mannequins if you prefer to have/consider them as fashion models, instead of rigid, inanimate statues.\n<br />&gt; To freeze an enabled model you only need to activate her again without exchanging anything and she will immobilise in that position;\n<br />- Once enabled you could assign to each one a different pose, with a separate posing mod, then re-activate them without exchanging anything and they will automatically freeze in that pose;\n<br />- If, for any reason, you enable a model and force her to move into another room/place, you’ll see that slowly and sensually she will go back to her spot and assume the correct position - see pictures [b][color=#ffff00]MT3[/color][/b];\n<br />- You could also enable one or more of them to take some hot pictures with your player!\n<br />\n<br />[b]&gt; The boots and panties wore by some models, but also matching bras in 12 colour variations, are available on sale by Vanna only, the elegant Lady who can be found in mod “Elegant Ladies for brave knights 4 with BBP”. \n<br />[/b]\n<br />[b][u][color=#00ffff][size=3]The books [/size][/color][/u][/b]\n<br />This mod also includes a prestigious collection of books that cannot be missed in an aristocratic library. They have outstanding characteristics that make them very expensive and highly sought after.\n<br />\n<br />Each book in virtue of its features, complexity and beauty could rightly be considered a single mod on its own.\n<br />\n<br />Included books are suitable for adult readers. \n<br />\n<br />Each book has 60 to 100 pages, illustrated in colour. \n<br />\n<br />Images presented, even erotic ones, are artistic pictures, shot giving high importance to scenes, poses, facial expressions and lighting, using 3/4 in game light sources. They all are real photos taken from true situations of the game. A noteworthy example is picture [b][color=#ffff00]Vi7 [/color][/b]- Vampire princess Viviana: the expression of her face is, at first, slightly interrogative and surprised. However a feeling of veiled happiness is visible also underlined by her faintly smile, but the look of her eyes is deep and conceals a slight melancholy and an inner sadness. The beauty of this image is undoubtedly charming and captivating at the same time.\n<br />\n<br />Over 1500 pictures have been taken! From these almost 400 were selected in the making of these books.\n<br />Books can be found on the right side of the fire place in the main hall and on the chest in the main bedroom.\n<br />\n<br />With this mod you have as much as five (5) high quality illustrated books. They are:\n<br />- Tome I, II and III - The secret story of Valeria and Viviana;\n<br />- The night of the Vampires (Tome IV);\n<br />- Valeria and I (Tome V);\n<br />\n<br />[b][u]Here are some of their highlights:[/u][/b]\n<br />- Each book has basically two stories; the main written one and the picture dialogues one. Sometimes dialogues between players are even better than the images they represent.\n<br />- Unique antique style covers in relief;\n<br />- Highly elaborated spines with rounded effect, matching cover theme;\n<br />- High quality framed illustrations captured from true in game situations;\n<br />- Each illustration has a comment or one or two dialogue captions, in two different fonts; \n<br />- Drop cap characters at the beginning of paragraphs;\n<br />- Each book, as in reality, has different parchment sheets in relief for the pages;\n<br />- Chapter closure symbols matching with parchment backgrounds;\n<br />- Parchment borders are slightly burnt and cut (damaged) for true realism;\n<br />- Shadowed (darker) parchment simulates the underneath page seen through cuts;\n<br />- Dirt and stains for increased aging realism;\n<br />- True and individual small pages in relief with actual story text, that can be seen when the book slightly opens;\n<br />- Different page profiles when the books are seen from the side;\n<br />- Specific opening dragon logo having metal bronze effect matching with parchment backgrounds;\n<br />- Notices, prefaces and forewords as in true books;\n<br />- Each book has at the end a different picture of the author, Fardosa and a brief story of her life as the Dragonborn.\n<br />\n<br />[b][u][color=#00ffff][size=3]Images gallery[/size][/color][/u][/b]\n<br />Attached pictures are only a very limited number. Original full size images (1280 x 1024) from the books may be available on request, as a souvenir or to be used as desktop wallpaper. They come in a luxury frame, with title engraved on a high quality polished solid brass plaque - see picture [b][color=#ffff00]Vi7[/color][/b], in jpeg format and discreetly signed by Fardosa. Simply indicate the book title and the caption as a reference.\n<br />\n<br />[b][u][color=#00ffff][size=3]Additional elegant containers [/size][/color][/u][/b]\n<br />Although the house already has a reasonable number of cabinets and the like, I understand that for the fans of storage, it may appear poorly furnished. However I didn't want to change the interior design of the house on purpose, except for the essential required by the number of ladies. It's not the objective of this mod and I wanted to keep its original aspect anyway.\n<br />\n<br />I also didn't want to add cabinets in battery, like in a store or warehouse, not to ruin the aesthetics of the house; moreover the Ladies would have never liked that! Therefore I have added, here and there, some elegant containers perfectly integrated and in style with the architecture of the house - see picture [b][color=#ffff00]ArL[/color][/b]. \n<br />\n<br />[b][u]They may contain following items:[/u][/b]\n<br />- Rings, amulets and jewels (main hall);\n<br />- Books, notes and letters (inner hall);\n<br />- Scrolls (urn, inner hall);\n<br />- Keys (main hall, left);\n<br />- Potions and drinks (bards bedroom);\n<br />- Ingredients (urn, inner hall);\n<br />- Soul gems (arcane enchanter room);\n<br />- Special items (entrance).\n<br />\n<br />They are all safe and bear the name of their content for a quick identification. In some of them you'll find a flower as a present from Fardosa.\n<br />\n<br />[b][u][color=#00ffff][size=3]Special Ring of Light (bonus)[/size][/color][/u][/b]\n<br />In the [b]Rings, amulets and jewels[/b] container you will find another exclusive gift from Fardosa; a very special Ring of light.\n<br />\n<br />Although the illumination of the house has been greatly improved, to appreciate the beauty of the Ladies and their bodies at the best and to take good pictures, a custom ring has been added. \n<br />\n<br />Its luminance has been calibrated for Vlindrel Hall, but you certainly can use it for all other interiors.\n<br />\n<br />[b]&gt; This ring, as well as other very special rings, is on sale by Vanna only, the elegant lady who can be found in mod “Elegant Ladies for brave knights 4 with BBP”.\n<br />[/b] \n<br />[b][u][color=#00ffff][size=3]Location - where are the Ladies?[/size][/color][/u][/b]\n<br />They all reside in Vlindrel Hall in Marcarth and, if you have one of them as your partner in a mission and don’t need her help anymore, that's where she returns.\n<br />\n<br />You must own this house first, completing related quests and become Thane of the Reach, before activating this mod - see Prerequisites section.\n<br />\n<br />[b][u][color=#00ffff][size=3]Prerequisites[/size][/color][/u][/b]\n<br />You must have following mods for the bodies to work properly:\n<br />[b]- XP32 Maximum Skeleton Extended - XPMSE;\n<br />- HDT Breast and Butt Physics - TBBP BBP supported;\n<br />- FNIS - sexy move;\n<br />[/b]\n<br />&gt; You must own the house Vlindrel Hall in Marcarth first, completing related quests and become Thane of the Reach, before activating this mod;\n<br />\n<br />&gt; You must also have/purchase the Alchemy lab room (required by the vampires) and NOT the children room (both use the same area).\n<br />\n<br />[b][u][color=#00ffff][size=3]Technical features[/size][/color][/u][/b]\n<br />Except for the skeleton, this mod is autonomous and does not need other mods.\n<br />\n<br />[b][u][color=#00ffff][size=3]Load order[/size][/color][/u][/b]\n<br />Indifferent. In case of doubts it is recommended to put it after other mods, i.e. at the bottom of the list.\n<br />\n<br />[b][u][color=#00ffff][size=3]Compatibility[/size][/color][/u][/b]\n<br />This mod is fully compatible with Dawnguard, Dragon born and Hearthfire Bethesda’s official add-ons.\n<br />\n<br />[b][u][color=#00ffff][size=3]Conflicts[/size][/color][/u][/b]\n<br />None, except for: any mod that alters the interior of Vlindrel Hall such as:\n<br />Vindrel Hall TNF - Hearthfire\n<br />Vlindrel Hall Reborn\n<br />Nicer Vlindrel Hall\n<br />Vlindrel Hall TNF Beds Plus\n<br />Vlindrel Hall Overhaul\n<br />Markarth Vlindrel Hall Redecoration...\n<br />\n<br />and the like. There are about 16 mods that modify the interior of the house and will interfere with the \n<br />actions and habits of the Ladies and with their AI modules. Most may also cause a failure of loading the game. Apart from that, their companion and spouse functionality remain unaffected.\n<br />\n<br />[b][u][color=#00ffff][size=3]Installation[/size][/color][/u][/b]\n<br />Installation is very simple and should be done manually. Only 4 files are required.\n<br />You need 600 MB of free disk space to install this mod (130 MB can be recovered at the end of installation).\n<br />1 - Decompress the downloaded file [b]F2818.7z[/b] in ...[b]Skyrim&#92;Data[/b] folder (i.e. where you find Skyrim - Meshes.bsa file);\n<br />You will find following four files: \n<br />   [b]&gt; Fardosa2.bsa\n<br />   &gt; Fardosa2.esp\n<br />   &gt; FNIS_Fardosa2_List.txt\n<br />   &gt; FNIS_Fardosa2_Behavior.hkx[/b]\n<br />2 - First two files Fardosa2.bsa and Fardosa2.esp must stay where they are, i.e. in ...Skyrim&#92;Data folder.\n<br />3 - Move FNIS_Fardosa2_List.txt file in: ...Skyrim&#92;Data&#92;Meshes&#92;actors&#92;character&#92;animations&#92;Fardosa2\n<br />You’ll have to create the folder Fardosa2 first.\n<br />4 - Move FNIS_Fardosa2_Behavior.hkx file in: ...Skyrim&#92;Data&#92;Meshes&#92;actors&#92;character&#92;behaviors\n<br />If you don’t have the behaviors folder you’ll have to create it first.\n<br />Now you may delete the F2818.7z file (optional to save space);\n<br />5 - [b]Run Generate FNIS for Users[/b];\n<br />6 - Run Skyrim Launcher and activate Fardosa2.esp (mark the check box. It should be already active anyway);\n<br />7 - The priority (order of execution) is not critical and you can position Fardosa2.esp as you prefer. In case of doubts it is recommended to put it after other mods, i.e. at the bottom of the list;\n<br />8 - Close Skyrim Launcher;\n<br />9 - Run Skyrim and play; do not forget to go to Vlindrel Hall in Markarth.\n<br />\n<br />[b][u][color=#00ffff][size=3]Uninstallation[/size][/color][/u][/b]\n<br />1 - Run Skyrim Launcher and deactivate Fardosa2.esp;\n<br />2 - Deleted from ...Skyrim&#92;Data folder these two files: Fardosa2.bsa and Fardosa2.esp;\n<br />3 - Delete FNIS_Fardosa2_List.txt and FNIS_Fardosa2_Behavior.hkx files from their respective folders as indicated above under Installation;\n<br />4 - Load your last save and click on OK when notified that some content may be obsolete;\n<br />5 - Play a bit (without the mod) and make a new save in a separate file;\n<br />6 - Exit the game;\n<br />7 - Load this new save and save once again in another new file;\n<br />8 - When you want to play load this last new save.\n<br />\n<br />[b][u][color=#00ffff][size=3]Credits[/size][/color][/u][/b]\n<br />Bethesda: for Skyrim game\n<br />Nexus: kindly hosting the modders’ community\n<br />\n<br />[b][u]Objects/mods used for the pictures, but not included in this mod[/u][/b]\n<br />Fore: base animations\n<br />Halo’s poser: poses\n<br />Gomapero: poses\n<br />JohnB: poses\n<br />IndexMemories: dancing animations\n<br />RohZima: animated poses\n<br />Dualsun: poses\n<br />Ceo: animations\n<br />ASX Team: animated poses\n<br />Kapaer: face expressions\n<br />Jaxonz: pose positioning\n<br />Petrovich: boots, body underwear, stockings, armlets\n<br />Dimon99: bra\n<br />Alexia: garter\n<br />Elewin: stockings\n<br />Anano: panties\n<br />Chris57 and FavoredSoul: male body\n<br />Tiwa44, Deserter X &amp; Mitosuke: tunic\n<br />Zonzai and Kalell and UKC: thong\n<br />Gatti: shoes\n<br />Neovinci: dress, panties, armlets, stockings, shoes\n<br />Gizmodian: panties, open skirt\n<br />Jojjo, UberSmaug: weapons\n<br />MystikHybrid - Gabriel Gullbergh, Hale, Halendia, Deserter X &amp; Mitosuke: horse\n<br />\n<br />[b][u]Objects used in the mod[/u][/b]\n<br />Robton; UNPRT and TMB body meshes\n<br />Crosscrusade, DeMoNhUnTeR1986, Sevennity: SeveNBase body meshes\n<br />Turbosundance: UNP-BBP body meshes\n<br />AlpineYJ: Seraphim body meshes\n<br />Remymartin1986: UNPBO body meshes\n<br />Neovinci: dress, skirt, top, sandals\n<br />Dimon99: base body texture\n<br />Elewin: navel piercing\n<br />Electionis and jclyde6108: high heel shoes\n<br />Kalilies Stealthic Khaos and Shocky: hair\n<br />Severus616: necklaces, diadems, circlets, earrings\n<br />Zonzai and Kalell and UKC: skirt, corset, piercing\n<br />Gatti: collar, wristlets\n<br />IndexMemories: dancing animations\n<br />DanceSynchronisator: dancing animations\n<br />Xs2Reality: wet body skin texture\n<br />\n<br />[b][u][color=#00ffff][size=3]Permissions [/size][/color][/u][/b]\n<br />- This mod and all its assets, including pictures, must reside here on Nexus only. You CANNOT upload, publish or release it as a whole or any part of it elsewhere, including Steam workshop.\n<br />- You can mention, refer or link to it as long as you inform me and give me credit.\n<br />- You are not allowed to modify this mod or any part of it.\n<br />- Any item of the mod that has not been created by me could only be used with permission of her/his original owner.",
  "categoryId": "66",
  "version": "1.0",
  "author": "Fardosa",
  "createdUnix": "1531238528",
  "updatedUnix": "1531551289",
  "containsAdultContent": true,
  "uploadedBy": "fardosa",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000277215",
      "name": "F2818.7z",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "131299",
      "fileName": "F2818.7z-92421-1-0.7z",
      "uploadedUnix": "1531204533",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c6a3ec0b031d3d9a1fc09908854f6285378fe95ee3605dc60d4404d21cf80ed7/analysis/1531204645/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/F2818.7z-92421-1-0.7z?fid=1000277215&ttl=1535883428&ri=8192&rs=8192&setec=d9c5cfaf6bb723023bb4618e4dcf8af3"
    },
    {
      "fileId": "1000277216",
      "name": "Fardosa2 - Presentation eng.7z",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "4698",
      "fileName": "Elegant Ladies for brave knights 2 with BBP - Presentation eng-92421-1-0.7z",
      "uploadedUnix": "1531205281",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/35d658cbd8d13444083824729cad080a930567d63072c9ae526f98d01d23d78c/analysis/1531205419/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elegant%20Ladies%20for%20brave%20knights%202%20with%20BBP%20-%20Presentation%20eng-92421-1-0.7z?fid=1000277216&ttl=1535883429&ri=8192&rs=8192&setec=02200d4bdf4acc37d614b0e6f8580a74"
    },
    {
      "fileId": "1000277478",
      "name": "Fardosa2 - Presentation eng.7z",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4684",
      "fileName": "Fardosa2 - Presentation eng.7z-92421-1-0.7z",
      "uploadedUnix": "1531551289",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2f4df9afb00b44d8c30916251e499d79557c5a66e18e121d5b73c9749a6c9881/analysis/1531551378/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fardosa2%20-%20Presentation%20eng.7z-92421-1-0.7z?fid=1000277478&ttl=1535883429&ri=8192&rs=8192&setec=e2e78d12d5bda8d930333679e63bae04"
    }
  ]
}