{
  "modId": 92449.0,
  "modName": "Dizona Body  dismembered arm  actual preset MALE",
  "summary": "it's a one armed male racemenu preset for the dizona body. its nord",
  "descriptionHtml": "if you just search skyrim dizona body download link i'm sure you'll find it, download the head if you only care about the face, if you want the entire body mod its gonna be at least 600 mb if i remember correctly, so make sure you have the room, other mods i use with this preset are sg hairs for male, and i use hairstyle number 13. i don't have any screenshots but i wouldn't have uploaded this if i didn't know it would be better than most garbage race menu presets, if you download it i can promise you wont be moving to another preset anytime soon, and if you don't like the look, simply use my outline of my own preset to create your own since the detail in the face structure i've put makes it pretty realistic\n<br />\n<br />fyi, his left arm is missing because im currently in a play-through where he lost in in a fight, if you want his arm to remain gone, download zaz animations and amputator from loverslab, wont be hard to find, though it's an NSFW.\n<br />\n<br />required for the actual preset to take form\n<br />Dizona body Head OR Body\n<br />\n<br />Racemenu\n<br />\n<br />sentiment eyes (Nexus)\n<br />SG Hairs Male (hairstyle number 13) i'm not too sure where to find that, but have fun lmao\n<br />\n<br />also, if you're gonna comment and complain about me adding photos and sh[it before you download, alright, don't download it, simple as that\n<br />\n<br />and you're probably gonna have to place this in your skse/plugins/presets as all this file is, is the preset.\n<br />\n<br />\n<br />\n<br />\n<br />mods i use for my outfit are (i;m not adding the links cause i honestly don't care whether you copy my look or not, just giving you an idea of what works with the preset.)\n<br />DB First armor - same website as dizona body, its Russian so i definitely dom't remember the name\n<br />crystal goggles - loverslab\n<br />sand scorpion, 1h on back (from billyro)\n<br />and blindfolds of skyrim as hes missing his left eye, and its been closed shut while the right remains open, \n<br />  \n<br />\n<br />if any of you are tryna become a custom voiced followers voice, take a look at the ss once ingame and thats who you could voice if your voice sounds cool enuf\n<br />\n<br />FYI AGAIN\n<br />\n<br />IF YOU DO NOT READ THIS DON'T BLAME ME FOOL YA FOOL\n<br />\n<br />if you don't have the Dizona body / face, the preset wont look like it should, it;ll still be better looking than 90% of the male presets on nexus but it could be better with dizona.",
  "categoryId": "62",
  "version": "1",
  "author": "WillOfFire",
  "createdUnix": "1531258684",
  "updatedUnix": "1531258684",
  "containsAdultContent": false,
  "uploadedBy": "WillOfFire",
  "primaryFile": null,
  "files": []
}