{
  "modId": 92447.0,
  "modName": "Skyrim Fighters Guild - DELETED",
  "summary": "I am not the creator of this mod!<br /><br />Skyrim Fighters Guild adds 3 new Fighters Guild Halls to Skyrim as part of its plot line. Allowing the player to help the Fighters Guild grow and expand over a series of missions. Eventually allowing the player to become master of his own branch of the Fighters Guild near Riften.",
  "descriptionHtml": "[b]About the Skyrim Fighters Guild\n<br />[/b][b][i][u]I am not the creator of this mod![/u][/i][/b]\n<br />Skyrim Fighters Guild adds 3 new Fighters Guild Halls to Skyrim as part of its plot line. Allowing the player to help the Fighters Guild grow and expand over a series of missions. Eventually allowing the player to become master of his own branch of the Fighters Guild near Riften.\n<br />\n<br />The mod contains over 20 quests and supports all the Fighters Guild Ranks used found in older TES cames such as Oblivion.\n<br />\n<br />Unlike older TES games, the ranks are not tied to individual quests and each quest has the potential of rewarding you more or less depending on how well you did on the mission assigned to you.\n<br />\n<br />It is entirely possible to do so badly that you never become Master of the Fighters Guild or if you do it takes you 2 or 3 missions longer to achieve that rank.\n<br />\n<br />Payments vary according to your performance on a mission to. The better you do, the better the pay.\n<br />\n<br />Whilst this mod includes white arrows and help for deaf dumb and blind noobies. Anybody that just follows the white arrows and does only what the objectives tell you to do will find they either miss out on becoming Master of their own guild or get it much later in the game.\n<br />\n<br />Clues, oddities, extra targets are all part of this mod, picking up meat or killing a dragon may not appear to be your objective, but the time and place you find these things in should tell you it is of interest to your Guild master and you should pay such things extra attention.\n<br />\n<br />If you hear about bandits looting farms..... Try and find the loot. If you hear about rats in a city, find out what is attracting them.\n<br />\n<br />These things are not listed as objectives, but will earn you earn bigger rewards and a faster promotion to Master. Fear not, you still get to do the remaining missions after becoming master, the difference is, you get to use the full resources of your own branch of the Fighters Guild to help you if you become a master ranked member early.",
  "categoryId": "25",
  "version": "1.2",
  "author": "TheNanoByteGhost",
  "createdUnix": "1531247676",
  "updatedUnix": "1531247676",
  "containsAdultContent": false,
  "uploadedBy": "WraithBerserker",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000277253",
      "name": "Skyrim Fighters Guild",
      "version": "1.2",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "20202",
      "fileName": "Skyrim Fighters Guild-92447-1-2.zip",
      "uploadedUnix": "1531247598",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/de51acffe42e8e09d25d9824c414444053c0221602cfa97ff1387f03af3daaaf/analysis/1531247832/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Fighters%20Guild-92447-1-2.zip?fid=1000277253&ttl=1535883457&ri=8192&rs=8192&setec=232a22c048c4dfa725b437364a4d9381"
    }
  ]
}