{
  "modId": 92493.0,
  "modName": "JE's Beastly Nifs",
  "summary": "2 Nif sculpts for Argonians, inspired by kobolds/lizardfolk &amp; bangaa. (Also viera.)",
  "descriptionHtml": "[u][size=6][b]JE's Beastly Nifs[/b][/size][/u]\n<br />\n<br />[b]Two hand-sculpted head meshes for male &amp; female Argonians.[/b]\n<br />\n<br />Racemenu required to import them, or Nifmerge if you just want to paste them over an existing NPC. \n<br />(Or ECE, if you prefer. I don't know if it can import nifs, because I use RM exclusively.)\n<br />\n<br />[b][size=3]To use:[/size][/b]\n<br />Download manually, unzip, then dump the nifs into your Chargen folder.\n<br />(Data/SKSE/Plugins/Chargen)\n<br />Sculpted around UNP &amp; SOS bodies, if that matters to anyone.\n<br />\n<br />[b][size=3]KNOWN ISSUES:[/size][/b]\n<br />-Mouth part (teeth &amp; tongue) do not scale with the head. There will be a hole if you open wide &amp; have a look-see.\n<br />-Bad sculpting, likely neck-seams, asymetrical... I rushed things, then got sick of it and threw in the towel. :T\n<br />-Lizardfolk (thin-nosed) head has tongue clipping when mouth is maxed out. \n<br />\n<br />[b]PERMISSIONS:[/b]\n<br />Use however you want, no credit required.\n<br />While it would be nice to be mentioned, I spent less than a day on these and they do have a lot of problems, so IDGAF.\n<br />HAVE FUN\n<br />\n<br />[b]BACKSTORY[/b]\n<br />Once upon a time, I pumped out some garbage, 30 second presets as a proof-of-concept for kobolds, lizardfolk, etc since the scaly races get no love. Then, I sat on my ass and whined about it, waiting for someone with any sort of time or talent to take up the challenge.\n<br />\n<br />[i]Years later[/i]: No one did. (As far as I've seen anyway.)\n<br />\n<br />So I decided to be the change I wanted to see and spent a couple weeks painstakingly modeling a few versions... long nosed, round faced, long eared bangaa-types, all carefully sculpted so their textures weren't distorted at all...\n<br />\n<br />Then my computer ate those files. \n<br />\n<br />NO BACKUPS, [i]of course.[/i] orz\n<br />\n<br />This was attempt at recreating them, before I got completely burnt out. \n<br />Instead of being lovingly sculpted, they're the products of overly-judicious Inflate &amp; Deflate use, with a tiny bit of straighting out here and there.\n<br />The female versions are just the male sculpts with hastily Deflated necks. Neck-seams almost guaranteed, though I did fix that part a little, too.\n<br />\n<br />[b][size=4]As a bonus, I threw in my Ronso-\"Viera\" sculpt, too. [/size][/b]\n<br />\n<br />It's just the New Female head with its ears stuffed inside, scalp smooshed to fit standard hairs, and touched up eyes (since I use the race as a replacer and the eyes/mouth are busted in my game. Your mileage may vary!).\n<br />Requires Ronso for Skyrim, viera ears from another mod, and non-blue textures from somewhere.\n<br />\n<br />Final Note:\n<br />Upon spellchecking this page, I realized that I miss-named the nifs lol.\n<br />Thin-nose should have been bangaa &amp; dragon-face should have been kobold.\n<br />Makes absolutely no difference, content-wise, so oh well :V",
  "categoryId": "26",
  "version": "1.0",
  "author": "JerisEnigma",
  "createdUnix": "1531453055",
  "updatedUnix": "1531453055",
  "containsAdultContent": true,
  "uploadedBy": "JerisEnigma",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000277393",
      "name": "JE's Beastly Nifs",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14768",
      "fileName": "JE's Beastly Nifs-92493-1-0.zip",
      "uploadedUnix": "1531453027",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a443c9213701f3f0d3670f5b99393ea1b9f1d3e8756a99c6c8a6abf7baba92e4/analysis/1531453253/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/JE%27s%20Beastly%20Nifs-92493-1-0.zip?fid=1000277393&ttl=1535883511&ri=8192&rs=8192&setec=2b05d7d9beb1cd7413e4096947f07703"
    }
  ]
}