{
  "modId": 92503.0,
  "modName": "The Wealthiest Merchant Ever - DELETED",
  "summary": "This light weight mod adds a Merchant with tons of cash on him.",
  "descriptionHtml": "[font=Comic Sans MS][size=4]As said Above there will be a merchant with tons of septims waiting for you to either make him even richer or to buy whatever you are willing to sell .... even one of  your realtives .... figuratively. He will just act like a normal merchant hoever i have not tried yet if he is compatible with the investing per.\n<br />\n<br />As a little bit of lore i figured that he came to unbelievable wealth by being a smart trader und some luck.  But life is cruel so he does not have any friends.... at least no real ones and for him there is like no safe place in all of Tamriel. \n<br />So he decided to find himself solme lair and only barter with very few selected people. Of course the Dragonborn ist worthy to have him for a business partner. And as one of like fife or six people in all of Skyrim the Dragonborn knows his whereabouts:\n<br />[/size]\n<br />\n<br />[size=6]ATTENTION: SPOILER AHEAD[/size]\n<br />[size=4]if you want to find him for yourself continue reading at \"Spoiler End\"\n<br />[/size][size=1]There was no better place to build his lair than the underground of Whiterun. So anyone who wants to deal in some superior business shall come under the bridge right in fronst of the Whiterun city gate.\n<br />\n<br />[/size][size=6]Spoiler End\n<br />[/size]\n<br />[size=4]This is a lightweight mod. Its not using any further scripts and does not interfere with the lore. There is however the aspect of feeling like cheating because the merchant has about veeeeeeeeeery much gold. I am aware that ther is about a hundred mods out there that change the money merchants have and / or give you but i wanted to give you somethin that is: \n<br />1: Not using any scripst but those the game uses anyway for trading and\n<br />2: That is an offspring of my personal phantasies xD\n<br />\n<br />Requirements: Skyrim \n<br />\n<br />Thus said, there should not be any bugs with this nor compatibility issues. If you find something, please let me know.\n<br />\n<br />[/size]If you think the merchants lacks an item he should absolutely have, let me know.\n<br />\n<br />As for potentail german users i do not translate my mods to german any more as long as is is not demanded. There will be no need to translate in this mod anyway but if yiu for some weird reason absolutely need to have a german name for the lair and the merchant himself tell me, imma do my best xD[/font]",
  "categoryId": "69",
  "version": "1.1",
  "author": "Radioactive1988",
  "createdUnix": "1531524199",
  "updatedUnix": "1531524199",
  "containsAdultContent": false,
  "uploadedBy": "radioactive1988",
  "primaryFile": null,
  "files": []
}