{
  "modId": 92507.0,
  "modName": "LS Revamps for Requiem",
  "summary": "Expands and fixes vampirism mechanics, provides limited mainland Dragonborn integration, expands the variety of available katanas, tweaks the economy and more.",
  "descriptionHtml": "A personal tweak file focusing mostly on vampires (hence the name), Dunmer, katanas, and the economy.  Compatible with most things that don't change vampires.\n<br />\n<br />Rather than try to transform Requiem like some ascended personal tweaks files, I've tried instead to polish and expand.  \n<br />\n<br />[b][size=4]Requirements[/size][/b]: \n<br />[url=https://www.nexusmods.com/skyrim/mods/19281]Requiem [/url]2.0.x and its requirements (all DLCs and USLEEP).\n<br />\n<br />[size=4][b]Designed to be used with, but not .esp-dependent on[/b][/size]: \n<br />[list]\n<br />[*][url=https://www.nexusmods.com/skyrim/mods/90983]Minor Arcana Reborn[/url]\n<br />[*] [url=https://www.nexusmods.com/skyrim/mods/90714]Requiem Food and Drug Rebalance[/url]\n<br />[*][url=https://www.nexusmods.com/skyrim/mods/86504]Requiem Alchemy Rebalance[/url]\n<br />[*] [url=https://www.nexusmods.com/skyrim/mods/78139/?]Fozar’s Dragonborn patch[/url] and the [url=https://discord.gg/0pBEeD7mhisZVv76]2.0 update for it from the Requiem Discord (Fozar2.esp, in pinned messages under general)[/url].  \n<br />[/list]This mod skips most of the things touched by these mods.  They've already done things similar to what I wanted to do in their areas.\n<br />\n<br />[b][size=4]Features:[/size][/b]\n<br /> \n<br />[b]Undead Living:[/b]\n<br /> \n<br />Only living members of the playable races drop blood for vampires. If vampires just eat wolves all day then why is everyone so freaked out about them? Unlike other versions of this fix I’ve found, this excludes vampires and includes NPCs who are obviously supposed to be playable races but aren’t for technical reasons, such as children, the elderly, Astrid, and the Afflicted.\n<br /> \n<br />Feeding on the Vampire Cattle in Volkihar Keep no longer kills them. Now better than a blood bottle!\n<br /> \n<br />The vanilla issue where changing stages of vampirism breaks hotkeys of Vampiric Drain, a much more significant issue in Requiem since it made Vampiric Drain actually worth using, is fixed. You shouldn't notice any difference at all in the spell's functionality.\n<br /> \n<br />Fixed the related hotkey issue for Vampire's Servant.  Also fixed an issue in Requiem where, in a holdover from vanilla Skyrim’s vampirism stages’ progressing the other way, better versions actually used a weaker version of the reanimation effect despite lasting longer and having higher magnitudes.\n<br /> \n<br />The Requiem vampirism flat bonuses of +300 health and stamina have been broken into blocks of 50, growing as you feed.  You start with +50 health and stamina, then gain +50 more at your first feeding, then +50 more at 15, 50, 100, and 200 feedings, whereafter you have the full Requiem +300.  (Note that the separate stage-dependent health bonuses have not been changed, so your health will actually increase by more than 50 at your first feeding, since you will decrease a stage.)\n<br /> \n<br />Feeding on people who are under the effects of Vampire’s Seduction has a chance to deal no damage.  Accidents happen, but if feeding always kills people anyway what’s the point of Vampire’s Seduction when you can just kill them first and drink the blood off their corpse?  \n<br />\n<br />The NPCs you can turn into vampires for the Volkihar clan’s quests will never take feeding damage.  They’re supposed to be worthy or something.\n<br /> \n<br />Your spouse will never take feeding damage while under Vampire’s Seduction, though will take damage as normal when fed on while not under Vampire’s Seduction.  This should allow the Volkihar quest involving turning your spouse into a vampire to be successfully completed.\n<br /> \n<br />Renamed the effects menu entries for the different stages of vampirism (Sated Thirst and so forth).  They all start with “Thirst“ and so will always occupy the same position in the effects menu, not jump around as you change stages, making it less annoying to check your current stage.\n<br /> \n<br />The weird vanilla bug with Serana weakening the Vampire Lord version of Vampiric Drain, which was carried over into Requiem, is fixed.\n<br />\n<br />Vampires maintain their minor knockdown immunity, but have half the base mass of the living.  60% of human body weight is water, and vampires are almost completely dry (hence the dust, and the vanilla message about your blood boiling away when you become a vampire).\n<br /> \n<br />Elixirs of blood and blood-conserving phials are black market items, but are considerably more valuable, particularly in the case of blood-conserving phials which have a value of 0 in Requiem despite being made of gold. \n<br /> \n<br />When crafting blood-conserving phials you can substitute stahlrim for malachite, and/or ice wraith teeth or frost salts for venomous spittle. I suspect someone was working under the misconception that malachite “glass” is regular old silica glass, but I decided to provide alternatives to this recipe rather than alter it. Presumably the venom is acting as a preservative, so ice wraith teeth and frost salts seemed like viable substitutes based on Marise Aravel’s and Dravynea the Stoneweaver’s dialogues.\n<br /> \n<br />Ronthil and Feran Sadri sell modest amounts of human flesh and blood-conserving phials, and occasionally sell human hearts and elixirs of blood.\n<br />\n<br />Enemy vampires will drop blood-conserving phials more frequently, but elixirs of blood less frequently.\n<br />\n<br />Chests in vampire dungeons will occasionally contain blood-conserving phials.\n<br /> \n<br />Sybille Stentor occasionally sells a single blood-conserving phial.\n<br />\n<br />[b]Fine Goods from Morrowind:[/b]\n<br /> \n<br />Brand Shei, Sadri’s Used Wares, and the New Gnisis Cornerclub actually sell appropriate Morrowind-related items, including Bonemold and Chitin armor, the ingredients and food added by the Dragonborn DLC, enchanted and new unenchanted versions of Dunmer clothing, and katanas (common weapons in Morrowind due to the province's history with and relative proximity to Akavir).\n<br /> \n<br />Katanas from Weapons of the Third Era that Requiem did not deign to include have been added, with stats and crafting/tempering requirements adjusted for balance and consistency.  Existing Requiem katanas have been standardized along the same lines. The Silver Katana and Steel Katana now no longer feel like two different classes of weapon, and katanas as a whole feel a bit more like distinct weapons from regular swords.\n<br /> \n<br />Merchants on Solstheim who sell weapons will sell katanas.\n<br /> \n<br />Bandits perked for swords, greatswords or daggers occasionally have katanas of the appropriate type, tempered according to Requiem's conventions.\n<br /> \n<br />Two-handed katanas have been integrated into Requiem’s generic greatsword list, based on Requiem’s proportions of one-handed katanas in its generic one-handed sword list.\n<br /> \n<br />Random leveled swords on Solstheim will occasionally be katanas. These leveled lists are based on Fozar’s, with some changes and bug fixes (Nordic and Elven are slightly more common, Orcish less common due to the lack of Orc settlements on the island, the one-handed sword town list is fully deleveled, etc.) \n<br /> \n<br />A small number of Dunmer NPCs have katanas instead of their original weapons.\n<br />\n<br />Crafting and tempering requirements for equipment added by Dragonborn have been altered to be as consistent as possible with Requiem's existing smithing tree without adding additional books:\n<br />\n<br />[list]\n<br />[*]Bonemold requires Craftsmanship (was Dwarven to craft regular, Craftsmanship to craft improved, and Orcish to temper either one, but Dwarven to temper the chestpiece variant. Just wow.)\n<br />[*]Chitin and Morag Tong require Advanced Light Armors (was Elven, except for the shield which was Elven and Orcish)\n<br />[*] Heavy Chitin requires Advanced Light Armors and Advanced Blacksmithing (was Orcish. I don't see any Orcs here, do you?)\n<br />[*] Nordic requires Advanced Blacksmithing (was Ebony, which made crafting Nordic gear completely pointless)\n<br />[*] Stalhrim requires Glass and quest completion (was Glass and quest completion for light and weapons, but Ebony and quest completion for heavy) \n<br />[*]Ahzidal's set tempers with iron like regular Ancient Nord armor (was steel).\n<br />[/list]\n<br />Morag Tong set is lighter than regular light chitin set, to reflect its prioritizing stealth over protection.\n<br />\n<br />Advanced Blacksmithing allows you to breakdown chaurus and shellbug chitin into regular chitin plates.\n<br /> \n<br />The Temple Daedra blessings from Dragonborn have durations that match the other Requiem blessings, some unique conditions, and potential greater blessings (based on Fozar’s patch with some changes and expansions).  Azura gives +5% magic resist, +5% more if you’ve cleansed Azura’s Star, and will not bless you if you create the Black Star. Boethiah gives +5% onehanded damage, +10% more if you’ve completed Boethiah’s Calling, and will not bless you if you are a vampire. Mephala gives +10 speechcraft, and +15 sneak if you’ve completed The Whispering Door.\n<br />\n<br />You can actually receive the blessings of Azura and Boethiah at their respective mainland shrines.  Poor Mephala must feel left out.\n<br /> \n<br />[b]Hard Currency:[/b]\n<br /> \n<br />Gold weight is halved from Requiem. 1000 septims encumber you by 5 units.\n<br /> \n<br />Bandit chests include ill-gotten luxury goods and valuable furs, but less gold. Bandits aren’t very liquid right now.\n<br /> \n<br />Enemies in general have much less gold on their persons and in their chests. Giants have none.\n<br /> \n<br />Certain cupboards contain much less gold.\n<br /> \n<br />Coin purses no longer contain gems, and still contain only modest amounts of gold. \n<br /> \n<br />Bounty rewards are paid in gold, and are moderately higher. The bounty should feel like the biggest reward in most bounty quests.  “Oh yeah,” you should think. “That’s why I was doing this. I just got PAID.”  Doing a job for someone should be more monetarily rewarding than just wandering around in the wilderness picking stuff up, especially for a character with no haggling or business expertise.\n<br /> \n<br />Quests which referenced bounty rewards give standardized amounts of gold.  No more gems.\n<br /> \n<br />A certain group of treasure hunters will no longer be disappointed to find that their carefully-hidden prize contains 17 septims and nothing else.\n<br /> \n<br />[b]Miscellaneous:[/b]\n<br /> \n<br />Blacksmiths actually have some steel and corundum for sale. You aren’t special, Alvor.\n<br /> \n<br />The giant kettle in Helgen breaks down into a lot of iron, if you’re insane enough to drag it out of the keep to a smelter.\n<br /> \n<br />Bandit bosses occasionally have enchanted armor, not just enchanted weapons.\n<br /> \n<br />Ralis Sedarys has all his perks back. Naughty Fozar, taking away my favorite follower interaction.\n<br />\n<br />NPCs will no longer allow you to ransack their homes and businesses upon doing minor favors for them. +1 (\"Friend\") disposition does not entitle you to any of their possessions, and higher ranks entitle you to less than in vanilla or Requiem, except for marriage which still entitles you to almost everything.\n<br /> \n<br />Old Orc is a fairly-difficult one-time encounter, but not a freaking loot piñata like in Minor Arcana. It’s hard to believe the same mod that removed the Ebony Dagger provided a full suite of late-midgame gear for the cost of a few pilfered poisons. Having him walking around with badass enchanted gear, including a backup weapon better than the main weapon of almost every NPC in the game, is strikingly out of place in Requiem's world.  He’s skilled, not rich.  He's certainly not the Ebony Warrior version 0.5 like Minor Arcana makes him out to be.\n<br /> \n<br />Detect Life is the reward for the Treva’s Watch quest.  Requiem does not change this, but CRF does, even with the Requiem patch. This won't hurt anything without CRF.\n<br /> \n<br />The buff from engaging in cannibalism with the Ring of Namira is +50% stamina regeneration and no drain from running, +100% health regeneration, and +25 health, all for ten minutes.\n<br />\n<br />Orcish armor is a bit lighter and a bit weaker to reflect its ancestry as a medium armor set.\n<br />\n<br />Scaled armor set provides more protection than Elven but is substantially heavier, hopefully meaning both will be viable options in the midgame.\n<br />\n<br />Similarly, studded armor provides more protection than leather but is substantially heavier. \n<br />\n<br />Ancient Nord armor set is no longer just a worse Wolf set. It is now heavier, but provides more protection and has the ArmorMaterialEbony keyword for dragon protection.\n<br />\n<br />Undid Fozar's nerfs to Ahzidal's set, added the Ebony keyword to match regular Ancient Nord, and reverted some Engrish in the descriptions.\n<br />\n<br />Fixed an oversight in the 2.0 update for Fozar's patch that caused Ice Spike to lack a slow effect and the physical half of its intended damage.\n<br />\n<br />The skooma dealers occasionally encountered on the road have non-zero proficiency in unarmed combat, their chosen method of conflict resolution.\n<br />\n<br />Thieves will occasionally attempt robbery in cities even if you are not a thief.  The world isn't supposed to revolve around you in Requiem.  Also removed the level requirements for this event, which were still there for some reason, and lowered its chance to occur since it can occur in a much wider range of situations now.\n<br /> \n<br />The Woodsman’s Friend is “special.”  =)\n<br />\n<br />[size=4][b]Installation and Compatibility:[/b][/size]\n<br />This mod's PlayerVampireQuestScript.pex must overwrite all other versions, including that of Requiem.  It is a modified version of the Requiem script which removes the part that switches between different versions of Vampiric Drain when changing vampirism stages (there is now only a single version whose effects and cost scale with your stage via condition checks and invisible perks). This is the key to the hotkey bug fix. This means it must be loaded after in the LEFT panel (MO) or installed after (NMM or manual) all other mods which include a version of this script, including Requiem. Installing this on a save where you are already a vampire is a bad idea because of this script change.  You could try installing it when you're at stage 4  vampirism (starving), but it's probably still a bad idea. \n<br />\n<br />If used with [url=https://www.nexusmods.com/skyrim/mods/27644/?]Immersive Weapons[/url], [url=https://www.nexusmods.com/skyrim/mods/3871/?]Weapons of the Third Era[/url], or [url=https://www.nexusmods.com/skyrim/mods/92305]Requiem - Missing Katanas from Weapons of the Third Era[/url], you will end up with duplicates of the new katanas, in some cases with different stats and crafting requirements, resulting in a cluttered and confusing crafting menu.\n<br />\n<br />Other than that everything in this mod is simple record changes and should be compatible and/or cleanly overwritten.  If a non-vampire-related feature isn't working something is probably overwriting it, and you should move this mod lower in your load order.\n<br /> \n<br />[size=4][b]Thanks:[/b][/size]\n<br />[list]\n<br />[*]Everyone who ever posted about the Requiem vampirism experience, with or without other vampire mods, especially [url=https://www.nexusmods.com/skyrim/users/1009563]kiskoller[/url] for [url=https://www.reddit.com/r/skyrimrequiem/comments/7v7k1r/2_things_i_think_should_be_changed_about_vampirism/]this post[/url] and [url=https://www.nexusmods.com/skyrim/mods/89459]this mod[/url], which inspired me to start working on the vampire stuff that ended up taking over the mod. \n<br />[*]fassina2 for a valuable technical take on kiskoller's suggestions in the thread linked above.\n<br />[*]The guy who commented somewhere that the big kettle should give you lots of iron.  \n<br />[*]The guy who complained somewhere about there being no steel for sale anywhere.\n<br />[*]The Requiem authors for Requiem.\n<br />[*]747823 for [url=https://www.nexusmods.com/skyrim/mods/3871/?]Weapons of the Third Era﻿[/url], the source of the katanas.\n<br />[*]Acerac for the [url=https://www.nexusmods.com/skyrim/mods/86964?tab=files]Better Bandit Chests[/url]﻿ mod, which was the initial inspiration for the economy changes.\n<br />[*]Sharlikran for TES5Edit.\n<br />[*]Amadar for [url=https://www.nexusmods.com/skyrim/mods/74672]PapyrusCompilerPlus[/url]﻿.\n<br />[*]Fading Signal for [url=https://www.nexusmods.com/skyrim/mods/89459]this TES5Edit tutorial[/url]. \n<br />[*][url=https://www.reddit.com/user/MeteoricTrail]MeteoricTrail [/url]﻿and [url=https://www.nexusmods.com/skyrim/users/2023539]Schofida [/url]﻿for inspiring me to start modding.\n<br />[*][url=https://www.nexusmods.com/skyrim/users/7021459]Segolia94 [/url]﻿for uploading [url=https://www.nexusmods.com/skyrim/mods/91592]his personal tweak mod[/url]﻿ which inspired me to clean up mine for release.\n<br />[*]wizards\n<br />[/list]\n<br />\n<br />Feedback is welcome and suggestions are greatly appreciated.",
  "categoryId": "84",
  "version": "1.1",
  "author": "LSofACO",
  "createdUnix": "1532151105",
  "updatedUnix": "1532384940",
  "containsAdultContent": false,
  "uploadedBy": "LSofACO",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000277468",
      "name": "LS Revamps",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2",
      "fileName": "LS Revamps-92507-1-0.7z",
      "uploadedUnix": "1531540089",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7f862af0972c16f8ee41a68250d9bd5c5d810a785b38ea4fbd2cfd56fbe1c55b/analysis/1531539603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LS%20Revamps-92507-1-0.7z?fid=1000277468&ttl=1535883533&ri=8192&rs=8192&setec=3f7a3e1d404f0b0510f86071a9ed6e5e"
    },
    {
      "fileId": "1000277733",
      "name": "LS Revamps",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "9589",
      "fileName": "LS Revamps-92507-1-0.7z",
      "uploadedUnix": "1531898953",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7f862af0972c16f8ee41a68250d9bd5c5d810a785b38ea4fbd2cfd56fbe1c55b/analysis/1531899002/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LS%20Revamps-92507-1-0.7z?fid=1000277733&ttl=1535883534&ri=8192&rs=8192&setec=e18ebe05291ad5eccd5d7f8f482d30a3"
    },
    {
      "fileId": "1000277912",
      "name": "LS Revamps",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9605",
      "fileName": "LS Revamps-92507-1-0.7z",
      "uploadedUnix": "1532150766",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e2a573858cc9a832b481df302a5874ccd1628ba3c9c4f7402e06789b8e51556a/analysis/1532150857/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LS%20Revamps-92507-1-0.7z?fid=1000277912&ttl=1535883535&ri=8192&rs=8192&setec=9e52bd92877440588befeade67ba0413"
    },
    {
      "fileId": "1000278152",
      "name": "LS Revamps",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9605",
      "fileName": "LS Revamps-92507-1-1.7z",
      "uploadedUnix": "1532384940",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f24f0a6bbfbcf26ef69f3cd2d593ad1331420e5771a6ca4ff557e4482ed004ee/analysis/1532385037/",
      "changelogHtml": " Fixed leveled list tags for vampire death items which were causing them to drop far too many blood phials. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LS%20Revamps-92507-1-1.7z?fid=1000278152&ttl=1535883535&ri=8192&rs=8192&setec=ce9b4d7a529cea6690e23a927902b6bc"
    }
  ]
}