{
  "modId": 92541.0,
  "modName": "Divine and Daedric - Upscaled Textures - DELETED",
  "summary": "Pretty textures for your Divine Amulets.<br /><br />And your Daedric rings. You fiend.",
  "descriptionHtml": "[center][font=Georgia][size=4][img]https://imgur.com/Lh3brmM.jpg[/img]﻿\n<br />\n<br />It always bothered me that some of the (actually quite nice looking) Divine amulets in LE never got proper retextures, so I decided to look into it myself. I took the incredibly low res vanilla textures (256x256) and decided to try and upscale them to make them look better. It was then that I came across neural network software and saw some pretty nice results after some tweaking.\n<br />\n<br />You remember waifu2x, right? [/size][/font][/center][font=Georgia][size=4]\n<br />[/size][/font][center][font=Georgia][size=4]---\n<br />\n<br />Yep, what I'd used in the past to upscale wallpapers in the past turned out to be pretty amazing for texture files, as well. Although time-consuming, I upscaled every single texture for Divine Amulets by x4 (the _m.dds files x8), including every alpha separately and the end result looked pretty sweet. After some tweaking in Photoshop, I decided to the textures were nice enough to release. Although x4/x8 sounds big, most if not all of the textures are 1K. The vanilla files were incredibly small.\n<br />\n<br />This includes the two woefully ignored textures for the Ring of Hircine and the Ring of Namira, as well as upscaled images for the East Empire Amulets and Skaal Amulet from Solstheim.\n<br />\n<br />[img]https://imgur.com/Ttdxvyg.png[/img]﻿\n<br />\n<br />[/size][/font][font=Georgia][size=4]---\n<br />\n<br />Installation\n<br />\n<br />Just download and overwrite, everything should be correctly labelled.\n<br />\n<br />---\n<br />\n<br />Credits\n<br />\n<br />waifu2x, such a great tool for image editing - https://github.com/lltcggie/waifu2x-caffe/releases\n<br />Bethesda - original textures\n<br />Mord - screenshots\n<br />[/size][/font][/center]",
  "categoryId": "29",
  "version": "1.0",
  "author": "Witchcat",
  "createdUnix": "1531639970",
  "updatedUnix": "1531639970",
  "containsAdultContent": false,
  "uploadedBy": "Lycanthroat",
  "primaryFile": null,
  "files": []
}