{
  "modId": 92567.0,
  "modName": "Boziikkodstrun",
  "summary": "replaces the daedric titan from https://www.nexusmods.com/skyrim/mods/69574 with a custom \"dragon\" that i made.",
  "descriptionHtml": "this mod replaces the daedric titan Boziikkodstrun from Aipex8's mod \"Coldharbour Resummoned\" https://www.nexusmods.com/skyrim/mods/69574 which replaces the vanilla dragon mesh with a custom one that i made to make it look more unique and like the daedric titans in ESO, it isn't a carbon copy of the eso daedric titan though because i don't like to copy everything when im working on something.\n<br />\n<br />this is not perfect and there are some issues with clipping, some texture stretching and some parts of the uv map (because i messed something up and i didn't want to start all over again) you most likely will not notice it in game unless you go actively looking for it. and kind of meh textures in general im not that good at it. also blood and stuff will not properly \"stick\" to the titan and will sometimes kind of float on it. i don't know how to fix that and even if i probably couldn't be bothered. if all that is a problem for you don't download.\n<br />\n<br />\n<br />\n<br />use NMM to install and overwrite everything from the coldharbour resummoned mod. this will put the mod at the bottom of your load order so put it back to where you want it to be. you obviously need Coldharbour Resummoned + hotfix installed first.\n<br />\n<br />as in the original mod you need to summon durnehviir 3 times first before you can summon Boziikkodstrun.\n<br />\n<br />\n<br />\n<br />all screenshots made with ENB and i highly recommend one with this mod.",
  "categoryId": "83",
  "version": "1.0",
  "author": "ScarredandDeformed",
  "createdUnix": "1531768126",
  "updatedUnix": "1531768126",
  "containsAdultContent": false,
  "uploadedBy": "ScarredandDeformed",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000277643",
      "name": "Boziikkodstrun replacer",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4764",
      "fileName": "Boziikkodstrun replacer-92567-1-0.zip",
      "uploadedUnix": "1531766552",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e0f34cb80f0ea7800cd3fadba99c7a31998b07f15ca43ff6b2744d20738cff9c/analysis/1531766659/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Boziikkodstrun%20replacer-92567-1-0.zip?fid=1000277643&ttl=1535883616&ri=8192&rs=8192&setec=247bb702b26aeb0d92b977ea818986ad"
    }
  ]
}