{
  "modId": 92585.0,
  "modName": "SVOM - DELETED",
  "summary": "(english is not my native) sorry...<br /><br />This mod aims to improve vampirism in Skyrim in a bunch of creative ways, as well as a few ways already well-known from other mods. There are some basic mechanics like sneak-feeding and corpse feeding, but also some new things, like vampiric transformation and class-based mechanic of unlocking abilitie",
  "descriptionHtml": "Quick overview\n<br />FEEL FREE TO MAKE YT VIDEOS ABOUT THIS MOD\n<br />\n<br />GREAT PATCH 1.3!!! read a quick review on the down side of the page\n<br />\n<br />- the way you become a vampire has not been changed (but now it look cooler)\n<br />-vampires become stronger as they age\n<br />-vampires gain new abilities by feeding, \n<br />-starving vampires take damage while in sunlight\n<br />-stage 4 vampire are no longer hated\n<br />-you start in your human form and may turn into the vampire form at any time to increase your strength, but you will be attacked on sight in your true form.\n<br />-starving vampire may randomly transform into his vampire form and have pretty messy life \n<br />-now you can feed on corpses, (obviously)\n<br />-you can also sneak feed (obviously) and paralyze your target by doing this, then you feed on them until they die\n<br />-feeding on a staggered target, and bleeding out enemies are also available but they are pretty messy.\n<br />-REMEMBER TO ENDORSE THIS MOD BOI\n<br />\n<br />\n<br />ALL OF THE OLD STUFF FROM THIS MDO HAS BEEN THROWN INTO THRASH, BUT YOU CAN STILL DOWNLAOD OLD VERSION\n<br />\n<br />\n<br />\n<br />\n<br />                                                                       ADVANCING SYSTEM\n<br />\n<br />\n<br />     Vampires unlock new abilities by drinking blood, drinking blood from corpses does not give you exp, however as you will progress in new abilities you will also unlock new way of feeding, such as feeding on charmed ppl, when you unlock charm spell or feeding while sneaking that paralyze the target, etc... to spend your perk point, go to your power menu and use \"vampiric pwoer\" spell, this spell will teleport you to your perk room, where you can spend your perks and unlock new powers, while in vampire lord form.\n<br />\n<br />\n<br />\n<br />\n<br />                                                                         HUNGER SYSTEM\n<br />\n<br />\n<br />      Vampire take damage from sun at all stages, yet sated vampire tale only 1 point of damage per 5 seconds, starving vampire take 15 point of damage per second and can randomly transform into vampire when he smell blood.\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />                                                                        VAMPIRIC POWERS\n<br />\n<br />\n<br />     After you spend your perks in your vampire lord perk tree, that is now accesable in human form, even if you are not a vampire lord, you'll gain new abilities, some of them are vampire lord only, like flying, yet there are still lot of power that lesser vampire can use, like bat form, corpse curse, mist form(now toogalbe)  inhuman reflex(also toogable) or invisibility etc.. there are many diffrent spells and powers to use, just test them for your self.\n<br />\n<br />\n<br />\n<br />                                                                     \n<br />                                                                                 AGING\n<br />\n<br />\n<br />   Vampires will age over time, gaining more powerful buffs, sucha s improved movement speed, damage reduction, health regeneration, and bonus unarmed/weapon damage.\n<br />\n<br />\n<br />\n<br />\n<br />                                                                            ENTHRALLING\n<br />\n<br />\n<br />     After you unlock charm spell (take at least 4 perks to climb it in perk tree) you can enthrall people, to make them your slave, they will be friendly to you if possible they will be your followers, You can also feed on them whenever you want to, but be carefull not to kill them.\n<br />\n<br />\n<br />\n<br />                                                                         SANQUINA VAMPIRIE\n<br />\n<br />    This is a lesser power that let you tunr other peoples into vampires, after you turn them, they will be your followers, and they will also use they the vampiric strenghts and weakness's \n<br />\n<br />\n<br />\n<br />\n<br />\n<br />wow that was a really short description but oh well.\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />PATCH 1.3  QUICK  CHANGES REVIEW\n<br />-new perk system based on vampire lord perks\n<br />-lot of new spells to acces in human form\n<br />-vampire npc are more buffed and have \"vampire like\" combat style\n<br />-less bugs (WAY LESS BUGS, SERIOUSLE I CAN'T BELIEVE HOW BUGGED WHI MOD USE TO BE)\n<br />-sun damage changes\n<br />-that's all?... i think so...\n<br />\n<br />\n<br />PATCH 1.2 QUICK  CHANGES REVIEW\n<br />-FEED DAMAGE APPLY AFTER ANIMATION IS FINISHED\n<br />-ADDED SLEEP PARALYZE SPELL (description is up there ^ )\n<br />-Added a new hemoplague spell (also up there ^ )\n<br />-some feeding techniques require more skills now\n<br />-vampire lord can fly (for real)\n<br />-bat travel power\n<br />-increased movement speed\n<br />-turning into vampire looks cooler now\n<br />-starving gives you more penalties\n<br />-thats all i think\n<br />\n<br />Quick Info\n<br />-This mod requires Dawnguard and DragonBorn\n<br />-English is not my native language (as you have probably already guessed) \n<br />-I'm not planning to add a Polish translation even though it is my native language so if anyone else wants to do it or translate this mod into any other language feel free to do it\n<br />-feel free to use this mod's scripts in your mods \n<br />-modding is actually easier than I thought\n<br />\n<br />KNOWN ISSUES\n<br />\n<br />-Sometimes, feeding damage might not work\n<br />-Sneak feeding, might cause player to be stuck in one placed\n<br />-sometimes, enthralled ppl are not friendly even if they should be (rare bug)\n<br />\n<br />WELL thats all I guess... have fun or something!",
  "categoryId": "94",
  "version": "1.4",
  "author": "bard",
  "createdUnix": "1531847712",
  "updatedUnix": "1531847712",
  "containsAdultContent": false,
  "uploadedBy": "Univers123",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000277692",
      "name": "SVOMSSE",
      "version": "1.4",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "115",
      "fileName": "SVOMSSE-92585-1-4.7z",
      "uploadedUnix": "1531847701",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/ef55a71b289db0d9f5a72ceb483e88b2708b7b39a8d32c1b031c0d6a668cf1c9/analysis/1531847883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SVOMSSE-92585-1-4.7z?fid=1000277692&ttl=1535883646&ri=8192&rs=8192&setec=c3a51f4920899baa05f6ac067e2e4b48"
    }
  ]
}