{
  "modId": 92615.0,
  "modName": "Piper and Charlie- Twin Followers",
  "summary": "Two simple followers who have embarked on their own journey, and they wish to help the Dragonborn.",
  "descriptionHtml": "This is basically a simple follower mod, based on both two of my Skyrim characters and from a story I have written (Not an Skyrim Fanfiction, I just changed details to make them fit in Skyrim.)\n<br />\n<br />First thing: Yes this would be a little bit of lore breaking, considering they have the titles Queen and King, don't like it? Then move on.\n<br />Secondly Piper and Charlie are slightly OP in early levels, you can pick them up in Bleak Falls and drop them off at some town after, due to their packages they will stay and sandbox in the place they are as they will not return to Bleak Falls (Given they don't live there, it makes sense.)\n<br />\n<br />[b]Story:[/b] Queen Piper Kanniah and King Charlie Kanniah are from another land, and twin siblings to each other. Piper's husband has visions and informed her Skyrim was in danger, so the two left their spouses behind to find out what the danger is, they have similarities to the Dragonborn and can use the Unrelenting Shouts. Piper has the Fire Breath and Charlie has the Frost Breath shout. They are both well skilled in their battles and are a little OP, so it is best to grab them when you are powerful yourself; both scale with your level up to 200 so when you learn, they will learn. They both have journals that give a little bit more on their background. \n<br />Piper doesn't approve of Charlie's ideal clothes for battle, so she enchanted his boots with Resist Frost in order to help protect him a little bit more.\n<br />\n<br />Piper and Charlie are non voiced and use vanilla voices. While in their journals it mentions they have spouses, they are both marriable as well (You can make up a story what happens with their spouses.)\n<br />\n<br />[b]Where to find them?:[/b] Bleak Falls Burrow, right before the puzzle door, they are both stuck and confused on how to get through. When you, the Dragonborn arrives they ask to come with you. (Note you can only take one or the other with you, unless you have a mod like Share and Recruit that allows you to take both. \n<br />\n<br />[b]Other Details: [/b]I have added what Piper and Charlie look like as my playable characters, I didn't want to make anything an requirement that isn't an vanilla DLC but if you wish to get the same looks I suggest using the Ashara Prince of the Woods mod with CBBE support, they both look great in my opinion with their armors. It is up to you whether you want to include the same armor with them or go with what they do.\n<br />\n<br />Piper is meant to use an Bound Battleaxe, but for whatever reason she refuses to use the spell. So instead she will shoot Lightening bolts, have an bow and an Ebony Enchanted Battleaxe to battle along with her shouts. I have left the spell in her list though, so maybe it's related to my game and she might actually use it in yours.\n<br />\n<br />Charlie simply uses an Glass Greatsword and uses his shouts less regularly then Piper. He is more weaker then Piper which is by design.\n<br />[b]\n<br />Requirements:\n<br />[/b]Skyrim\n<br />Dragonborn (For Piper's outfit). \n<br />\n<br />CBBE and Better Males was used for Piper and Charlie, but I think it changes with whatever body you have, so it should be fine. (I had other mods involving NPCS and no one has said that it was needed).\n<br />\n<br />[b]Permission:[/b]\n<br />If you wish to alter the appeareances of these two followers, then you have my permission. I don't think they need to be changed too much but I get it may not be someone else's cup of tear. I also give permission for anyone who wants to turn them into custom voiced companions, it would be my dream to see them be like Vilja, Sofia, Recorder, or Inigo given these characters are important to me, but as I do not possess the skills or voice for it, you are welcome to do it as long as I am credited.\n<br />\n<br />[b]Installation: \n<br />[/b]Honestly best way is to do it manually, I have been told that MO way doesn't always work with the mods I upload, I am unsure of the reason why, however it is a small mod so it shouldn't do anything I do not have MO or NMM, so here's how to do it manually:\n<br />Download the mod, once it's done open up the mod (Good idea to have Winrar), copy the Textures and Meshes folder (Or simply bring up a new window on the Skyrim/Data files and move it into the Data file, it will ask you if you want it to be merged, say yes. Then just take the Piper and Charlie.esp and drop it in the Data file, if done right all of it should be completed.",
  "categoryId": "96",
  "version": "1",
  "author": "Umbren91",
  "createdUnix": "1532046432",
  "updatedUnix": "1532046432",
  "containsAdultContent": false,
  "uploadedBy": "Umbren91",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000277844",
      "name": "Piper and Charlie- Twin Followers",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "426",
      "fileName": "Piper and Charlie- Twin Followers-92615-1.rar",
      "uploadedUnix": "1532046029",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e40d0b0aadb1c13096098e2e6693a734675789fd77135dd302a80c19d8c593ec/analysis/1532046183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Piper%20and%20Charlie-%20Twin%20Followers-92615-1.rar?fid=1000277844&ttl=1535883693&ri=8192&rs=8192&setec=0a87237dadc52b52f38c39bd93c62015"
    }
  ]
}