{
  "modId": 92690.0,
  "modName": "LS's Small Requiem Patches",
  "summary": "A collection of personal patches with varying levels of polish that I do not feel merit individual releases.",
  "descriptionHtml": "These patches were made for personal use and are provided as-is.  I make no guarantee of compatibility or functionality.  Use at your own risk.  There is no consistent vision or balance between patches as they were made over a long period of time and for a variety of load orders and playthroughs, so each should be judged on its own merits.  I no longer use many of them in my own game, and have thus abandoned them.  In many cases I don't even remember the full details of what they do.  That said, none of them contain modified scripts, so they shouldn't mess things up too badly.\n<br />\n<br />Path of Sorcery (BONES) - Adds basic armor perks to skeletons to prevent exhaustion.\n<br />\n<br />Beyond Reach - Removes Daedra Heart drops from minor enemies, adds basic armor perks to Rados, buffs the Missionary, nerfs the Half Breed's fire breath (it was referencing a Dragon-exclusive spell which Requiem buffed hugely).\n<br />\n<br />Ice Blade of the Monarch - Replaces WeapMaterialDaedric keyword with WeapMaterialEbony, removes vanilla-style arcane blacksmithing requirements, crafting recipes require Legendary Smithing.\n<br />\n<br />Apotheus Light Armor - Removes vanilla-style arcane blacksmithing requirements.\n<br />\n<br />Better Vampires Strict ABANDONED ALPHA - Delevels all spells and abilities, adds a touch of Requiem's abilities to BV's.  Scripts are not touched but due to the structure of the mod some MCM options will no longer work.  My intended MCM settings: Reverse progression, easier - necks bitten, hated at stage 4, slight sun damage, immune at stage 1, recover in low light.  \n<br />\n<br />Rings of Old - Merges changes to a certain actor to make Ring of the Vampire obtainable in Requiem.\n<br />\n<br />EtAC - Removes lootable Daedra Hearts from decorative displays in alchemist shops.\n<br />\n<br />Beyond Skyrim Bruma + Guard Cloaks - Zeroes out an unused crafting recipe for a weapon with no texture that shows up in the crafting menu in some load orders, dramatically reduces the frequency of the Ayleid load screen, makes Bruma cloaks unenchantable following Cloaks For Requiem's conventions.\n<br />\n<br />Bruma BtC patch - Changes Bruma breakdown recipes to be more consistent with BtC.\n<br />\n<br />Cloaks for Requiem - Removes Frostfall keywords to prevent errors.  Mainly just an OCD thing.\n<br />\n<br />Improved Closefaced Helmets - Forwards Requiem/Minor Arcana/Fozar's DB stat changes in cases where thetrader's patch from Patch Central did not.  Load after thetrader's patch.",
  "categoryId": "84",
  "version": "1.0",
  "author": "LSofACO",
  "createdUnix": "1532408907",
  "updatedUnix": "1532408907",
  "containsAdultContent": false,
  "uploadedBy": "LSofACO",
  "primaryFile": null,
  "files": []
}