{
  "modId": 92727.0,
  "modName": "Chapter I - Rindfell",
  "summary": "Chapter I: Rindfell is a total conversion mod with it's main story spread over all the provinces of the world divided in chapters. Customization promotes creativity and with this you'll be able to fully experience who you want to be more than ever before. You start a new life, but the paths takes an exciting turn. What will your path be? Up to you",
  "descriptionHtml": "[b]Chapter I: Rindfell\n<br />[/b]\n<br />[i][b]Basic description[/b]\n<br />[/i][i]Chapter I: Rindfell is a total conversion mod series with it's main story spread over all the provinces of the world divided in chapters. Customization promotes creativity and with this you'll be able to fully experience who you want to be more than ever before. You start a new life, but the paths takes an exciting turn. What will your path be? Up to you.\n<br />\n<br />[b]18+[/b]\n<br />This mod series will include gambling, partial revealing nudity (perhaps), extreme violence, and extreme angry word choices.\n<br />Please enjoy.\n<br />\n<br />[/i][b][i]Main story short\n<br />[/i][/b][i]You and a friend of yours are going to leave your homes to start a new and prosperous beginning and travels illegally by ship. You arrive in Rindfell home of the Empire's capital. The emperor gets assassinated by a cult and it causes panic throughout the continent. Is there a heir left? Slowly everything falls to the old way. Global war and in the fog of war another party descends upon the earth to wreak havoc among the civilizations. Will you become a divine crusader cheered on by the people or will you be a god of death annihilating cities and people alike?\n<br />\n<br />[/i][b][i]Required installations\n<br />[/i][/b][i]The only installation you will need is a updated copy of The Elder Scrolls V: Skyrim and Skyrim Script Extender (Skse).\n<br />\n<br />[/i][i][b]Compatible mods[/b]\n<br />[/i][i]Probably none. This mod is designed to end your mod list. Enhancing most aspects of the vanilla Skyrim. Features will be shown in the Feature section.[/i]\n<br />\n<br />[b]Features\n<br />[/b][i]* A new province around the size of Skyrim[/i]\n<br />[i]* Guilds such as thieves, assassins, fighters, mages, traders, bards, divine/evil alliance and an army alliance[/i]\n<br />[i]* New story lines for cities, main events and guilds[/i]\n<br />[i]* Weather system overhaul. You'll be affected by heat, cold and hard winds[/i]\n<br />[i]* New skill trees such as woodworking, clothier, cooking, bare-handed [/i]\n<br />[i]* New combat mechanics such as grabbing on to enemies, grapple hold, dodge, crippling, bleed out etc.[/i]\n<br />[i]* Logical crafting such as making potion bottles from glass and purifying water[/i]\n<br />[i]* Enhanced hunter mechanics such as dressing, skinning, harvesting materials and meat (includes fishing)[/i]\n<br />[i]* Take on any vocation work for someone or set up your own shop at your home[/i]\n<br />[i]* Free building mechanic. Choose which furniture you want and where you'll place it[/i]\n<br />[i]* Gear customization. Dye your gear or take bits and pieces apart or add them to make unique gear[/i]\n<br />[i]* Artisan services. Be able to pay enchanters, cooks, woodworkers, clothiers and smiths for their\n<br />* Overhauled, editable User Interface and option to disable pause in selected menus[/i]\n<br />[b]And many more...[/b]\n<br />\n<br />[b]Development notices:[/b]\n<br />* I do not need any extra hands besides voice actors and testers when the need arrives.\n<br />* Voice actors and testers gets early access to the whole mod when it's finished before everyone else.\n<br />* [i]Most textures and meshes are made by myself and some are used from Bethesda itself.\n<br />\n<br />[/i][b] languages:\n<br />[/b]* [i]Primarily English\n<br />[/i]* [i]Other languages may be soon available[/i]\n<br />\n<br />[b]WARNING(S):[/b]\n<br />Using other mods may or may not include the risk of breaking your game. I do not intend of making\n<br />any patches for other mods to work with this one. I design this mod to get rid of having a large load order by including\n<br />a huge amount of ideas. If there might be an idea you want in the mod for in the future I'll recommend to start a petition\n<br />and reach at least 500 \"signatures\". [b]I do not take responsibility for breaking the game. I'm available for troubleshooting [/b]\n<br />[b]and you're free to look into it yourself.[/b]\n<br />\n<br />[b][i]NOTICE FOR MODDERS:\n<br />[/i][/b]This mod is opensource and everyone is able to use the assets and/or the mod file for their own desires.\n<br />[b]One tip: If you copy someone else's content and post it as your own, the audience will find it out and \n<br />you get lots of drama headed your way. Just a reminder to put rightful sources whenever it is due.[/b]",
  "categoryId": "30",
  "version": "1.0",
  "author": "YPJLAPI",
  "createdUnix": "1532595754",
  "updatedUnix": "1532595754",
  "containsAdultContent": true,
  "uploadedBy": "YpjLaPi",
  "primaryFile": null,
  "files": []
}