{
  "modId": 92765.0,
  "modName": "Wayshrines - Remnants of a Forgotten Era - DELETED",
  "summary": "This project is a reboot of Wayshrines of Old, but with the focus on simplicity. Wayshrines of Old suffered from a bloat of features that were built ontop of a poorly implemented framework. The only way to move forward with development was to completely overhaul the framework to be far simpler in design.",
  "descriptionHtml": "[center]Wayshrines - Remnants of a Forgotten Era - Director's Cut is a simple plugin that adds remnants from the second era, wayshrines, as an alternate means of traversing  Tamriel. Unlike the shrines left behind the Snow Elves, these shrines can be used by regular mortals at the right cost. \n<br />[color=#9fc5e8]\n<br />This project is a reboot of \"Wayshrines of Old\".\n<br />\n<br />[size=5][b][url=https://www.nexusmods.com/skyrimspecialedition/mods/18959]Download for Special Edition on the PC[/url]﻿\n<br />Download for Special Edition on the XBOX\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/mods/18959]Download the Director's Cut for Special Edition on the PC[/url]﻿[/b][/size]\n<br />[/color][/center][color=#9fc5e8]\n<br />[b][size=3]Requirements:[/size][/b][/color][size=3] [/size]\n<br />[list]\n<br />[*]The Elder Scrolls V: Skyrim + Dawnguard + Dragonborn\n<br />[*]Optional: [url=http://skse.silverlock.org/]SKSE[/url]﻿\n<br />[*]Optional: [url=https://www.nexusmods.com/skyrim/mods/3863/]SkyUI[/url]﻿\n<br />[/list]\n<br />[b][color=#9fc5e8][size=3]Multiple Activation Costs and Consequences[/size][/color][/b]\n<br />[b][color=#9fc5e8]\n<br />Magicka/Stamina/Health[/color][/b]\n<br />You will be charged 30% of your Magicka per activation, however if you continue to use a shrine well after you have exhausted all of your magicka, it will eat into your Stamina, and then eventually your Health. Chances of arriving at your chosen destination will decrease when you reach your Stamina / Health. You will be transported to a random location\n<br />\n<br />[b][color=#9fc5e8]Dragon Souls[/color][/b]\n<br />You will be charged 1 Dragon Soul to activate and travel with a shrine. \n<br />\n<br />[b][color=#9fc5e8]Soul Gems[/color][/b]\n<br />You will be charged one full Grand Soul Gem to activate and travel with a shrine. \n<br />\n<br />[b][color=#9fc5e8]Gold[/color][/b]\n<br />You will be charged 500 Gold to activate and travel with a shrine. \n<br />\n<br />[b][color=#9fc5e8]Free[/color][/b]\n<br />You are able to travel between shrines without any sort of cost. \n<br />\n<br />[b][color=#9fc5e8][size=3]Discovery[/size][/color][/b]\n<br />Before you can go on any adventures you first need to discover some shrines. Every location can be found inside of the following categories: [color=#9fc5e8]Hold Capitals and Cities, Towns and Settlements, Orc Strongholds, and Unique Locations[/color]. In order for any locations to show up, you will need to discover the shrines in those locations. Alternatively, you can unlock almost all locations through an optional cheat which can found in the book “Configure Wayshrines” or the Mod Configuration Menu. With the exception of a few shrines, which were intentionally left out to not break the quests that unlock those locations. If you want to reach them, you are going to have to discover them on foot.\n<br />\n<br />[b][color=#9fc5e8][size=3]Configuration[/size][/color][/b]\n<br />Take charge of how the shrines operate in your game by configuring options through the book “Configure Wayshrines” or the Mod Configuration Menu.The book will be added to your inventory whenever you load a save for the first time. Make sure you do not lose your copy of the book as you will not be given another one the next time you load the save. In case you ever lose your copy of the book, [color=#9fc5e8]open the console, type help JC_ShrineConfigBook, add the book to your inventory with the following code player.additem xxxIDofBook[/color]. Alternatively, you can use AddItemMenu – Ultimate Mod Explorer by Towawot to add it to your inventory.Both more or less offer the same options so it doesn’t really matter which one you use. \n<br />\n<br />However, do not use both simultaneously as it will only create problems. Simply use one or the other. If you are going to switch from one to the other MAKE SURE that you reset all options to their DEFAULT options.\n<br />[size=4]\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/articles/636]Frequently Asked Questions[/url]\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/articles/637]Compatibility Information\n<br />[/url][url=https://www.nexusmods.com/skyrimspecialedition/articles/640]Known Issues[/url]\n<br />[/size]\n<br />\n<br />[b]Files have been checked and cleaned with TES5Edit!\n<br />[/b][b]Meshes have been checked with NifScan and fixed with NifSkope.[/b]\n<br />\n<br />[b][color=#9fc5e8]Locations[/color]\n<br />[/b][b]Hold Capitals and Cities[/b]\n<br />[list]\n<br />[*]Riften\n<br />\n<br />[*]Solitude\n<br />\n<br />[*]Whiterun\n<br />\n<br />[*]Windhelm\n<br />\n<br />[*]Winterhold\n<br />\n<br />[*]Morthal\n<br />\n<br />[*]Falkreath\n<br />\n<br />[*]Dawnstar\n<br />\n<br />[*]Markarth\n<br />\n<br />[*]Bruma ([url=https://www.nexusmods.com/skyrim/mods/84946/]Beyond Skyrim Bruma[/url]﻿)\n<br />[/list][b]Towns and Settlements[/b]\n<br />[list]\n<br />[*]Riverwood\n<br />\n<br />[*]Ivarstead\n<br />\n<br />[*]Shors Stone\n<br />\n<br />[*]Rorikstead\n<br />\n<br />[*]Karthwasten\n<br />[*]Kynesgrove\n<br />[*]Skaal Village\n<br />[*]Raven Rock\n<br />[/list][b]Orc Strongholds[/b]\n<br />[list]\n<br />[*]Dushnik Yal\n<br />\n<br />[*]Largashbur\n<br />\n<br />[*]Narzulbur\n<br />\n<br />[*]Mor Khazghur\n<br />\n<br />[/list][b]Unique Locations[/b]\n<br />[list]\n<br />[*]High Hrothgar\n<br />\n<br />[*]Skaal Village\n<br />\n<br />[*]Raven Rock\n<br />\n<br />[*]Castle Volkihar\n<br />\n<br />[*]Soul Cairn\n<br />\n<br />[*]Dayspring Canyon\n<br />\n<br />[*]Tel Mithryn\n<br />\n<br />[*]Eldergleam Sanctuary\n<br />\n<br />[*]Blackreach\n<br />\n<br />[/list]\n<br />[b]\n<br />Credits[/b]\n<br />[list]\n<br />[*]ZeniMax Online Studios for The Elder Scrolls Online which serves as the inspiration for this entire project.\n<br />[*]Bethesda Softworks for The Elder Scrolls V: Skyrim and the Creation Kit.\n<br />[*]Schlangster for providing the resources (SkyUI SDK) needed to create a Mod Configuration Menu.\n<br />[*]DarkFox127 for his tutorial on how to create a Mod Configuration Menu on Youtube.\n<br />[/list]",
  "categoryId": "70",
  "version": "1.0",
  "author": "JayCrane",
  "createdUnix": "1532782019",
  "updatedUnix": "1532782019",
  "containsAdultContent": false,
  "uploadedBy": "User_46821278",
  "primaryFile": null,
  "files": []
}