{
  "modId": 92769.0,
  "modName": "Staggering Spit",
  "summary": "Wanna stagger someone without being a Fus-ing Dragonborn? Spit in their eye! Trust me, they'll be caught off guard.",
  "descriptionHtml": "I don't know about you- but I never enjoyed being the Dragonborn. I just wanted to be a run of the mill sellsword and thanks to beautiful mods like Skyrim Unbound that was made possible. However- I ran into another problem, sometimes it felt like the combat was designed for you to be the Dragonborn, with some relentless enemies even on the 'medium' difficulty setting, enemies that were wondering deep in their programming \"Why aren't I being yelled at in dragon-ese?\". Just my opinion, but sometimes you just NEED to stagger someone. SO- wanting to give my dirty fighting sellsword some kind of a stagger I took my first foray into the Creation Kit and came up with this...\n<br />\n<br />Staggering Spit. A lesser power. Your pc will shoot a spider spit that staggers the enemy like the \"Fus!\". \n<br />To obtain, type into the console: help \"Staggering Spit\"\n<br />Then manually add it with the player.addspell (the numbers it gives you here).\n<br />Voila.",
  "categoryId": "75",
  "version": "1.0",
  "author": "MankarUsurper",
  "createdUnix": "1532808355",
  "updatedUnix": "1532808355",
  "containsAdultContent": false,
  "uploadedBy": "MankarUsurper",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000278402",
      "name": "Staggering Spit",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Staggering Spit-92769-1-0.zip",
      "uploadedUnix": "1532807978",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b81e40fc3283da8e264272af32fa05c16ca64f14f293ba2326430f944c11e762/analysis/1532808123/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Staggering%20Spit-92769-1-0.zip?fid=1000278402&ttl=1535883890&ri=8192&rs=8192&setec=c1282af37eaf8dc8030fb8299e86cdb7"
    }
  ]
}