{
  "modId": 92810.0,
  "modName": "Goals for Roleplaying",
  "summary": "More stuff to do when you roleplay! Set of objective based goals for roleplaying character archetypes in interactive checklist format. Extend your roleplaying experience.",
  "descriptionHtml": "[size=5]RoleplayingGoals[/size]\n<br />\n<br />\n<br />[size=4]TL;DR[/size]\n<br />\n<br />More stuff for you to do when you roleplay!\n<br />\n<br />\n<br />\n<br />I am consistently amazed by all of the thought and care that goes into the\n<br />making of so many great mods, by so many talented people. I\n<br />may not have the same skill for coding and modding that some of you do, but I\n<br />did want to give something back to the community in some way. So, Thank you all,\n<br />and I hope you get some use out of my small contribution.\n<br />\n<br />Do you enjoy roleplaying in Skyrim, but find that you quickly run out of things\n<br />to do that make sense for your character?\n<br /> That's why I created [i]Goals for Roleplaying[/i].Inside you'll find 11 different character \n<br />archetypes to roleplay as. Each has several  flavorful lore-friendly objectives \n<br />to complete. They are presented in an interactive checklist format\n<br />and each goal includes a little flavor text to get you inspired. There is also\n<br />a list of restricted actions for each archetype, to make the experience more\n<br />challenging. Feel free to use whichever goals or restrictions make sense to\n<br />you, and add your own to make your roleplay as fun as possible.\n<br />\n<br />If anyone would like to use the content contained within this document for\n<br />other mods, quest creation, or whatever, please go ahead and do\n<br />so, just remember reference me and give me credit. Thanks. Also, I do not own\n<br />any of the artwork in this document, images are taken from screenshots and\n<br />concept art of Skyrim, which is owned by Bethesda Softworks. Nor have created,\n<br />or assisted in the creating of any of the mods mentioned in this document. If\n<br />you are a creator of any of the aforementioned and are dissatisfied with this\n<br />work, contact me and I will make the appropriate changes. So please nobody sue\n<br />me.\n<br />\n<br />\n<br />Enjoy!",
  "categoryId": "35",
  "version": "1.0",
  "author": "NalusaChito1",
  "createdUnix": "1532991513",
  "updatedUnix": "1532991513",
  "containsAdultContent": false,
  "uploadedBy": "NalusaChito1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000278553",
      "name": "Goals for Roleplaying",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6150",
      "fileName": "Goals for Roleplaying-92810-1-0.rar",
      "uploadedUnix": "1532991495",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d215e40900d9ab2c1365ea934d0faa4918687a109174377e937b39e6a4675b0c/analysis/1532991023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Goals%20for%20Roleplaying-92810-1-0.rar?fid=1000278553&ttl=1535883943&ri=8192&rs=8192&setec=cff2cdb7b252fb992b2a85fc64f1f98e"
    }
  ]
}