{
  "modId": 92833.0,
  "modName": "RevoLUTion - ENB Color Toolbox",
  "summary": "Liven up your life with LUTs! This is a pack of color presets to be used with an ENB to add some diversity to your screenshots. Designed to work with the Caffeine ENB (but could work with just about any ENB). From colorful to somber, warm and bright to cool and dark, there's plenty of variety to choose from. Join the revoLUTion!",
  "descriptionHtml": "[center]\n<br />[img]https://i.imgur.com/PeKguC4.png[/img]\n<br />[size=3][i]\"At the risk of seeming ridiculous, let me say that the true revolutionary is guided by great feelings of love.\"[/i][/size][size=3] \n<br />- Che Guevara, [url=https://www.marxists.org/archive/guevara/1965/03/man-socialism.htm][i]Socialism &amp; Man in Cuba\n<br />[/i][/url][/size][/center][center][size=3][url=https://www.marxists.org/archive/guevara/1965/03/man-socialism.htm][i][/i][/url][/size][center][/center][/center][size=2]Stand up, all victims of oppression, for the [b]RevoLUTion[/b] is here!  (Also, tyrants fear your might, [url=https://youtu.be/yAw0Ri4FSdM]etc.[/url])  What's the deal?  LUTs, my friend, LUTs![/size]\n<br />\n<br />[size=2][b][i]What is a LUT[/i][/b][/size], [size=2]you ask?  It stands for [u][b]L[/b][/u]ook[b][u]U[/u][/b]p [u][b]T[/b][/u]able, and refers to a way of organizing information to make it easier to access.  The first lookup tables were big heavy clay tablets, later big heavy books, full of results for mathematical functions.  The idea was, if you needed to figure out a complex bit of trigonometry, you could either scratch it out on your little wax tablet (called a \"Blackberry\" by the ancients) or go down to ye olde library and look up the answer in one of these tomes.\n<br />\n<br />Film editors discovered that by feeding their clay tablets into a computer, information about images (color, tone, hot/not, etc.) could be encoded into a lookup table and then used to modify the look of the picture on the fly.  Every time the computer encountered, say, a green pixel, a lookup table could tell it to display that green as purple.  Do that enough times, with enough functions and you can get a picture to look totally different- blue into orange, night into day, the Mona Lisa into a cat eating a hamburger!\n<br />\n<br />I think you see where I'm going with this.\n<br />\n<br />[b]TL/DR:[/b] A LUT is a special kind of clay that makes your screenshots look like catburger.\n<br />\n<br />[b][size=3]OK so[/size][/b]  I made a bunch of color profiles, and now you can try them out for yourself.  This batch was made using the fabulous [url=https://www.nexusmods.com/skyrim/mods/90169]Caffeine ENB[/url], brainchild of the generous and talented [url=https://www.nexusmods.com/skyrim/users/14844589]ZwabberdieBo[/url].  While these LUTs could, theoretically, work with other ENB setups, they might look pretty wonky (well, wonkier anyway).  Go get yourself a cup of Caffeine, and while you're waiting for it to download so you can endorse it, check out these shiny new styles.\n<br />\n<br />\n<br />[/size][center][i]\"These here are a thing of beauty and purity, they watered my crops, cleared my skin, cured my depression, and all that jazz\" - [url=https://www.nexusmods.com/skyrim/users/4550092]Kayol[/url]﻿, Grand Storyteller \n<br />[/i][/center]\n<br />[center][b]﻿(Thanks y'all for helping this make it to the Hot Files!)[/b][/center]\n<br />\n<br />[center][size=2][img]https://i.imgur.com/7g3s0DT.png[/img]\n<br />[img]https://i.imgur.com/Uq1k8SS.jpg[/img][/size][/center][size=2][i]The ones you'll likely leave on for regular playing of the game.[/i]\n<br />\n<br />[size=2][b]Steppe[/b]\n<br />Don't let the name fool you, there's nothing plain about this one.[/size]\n<br />\n<br />[size=2][b]Mudpuppy[/b]\n<br />A balance of slightly warm colors with orange/cyan overtones.  Highlights dropped towards the neutral for everyday play.[/size]\n<br />\n<br />[b]Tlilxochitl[/b]\n<br />Means 'vanilla' in Nahuatl.  Chefs throughout the Aztec empire used tlilxochitl extensively to make desserts, aphrodisiacs, and unmodified video games.\n<br />\n<br />[b]Parchment[/b]\n<br />Eminently playable; Skyrim for the sophisticated palette.\n<br />\n<br />[b]Cicada[/b]\n<br />Bright and cheerful, just like the sound of those omnipresent summer bugs.\n<br />\n<br />[size=2][b]Cecropia[/b]\n<br />Named after the giant furry moth; cool blues and yellows, warm reds and greens.[/size]\n<br />\n<br />[b]Taiga[/b]\n<br />You can practically smell the fir resin.\n<br />\n<br />[center][img]https://i.imgur.com/vJCo3sM.png[/img][img width=805,height=366]https://i.imgur.com/PsLem3u.png[/img][i][/i][/center][i]A variety of bold profiles that create instant drama.  Be careful to balance your shadows and highlights when you line up your shots![/i]\n<br />\n<br />[size=2][b]Habrok[/b]\n<br />Proclaimed \"[the best] of hawks\" in the Poetic Edda, [i]Habrok[/i] means 'High Pants' in Old Norse.  And that's just fabulous.  Slightly desaturated, balanced enough to use every day, bold enough to make an impression.[/size][size=2]\n<br />\n<br />[b]November[/b]\n<br />Distillate of cold rainy days, brown leaves, and Tom Waits.  Like the month, often more comfortable indoors.[/size]\n<br />\n<br />[b]Polypore[/b]\n<br />From reishi to the common cracked-cap, polypore fungi are good for you and me!  Like these mushrooms, this one is healthy and saturated, good in the light and the dark.\n<br />\n<br />[b]Chordate[/b]\n<br />Filmic contrast turned up to eleven.\n<br />\n<br />[center][img]https://i.imgur.com/Dl9wj7b.png[/img][img]https://i.imgur.com/QElFCtr.jpg[/img][/center][i][b]Bright[/b]: Great for outdoor shots.  Highlights clipped and shadows dropped for drama.[/i]\n<br />\n<br />[b]Boreal[/b]\n<br />Cool blues and frosty pinks for northern climes.\n<br />\n<br />[b]Marble[/b]\n<br />What happens when you take Limestone and apply tremendous heat and pressure deep within the bowels of Photoshop.\n<br />\n<br />[i][b]Dark[/b]: The shadows on these have been clipped way out.  Try 'em at night or in a hole in the ground with some spot-lighting and you'll see what these are for.  Surprisingly neat-looking in the sunshine, too.[/i]\n<br />\n<br />[b]Vamp[/b]\n<br />Black and white and red all over.  Over-the-top grim and serious and faintly ridiculous, just like- well, you know.\n<br />\n<br />[b]Zebra[/b]\n<br />Because it's (not really) black and (almost but not quite) white.\n<br />\n<br />[b]Deckard[/b]\n<br />Not nearly enough neon in Skyrim to justify a Blade-Runner-based color scheme, so this one mutated a bit.  Still as warm, dark, and slippery as the old Bradbury Building.\n<br />\n<br />[b]Celeste[/b]\n<br />As in the ghost-ship Mary.  Totes spooky.\n<br />\n<br />[b]Samhain[/b]\n<br />Named after the Celtic harvest festival celebrated by Gaelic traditionalists and Goth kids.  For those Halowe'eny moments.\n<br />\n<br />[center][img]https://i.imgur.com/xy78qwL.png[/img][img]https://i.imgur.com/NopTj7u.jpg[/img][/center][i][b]Colorful[/b]: Sometimes LUTs bring out the colors the ENB artist has carefully calibrated into the mix, and sometimes they just steamroll the whole thing into technicolor hash.  Probably pretty monotonous to play with these on, but each has its role on your artist's palette.[/i]\n<br />[b]\n<br />[/b][b]Limestone[/b]\n<br />Rich in calcium and highly erosive.  Not usually this greenish or whatever the heck kind of color scheme's going on here, but still good for growing alfalfa.\n<br />\n<br />[b]Coldbrew[/b]\n<br />A tip of the hat to the original hodge-podge that is the Caffeine ENB.  Chilly down now.\n<br />\n<br />[b]Homestead[/b]\n<br />Amber waves of grain.\n<br />\n<br />[b]Sassafras[/b]\n<br />Two-tone grade named after the tree with red bark and green leaves.\n<br />[i]\n<br />[b]Desaturated[/b]: Sometimes called \"somber\", these types of color grades trade saturation for sepia tones, and clipped highlights for dropped shadows.[/i]\n<br />\n<br />[b]Megaloceros[/b]\n<br />Named after the giant Pleistocene deer; for antlering down the volume on life.\n<br />\n<br />[b]Petrichor[/b]\n<br />The smell of rain on stone.  Pretty in the fog, tricky in the sun, dangerous in the dark.\n<br />\n<br />[b]Guillemot[/b]\n<br />Made through the efforts of one million sea-birds pecking away at laptops.  North Atlantic-colored.\n<br />\n<br />[/size][center][size=2][size=2][img]https://i.imgur.com/gq7yG3h.png[/img][/size][/size]\n<br />[size=2][img width=716,height=326]https://i.imgur.com/Epugonk.png[/img][/size][/center][size=2][i][b]Warm[/b]:  Drop it as 'twere hot.[/i]\n<br />\n<br />[b]Grandad[/b]\n<br />Worn, weathered, and smells faintly of pipe smoke and butterscotch candies.\n<br />\n<br />[b]Peachy Keen[/b]\n<br />Bright and sweet.  The lifted shadows can make dungeons slightly more navigable and infinitely more glam.\n<br />[i]\n<br />[b]Cool[/b]: As a cucumber/tall glass of ice water/Slim Gaillard\n<br />[/i]\n<br />[b]Cleanbean[/b]\n<br />Bright and crisp.  The name made a lot more sense back when it was green-tinted.\n<br />\n<br />[b]Mercury[/b]\n<br />I'm gonna let [url=http://www.rainyhills.com/Gallery/Calvin_and_Hobbes/Calvin&amp;Hobbes_0346.gif]Bill Waterson[/url] explain this one.\n<br />\n<br />[center][img]https://i.imgur.com/fdOxemq.png[/img][/center][b]*How to Post an Image\n<br />[/b]I welcome your contributions to the image section!  In your image title, please identify the LUT profile you used in the shot, as well as the ENB (if it's not the default Caffeine).  This will help folks who look at the images to get a sense of what this mod does[b].\n<br />\n<br />Installation[/b]\n<br />1. Manually download RevoLUTion!\n<br />2. Make a backup of your old enbeffect.fx file if you want to.\n<br />3. Copy or unpack the included enbseries folder into your main Skyrim folder and allow it to overwrite.\n<br />4. That's it!\n<br />\n<br />[b]How to Use[/b]\n<br />1. Load up your game and open up the ENB GUI (usually the shift key + the enter key, at the same time)\n<br />2. Make sure that the shaders window is open.\n<br />3. At the top of the first item on the list (\"ENBEFFECT\") you'll see the word \"TECHNIQUE\" next to a little box with some words in it.  It might say \"DEFAULT\" or \"SNAPDRAGON\" or, if you already know what you're doing, whatever LUT you used last.  \n<br />4. Hit the thing with the thing and you'll see a drop-down menu with a bunch of other words.  The first 26 words refer to LUTs created by the fabulous Tetrodoxin.  Words 27 through 55 refer to LUTs I made myself, just for you.  If you find yourself wondering what these words signify, might I kindly refer you to a dictionary or other such reference?\n<br />5. Go ahead, click on one!  It looks pretty terrible, right?  Try another one!  OK so that one sucks too, I'm sorry about that.  Don't give up!  Why don't you try that one- no not that one, I meant the other one.  It's not bad, yeah?  Wait, no don't click on tha- oh, that actually looks awesome!\n<br />6. And so on, and so on.\n<br />\n<br />[center][img]https://i.imgur.com/dA8JTEW.png[/img][/center][b]Wait, so is this like an ENB?\n<br />[/b]That was a confusingly worded question.  Yes it is like an ENB.  No it is not an ENB.  This is part of an ENB that you can attach onto another ENB, like Doctor Frankenstein putting a criminal brain into a law-abiding reanimated corpse-person.  Think of it like a mod for your ENB.  You just have to put the thing in the thing and turn the- just read the instructions.\n<br />[b]\n<br />That's real cool and all but is this gonna break my save and wreck my framerate and give my computer herpes?[/b]\n<br />...Probably not?  It's just colors.  If you already run an ENB, and that ENB is Caffeine, this is the same thing, just with more obnoxious color grading.  If you have questions about Caffeine, here's that link [url=https://www.nexusmods.com/skyrim/mods/90169v]one more time[/url].  And if your computer has herpes maybe you should dip it in iodine and tell it to stop making out with gross people at parties.\n<br />\n<br />[b]Whoa, there are a [i]lot[/i] of LUTs here, including a bunch that I don't see on this page!  Did you make all of them?[/b]\n<br />No.  Tetrodoxin made the top half.  ZwabberdieBo ported them into Caffeine because he's a rad dude.  I made the ones on the bottom.  Credit where credit is due.\n<br />\n<br />[b]How'd you do it?[/b]\n<br />Screenshots, Photoshop, whiskey, three boxes 1/16\" LUT-fasteners, the goodwill of my fellows, and plenty of blue paint.  Also the LUT tutorial (LUTorial!) provided by Tetrodoxin in the original [url=https://www.nexusmods.com/skyrim/mods/70451]Snapdragon[/url].\n<br />\n<br />[b]Why'd you do it?[/b]\n<br />I love Tetrodoxin's LUTs, don't get me wrong.  But there are some effects that I found myself stitching into my shots in post-process on the regular.  I like blown-out highlights, dramatic shadows, and a neutral tone than runs a little to the bright side.  Most of the original LUTs tend to have nice color vibrancy, but are graded pretty dark.  Each has a type of scene where it really shines, but I found myself hankering for more in-game options.\n<br />\n<br />[b]Yeah, but these suck!  I mean, I tried a couple and they all looked just terrible.[/b]\n<br />Not really a question, but I get your point.  Every single one of these LUTs has been tested for situational awesomeness.  There are certain types of lighting, or location, or weather, or whatever that make each and every one of these look really good to my nit-picky eyes.  The rest of the time, they'll probably look like hot garbage.  To be fair, that's true of the original LUTs as well.  You may need to tinker with your ENB settings a bit, make sure that your monitor is correctly calibrated, get in the habit of swapping LUTs around as you go, and maybe try taking a picture of something interesting to look at that is not boobs for once.\n<br />\n<br />[b]How do I disable the black bars?[/b]\n<br />You're asking the wrong guy.\n<br />\n<br />[center][img]https://i.imgur.com/oazfZbz.png[/img][/center]Thanks and credit are due to ZwabberdieBo who made Caffeine and generously granted me permission to share a modified version of one of its files.  Tetrodoxin is responsible for the original LUT set.  Mad props all around.  Thanks also to all y'all in the media section who helped with constructive feedback over the past couple weeks as I tested out these LUTs via screenshot.\n<br />\n<br />[b]Speaking of screenshots...[/b]\n<br />I welcome your contributions to the image page!  Please keep it suitable for the squares among us who have hang-ups about what bodies look like and/or don't want their kids to find out.  Not that anyone visiting the Nexus would ever be in danger of seeing a realistic body, but you know, rules and stuff.\n<br />\n<br />Also, for the sake of other folks who look at the images to get a sense of what these presets might look like, please include the LUT profile you used in the title of your image.  \"enb 2018_07_27 15_24_38_93\" and \"thanks great preset\" are terrible names for a thing you want somebody to look at.  If you hodge-podge these LUTs into another ENB, please also make a note of that in your image title.\n<br />\n<br />[b]And also:[/b]\n<br />If you are a genius ENB technician, maybe you can help with the next stage of the RevoLUTion.  I'd like to be able to more effectively stitch LUTs into every ENB under the sun, whether they need 'em or not!  If you know how to extract the relevant bit of LUT-related code from the bowels of the ENB to make an easily transmissible version of this setup, do let's talk.\n<br />\n<br />[img]https://i.imgur.com/3TRHYVb.png[/img]\n<br />[center][size=3][i]\"I want freedom, the right to self-expression, everybody’s right to beautiful, radiant things.  Anarchism meant that to me, and I would live it in spite of the whole world- prisons, persecution, everything. Yes, even in spite of the condemnation of my own comrades I would live my beautiful ideal.\" - [/i]Emma Goldman, [url=https://arroseinaprose.org/2018/05/03/emma-goldmans-dance-revolution-a-lesson-in-historical-inaccuracy-and-meme-devolvement/]Living My Life[/url][/size][/center][/size]",
  "categoryId": "97",
  "version": "1.0",
  "author": "Delicious Vegetable",
  "createdUnix": "1533129816",
  "updatedUnix": "1533129816",
  "containsAdultContent": false,
  "uploadedBy": "napoleonofthestump",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000278649",
      "name": "RevoLUTion v1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "234",
      "fileName": "RevoLUTion v1.0-92833-1-0.7z",
      "uploadedUnix": "1533128583",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ecedbee0d86a9756965f71ace3a8c53215270e2e4176eb2ab5c2658fb986dfed/analysis/1533128703/",
      "changelogHtml": " 1.0 - Initial release. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RevoLUTion%20v1.0-92833-1-0.7z?fid=1000278649&ttl=1535883972&ri=8192&rs=8192&setec=574b98b79ed11ffa6ada133fb81250d3"
    }
  ]
}