{
  "modId": 92848.0,
  "modName": "Caballos de Ciudades",
  "summary": "Un pequeño Mod que modifica las estadísticas de los caballos comprables y los únicos según el clima y sector donde se compren del juego para elevar su importancia dentro del juego",
  "descriptionHtml": "Hola a todos, como gran fan de este juego descubri como crear mis propios Mods hace muy poco y he practicado a ensayo y error sin ningun tipo de ayuda o conocimiento, así que cree este Mod para uso personal pero no esta de mas compartirlo en esta mi querida comunidad. \n<br />\n<br />Este Mod es muy simple, mejora las estadísticas de todos los caballos comprables dentro del juego, PERO, es solo eso? así de simple? eso no tiene gracia, pues no, estas modificaciones están hechas con la intención de darles un poco mas de identidad a los caballos, por eso, basándome en el clima y las condiciones de la fauna que rodea a cada ciudad se han incorporado las modificaciones, es decir, una zona tan relativamente pacifica y rodeada solo de animales como lobos y un espacio de llanura plana permitirá como lo es Carrera Blanca hara que sus caballos sean mas rápidos pero no tengan mucha resistencia. Mientras el frio clima y peligros de Ventalla hará que sus caballos sean mas fuertes y resistentes. \n<br />\n<br />dentro del mod se incluye un Archivo de lectura que explica a detalle las mejoras que tiene cada caballo según donde lo compres, cabe aclarar que caballos como Escarcha y Sombra al ser caballos Únicos deben mantener su identidad de ser caballos mucho mejores que los que puedas comprar, así que estos también fueron modificados por encima de los demás (los caballos salvajes se mantienen sin cambio)",
  "categoryId": "101",
  "version": "1.0",
  "author": "Zucks",
  "createdUnix": "1533180663",
  "updatedUnix": "1533180663",
  "containsAdultContent": false,
  "uploadedBy": "zuckspro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000278679",
      "name": "Caballos en Ciudades",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Caballos en Ciudades-92848-1-0.rar",
      "uploadedUnix": "1533180577",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/30fbc8cc73136d0a3a2fad547f3526d06db45429684124772cb335629fff1ad4/analysis/1533180662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Caballos%20en%20Ciudades-92848-1-0.rar?fid=1000278679&ttl=1535883990&ri=8192&rs=8192&setec=9fa3f59cd185d07ec289cb0d8478c20d"
    }
  ]
}