{
  "modId": 92858.0,
  "modName": "Panoramic Screenshot Technique",
  "summary": "This article goes through technique I uses in creating screenshots, with panoramic capturing method.<br />There is a misunderstanding that stitching panoramic images is a painful process; no, it isn't with the right tools.<br />This isn't a mod recommendation to make your game beautiful, but ENB modification is included in the file section.",
  "descriptionHtml": "This article goes through technique I uses in creating screenshots, with panoramic capturing method. Including uses of various animation mods, console commands, cropping &amp; post processing. I do not claims to be a photographer nor any type of pro; this is simply how I do things.\n<br />There is a misunderstanding that stitching panoramic images is a painful process; no it isn't with the right tools, and don't even need to pay a single cent.\n<br />Panoramic capture method is NOT limited to scenery only, in fact it can be abused for any situation.\n<br />\n<br />This isn't a mod recommendation to make your game beautiful, but ENB modification &amp; other things are included in the file section.\n<br />\n<br />[color=#ffff00][size=3][b]Mod Setup[/b][/size][/color]\n<br />There is one mod we should NOT be using when doing a screenshot session - Skyrim Souls Unpause Game Menu. You want to be able to freeze the game at any moment by activating the console (~).\n<br />\n<br />[color=#b6b6b6]Typical mods used are as follow:\n<br />[/color][list]\n<br />[*][color=#b6b6b6][url=https://www.nexusmods.com/skyrim/mods/76744]OSA Skyrim Ascendancy[/url]﻿, this will makes navigating poser mods easier[/color]\n<br />[*][color=#b6b6b6][url=https://www.loverslab.com/files/file/3086-poser-module-for-osa-skyrim-ascendancy-engine/]Poser Module[/url]﻿, integrate various poser mods into OSA menu interface[/color]\n<br />[*][color=#b6b6b6]poser mods supported by Poser Module, such as Halo's Poser, Pinup Poser, Fuwa's Poser, Pretty Motion Collection, etc.[/color]\n<br />[*][color=#b6b6b6][url=http://mergaskittle.blog.fc2.com/blog-entry-5.html]Facial Expression Project[/url]﻿, allows to set expression for player &amp; NPC[/color]\n<br />[*][color=#b6b6b6][url=https://www.nexusmods.com/skyrim/mods/52583/]Jaxonz Positioner[/url]﻿, or [url=https://www.nexusmods.com/skyrim/mods/74768]Cobb Positioner[/url]﻿, allows moving objects including items can't normally be moved with console command[/color]\n<br />[*][color=#b6b6b6][url=https://www.nexusmods.com/skyrim/mods/64905]Add Item Menu[/url]﻿, allows easier modded item search[/color]\n<br />[*][color=#b6b6b6][url=https://www.nexusmods.com/skyrim/mods/12933/]Extensible Follower Framework[/url]﻿, allows easier NPC item swapping, can be done even if AI is frozen[/color]\n<br />[*][color=#b6b6b6][url=https://www.nexusmods.com/skyrim/mods/40706/]OneTweak[/url]﻿, makes game support borderless-window. ENB also have such functionality but kinda wonky[/color]\n<br />[*][color=#b6b6b6][url=https://www.nexusmods.com/skyrim/mods/68496/]Vivid Snow Real Skyrim Snowflakes[/url]﻿, real particle snow instead of just screen overlay[/color]\n<br />[/list]\n<br />Why we need particle snow? In vanilla snow, if you go into free camera mode, the snow just sticks on your screen without moving away. As shown in the following video. Vanilla particle setting is too low to get consistant snow effect, so we need to raise the following [color=#00ff00][Particles] iMaxDesired=4000[/color] setting in SkyrimPref.ini. But don't overdo it, else game might crash due to too much particle.\n<br />﻿\n<br />[youtube]tvoyEhtofp8[/youtube]\n<br />[i][color=#b6b6b6]Vivid Snow showcase by Hodilton[/color][/i]\n<br />\n<br />[b][color=#ffff00][size=3]Field of View[/size][/color][/b]\n<br />Often people capture shots with high FoV well over 60. I personally don't go this way, as this will produce unnatural object distortion along screen edge, especially if you're playing ultra-wide resolution, even 60 starts to produce that problem. When capturing scenery, lowering FoV to 40~50 will be ideal.\n<br />\n<br />The effect of lowering FoV, aside from avoiding unnatural distortion, also brings distance object closer to camera - making them looks bigger than usual. This is especially great for shots involving characters, making the sense of scale more \"proper\", reducing amount of unwanted background clutter. FoV of 20~35 is usually ideal for character shots.\n<br />\n<br />Of course, [color=#00ff00]this ISN'T a hard rule[/color]; but just a preference depending on the situation. In sample below, the only camera movement here is forward &amp; backward to zoom into same character height on screen for both FoV.\n<br />\n<br />[img]https://1.bp.blogspot.com/-kI7-XGB09ao/W2HwltYbG0I/AAAAAAAAJRg/w7O7VS1d5WMvQIT_XBKxbJvEsMSQI5vpwCLcBGAs/s1600/2018.08.02-01.36.jpg[/img]\n<br />[i][color=#b6b6b6]FoV Comparison[/color][/i]\n<br />\n<br />[b][color=#ffff00][size=3]Console Commands[/size][/color][/b]\n<br />Understanding various console commands aside from just free-camera allows further control of the scene, or just adjust things normally you wouldn't be able to. Console commands are NOT case sensitive. \n<br />\n<br />[color=#b6b6b6]Commonly used commands as follow:[/color]\n<br />[list]\n<br />[*][color=#b6b6b6]TFC, toggle free camera, but not freezing the game[/color]\n<br />[*][color=#b6b6b6]TFC 1, toggle free camera, and freeze the game[/color]\n<br />[*][color=#b6b6b6]TCL, toggle clipping allow you to walk on air or trough objects. This command only works when no object is selected in console[/color]\n<br />[*][color=#b6b6b6]TGM, god mode[/color]\n<br />[*][color=#b6b6b6]TG, toggle grass, for performance reason if needed[/color]\n<br />[*][color=#b6b6b6]TT, toggle tree[/color]\n<br />[*][color=#b6b6b6]TM, toggle menu (interface) on/off[/color]\n<br />[*][color=#b6b6b6]TAI, freeze all AI, or freeze only selected target[/color]\n<br />[*][color=#b6b6b6]TC, toggle control, allows player control on NPC[/color]\n<br />[*][color=#b6b6b6]SUCSM &lt;#&gt;, change speed of free camera, default is 10. Lower = slower.[/color]\n<br />[*][color=#b6b6b6]SETSCALE &lt;#&gt;, change object or NPC scale, default is 1.0[/color]\n<br />[*][color=#b6b6b6]SET GAMEHOUR TO &lt;#&gt;, change game time, game must not be frozen to take effect. Time is in 24-hour format[/color]\n<br />[*][color=#b6b6b6]FW &lt;#&gt;, force a specific weather type, look up the [url=http://elderscrolls.wikia.com/wiki/Console_Commands_(Skyrim)/Weather]weather code in Wiki[/url]﻿. Modded weather may not works with this command[/color]\n<br />[*][color=#b6b6b6]FOV &lt;#&gt;, change field of view[/color]\n<br />[*][color=#b6b6b6]MFG RESET, reset target facial expression[/color]\n<br />[*][color=#b6b6b6]DISABLE, disable an object or NPC to become hidden[/color]\n<br />[*][color=#b6b6b6]ENABLE, enable an object or NPC to become visible[/color]\n<br />[*][color=#b6b6b6]UNLOCK, unlock chest or door[/color]\n<br />[*][color=#b6b6b6]GETPOS X / GETPOS Y / GETPOS Z, get current object position, Z is vertical[/color]\n<br />[*][color=#b6b6b6]SETPOS X &lt;#&gt; / SETPOS Y &lt;#&gt; / SETPOS Z &lt;#&gt;, set object new position[/color]\n<br />[/list][color=#b6b6b6]\n<br />[/color][list]\n<br />[*][color=#b6b6b6]ADDITEM &lt;#&gt; &lt;X&gt;, add item to selected target, &lt;X&gt; is amount[/color]\n<br />[*][color=#b6b6b6]REMOVEITEM &lt;#&gt; &lt;X&gt;, remove item from selected target, &lt;X&gt; is amount[/color]\n<br />[*][color=#b6b6b6]EQUIPITEM &lt;#&gt;, equip item to selected target, item must be added with additem command first[/color]\n<br />[*][color=#b6b6b6]UNEQUIPITEM &lt;#&gt;, unequip an item from target[/color]\n<br />[*][color=#b6b6b6]SHOWINVENTORY, show a list of target's inventory items[/color]\n<br />[*][color=#b6b6b6]ADDSPELL &lt;#&gt;, add a spell to target[/color]\n<br />[*][color=#b6b6b6]EQUIPSPELL &lt;#&gt; &lt;left | right&gt;, equip spell to target and specify which hand[/color]\n<br />[*][color=#b6b6b6]CAST &lt;#&gt; &lt;target&gt; &lt;left | right&gt;, target cast a spell. Spell is cast instantly, no casting animation will trigger[/color]\n<br />[*][color=#b6b6b6]PLAYER.PLACEATME &lt;#&gt; &lt;X&gt;, spawn item or NPC at player position, &lt;X&gt; is amount[/color]\n<br />[color=#b6b6b6]\n<br />[/color][*][color=#b6b6b6]KILL, kill a target[/color]\n<br />[/list][list]\n<br />[*][color=#b6b6b6]KILLALL, kill everything in area[/color]\n<br />[*][color=#b6b6b6]RESSURECT 1, ressurect NPC with items intact[/color]\n<br />[*][color=#b6b6b6]RECYCLEACTOR, use this if ressurect didn't work, but will remove all items[/color]\n<br />[*][color=#b6b6b6]SETUNCONSCIOUS &lt;#&gt;, set target unconscious, either 0 or 1[/color]\n<br />[*][color=#b6b6b6]MOVETO PLAYER, move target to player position[/color]\n<br />[*][color=#b6b6b6]QQQ, instant quit game[/color]\n<br />[/list]\n<br />While there are console command to adjust object angle, such as GETANGLE X &amp; SETANGLE X, they often don't works at all. It is best to adjust object angle trough the uses of Jaxonz Positioner or Cobb Positioner mod. Angle only applies to static object, and not NPC.\n<br />\n<br />Sometime, it is just a little hard to select the exact object or NPC on console due to other things, such as special effects obstructing your cursor. Simply scroll the mousewheel to change between different selections, the object or NPC bound to be in the next few selections. If all else fail, move the free camera really really close to the object you want to select. Using the SUCSM command will allows changing of the camera speed, making precise movement easier.\n<br />\n<br />Special effects including burning fire &amp; spells, can be selected on console, as well as resizing and moving them around. Eg: resize a magelight 10 times the size.\n<br />\n<br />[b][color=#ffff00][size=3]Before We Begin...[/size][/color][/b]\n<br />[img]https://i.imgur.com/CYtHvX9.jpg[/img]\n<br />[i][color=#b6b6b6]Image Source: [url=https://www.quora.com/How-does-panoramic-photography-work]https://www.quora.com/How-does-panoramic-photography-work[/url][/color][/i]\n<br />\n<br />[color=#00ff00]Understand that your game resolution DOESN'T matter[/color], as long as it isn't Nokia 3310 type of resolution... By utilizing panorama capturing method, we can create huge final result even with just regular 1080p gameplay resolution. What does matter is a good ENB, proper anti-aliasing, use Temporal-AA if need to, and Lumasharpen to regain visual sharpness. Lumasharpen can be set trough ENBEffect shader if the preset author provided that option. Otherwise it can be done through SweetFX (Skyrim:LE) or ReShade (Skyrim:SE). We also need a good ENB DoF shader. [url=https://www.nexusmods.com/skyrim/mods/89671]Marty McFly's DoF[/url] is possibly the most popular, as it is light weight and provide great subject focus, without causing \"halo\" problem despite intense background blurring.[color=#b6b6b6] (halo = edge glowing around subject)[/color]\n<br />\n<br />We will need image editing software with the following basic functions:\n<br />[list]\n<br />[*][color=#b6b6b6]free rotation to any angle[/color]\n<br />[*][color=#b6b6b6]crop to specific resolution &amp; aspect ratio for consistency[/color]\n<br />[*][color=#b6b6b6]show rule-of-third gridline[/color]\n<br />[*][color=#b6b6b6]ability to add vignette effect[/color]\n<br />[/list]\n<br />[color=#00ff00]The MOST important software[/color] however, is [color=#ffff00][size=3][url=https://www.microsoft.com/en-us/research/product/computational-photography-applications/image-composite-editor/]Microsoft Image Composite Editor (ICE)[/url][/size][/color]. This is among the best picture stitching tool available, absolutely FREE, a million time faster than Adobe's solution &amp; easy to uses. Since we will be using, or rather - abusing, panomara capturing method; this tool is mandatory.\n<br />\n<br />[img]https://2.bp.blogspot.com/-DHyYD702XuA/W2HzafGG49I/AAAAAAAAJRs/SHz1o_iQikwA1nc9ZnBwETQ2xm0cGL4EwCLcBGAs/s1600/Untitled.png[/img]\n<br />[i][color=#b6b6b6]Microsoft ICE Interface[/color][/i]\n<br />\n<br />A screenshot tool that is fast and consistant is also required, as we will capture multiple shots rapidly. Capturing through GPU's driver functionality such as AMD's ReLive is fast, not miss a shot, and don't result in corrupted files. [color=#b6b6b6](I do not have experience with nVidia ShadowPlay).[/color]\n<br />\n<br />[b][color=#ffff00][size=3]Shooting &amp; Post-Process[/size][/color][/b]\n<br />Let's start making a sample shot with scenery, since this is the easiest type of shot. However easy it is, producing good result is still HARD - skills &amp; imaginations [color=#b6b6b6](which I am short of)[/color] are still required to create some truly spectacular shots. Knowledge of adjusting ENB weather system is added plus - allowing more controls over various aspects, including lighting, sky tint, cloud density, fog, etc.\n<br />\n<br />Since we might be capturing really large area, UGrid of at least 7 will be recommended.\n<br />[color=#b6b6b6]Changing UGrid will not harm your game, using the \"UgridsToLoad\" mod will... Mind that differences.[/color]\n<br />\n<br />[color=#ff7700][b]Step 1:[/b][/color] use an ENB suitable for scenery, such as [url=http://skycitizen.cn/?post=1320]DAHAKA[/url], or whichever you see fit. Find a good scene. A very typical mistake that even I do all the time is, placing your character behind the camera. Why is this a mistake? Understand that cell loading is tied to your character position, not movement of free camera:\n<br />[url=https://1.bp.blogspot.com/-WCxfWDUZ8fI/W2Hig9K06MI/AAAAAAAAJRU/y3J0CVyCODkOK5dAy73K1C2MOHgv0FMPQCLcBGAs/s1600/tuscany-2.jpg]\n<br />[img width=640,height=182]https://1.bp.blogspot.com/-WCxfWDUZ8fI/W2Hig9K06MI/AAAAAAAAJRU/y3J0CVyCODkOK5dAy73K1C2MOHgv0FMPQCLcBGAs/s640/tuscany-2.jpg[/img][/url]﻿\n<br />[color=#b6b6b6][i]Simple UGrid illustration[/i][/color]\n<br />\n<br />[b][color=#ff7700]Step 2:[/color][/b] set a slightly lower FoV and decide on best camera spot.\n<br />Remember that not everything need to fit into your screen resolution. Pan your camera around to roughly decide what portion of the scenery you want to be in the final result - from left to right, and top to bottom. If some undesired objects are getting in the way, deal with them - remove, resize, do whatever it takes to makes the scene better.\n<br />\n<br />[color=#ff7700][b]Step 3:[/b][/color] rapidly capture multiple shots at different camera panning angle in sequence. Start whenever you like, I usually starts from either lower left or lower right, working my way up. Each shot need to overlap each other by a good amount, so the stitching software can easily guess how these pictures should be aligned. Capture as many as you need. It is good to capture additional extra areas outside of the wanted subject, so you have more rooms to crop later on.\n<br />\n<br />[youtube]QCbSr9zOm2o[/youtube]\n<br />[i][color=#b6b6b6]Capturing process demo, there is audio cue whenever screen capture key is pressed.[/color][/i]\n<br />\n<br />[url=https://4.bp.blogspot.com/-1eFUTQhMHzY/W2F4s2_uRQI/AAAAAAAAJRI/SqaSwPRnMXM4XyDOusUzvzyYdLiM2BTnACLcBGAs/s1600/Untitled1.jpg][img width=640,height=232]https://4.bp.blogspot.com/-1eFUTQhMHzY/W2F4s2_uRQI/AAAAAAAAJRI/SqaSwPRnMXM4XyDOusUzvzyYdLiM2BTnACLcBGAs/s640/Untitled1.jpg[/img][/url]\n<br />[color=#b6b6b6][i]Sample of overlaying shots[/i][/color]\n<br />\n<br />[b][color=#ff7700]Step 4:[/color][/b] launch Microsoft ICE, select all the individual shots for stitching process. If your ENB uses [adaptation], you might notice there are brightness differences when you pan your camera around, just like the picture above shown. ICE is able to deal with this differences, as long as it isn't too extreme.\n<br />\n<br />ICE workflow consist of 4 simple stages as shown on it's header - import, stitch, crop, and export.\n<br />[b][color=#ff00ff]IMPORT[/color][/b]\n<br />Simply add all individual shots. Just leave the camera motion as auto detect or select \"rotating motion\". Click next and wait for it to calculate. If every shot overlap good enough, there shouldn't be any problem for the software to recognize the scene.\n<br />[b][color=#ff00ff]STITCH[/color][/b]\n<br />This is a stage where you can decide on what type of \"projection\" you want. If you capture enough shots to form a 360° view, it is basically a full-sphere and can be panned / navigated seamlessly.\n<br />Simply select differrent projections to find the one best suited for your scene. Click on the viewport to pan the view up-down, left-right, or make rotation for further adjustments if required. When satisfy, click next to proceed.\n<br />[b][color=#ff00ff]CROP[/color][/b]\n<br />Skip, just click next. It is best to do cropping with other picture editor with more controls available.\n<br />[b][color=#ff00ff]EXPORT[/color][/b]\n<br />Simply export as PNG format for best file size vs quality ratio. Alpha is not needed.\n<br />\n<br />[youtube]eX2kxp-n81o[/youtube]\n<br />[i][color=#b6b6b6]Stitching &amp; post-process[/color][/i]\n<br />\n<br />[b][color=#ff7700]Step 5:[/color][/b] cropping &amp; post process\n<br />In this example above, a free image editing tool, Polarr is used - which can be acquired on Windows Store. [url=https://www.polarr.co/windows/0]https://www.polarr.co/windows/0[/url]\n<br />This editor includes most of the essential things we need : rotate &amp; crop, vignette, rule-of-third grid, and a lot of adjustments if needed. However there is no tools available to do minor touch up, as sometime minor glitches can appear as a result of bad stitching - this is where tools like Photoshop can be helpful to fix. Such as the situation below, a patch of mountain is missing.\n<br />\n<br />[url=https://3.bp.blogspot.com/-1AaOj9lTuCY/W2Fv5nRGGCI/AAAAAAAAJQ0/ojivLKzRPD0dXIkbyHpT8jLusUDt9uL_QCLcBGAs/s1600/glitch.jpg][img width=640,height=194]https://3.bp.blogspot.com/-1AaOj9lTuCY/W2Fv5nRGGCI/AAAAAAAAJQ0/ojivLKzRPD0dXIkbyHpT8jLusUDt9uL_QCLcBGAs/s640/glitch.jpg[/img][/url]﻿\n<br />[img]https://1.bp.blogspot.com/-qiPruGwWRjs/W2Fv-GFs90I/AAAAAAAAJQ4/Hpp59czuwB0cCZFw11MQzVA0AEzwKsguwCLcBGAs/s1600/20180801-1545_stitch.jpg[/img]\n<br />[i][color=#b6b6b6]Final result, [url=https://www.flickr.com/photos/147399796@N06/41977617580/in/dateposted-public/]full size link[/url].[/color][/i]\n<br />\n<br />[b][color=#ffff00][size=3]Aspect Ratio &amp; Common Tips[/size][/color][/b]\n<br />There is no rule about this; just preferences. In most cases I uses the following:\n<br />[list]\n<br />[*][color=#b6b6b6]super ultrawide 32:9 : 7680x2160 or 3840x1080 or 2560x720[/color]\n<br />[*][color=#b6b6b6]ultrawide variable ratio : 3840x1440 or 2560 x 1080[/color]\n<br />[*][color=#b6b6b6]square 1:1[/color]\n<br />[*][color=#b6b6b6]portrait 9:16 : 1440x2560 or 1080x1920[/color]\n<br />[/list]\n<br />I will avoid 16:9 ratio (normal screen size) as much as possible. The reasoning is that we want to produce a result that gives different visual experience, rather than the typical screen ratio you see all the time. \n<br />\n<br />The higher the stitched resolution, the better.\n<br />Aside from giving more freedom in cropping, downsizing to final size also makes the result a lot more clear and crips.\n<br />While 1080p is mostly fine to work with, 1440p will definitely gives you more flexibility if system able to handle it.\n<br />Higher resolution display output that is more than your monitor native resolution, can be forced through GPU driver - AMD Virtual Super Resolution, or nVidia Dynamic Super Resolution.\n<br />\n<br />[color=#00ff00]Rule-of-third[/color] is simply a common / typical photograph trick to helps positioning subject in your shot. Sort of like simplified version of the Golden Ratio. Positioning significant subject at 1/3 or 2/3 position. Of course this isn't a mandatory rule and can't apply to all situations, it just \"good to have\" whenever in doubt.\n<br />\n<br />[img]https://4.bp.blogspot.com/-NGuKzhgZOKQ/W2KpXLRleTI/AAAAAAAAJSQ/zEbwGEuo6l8sGQWC1PCJA4E-Psdj10WzwCLcBGAs/s1600/2018.08.02-02.05.jpg[/img]\n<br />[color=#b6b6b6][i]Rule-of-third illustration[/i][/color]\n<br />\n<br />Another typical tricks of scenery photography is keeping the vertical and horizon straight. Horizon is easy enough, make sure the land or skyline is flat; vertical can take reference from objects that are supposedly standing straight up, such as trees and buildings. Again this isn't a mandatory rule and can't apply to all situation.\n<br />\n<br />[b][color=#ffff00][size=3]Character Shot[/size][/color][/b]\n<br />Character shot is slightly more tricky. A lot of things can go wrong, plan didn't works out as you'd imagined, forgot to install certain item mods and forced to restart, NPC didn't behave, item clipping, bad item texture for close-up, weird body part behavior, or game just don't like what you're doing and decide to crash. \n<br />\n<br />There are several things to take note about character poses:\n<br />\n<br />[list]\n<br />[*][color=#b6b6b6]try not to use your own character if possible unless it is a very simple shot. You will see why in few points below.[/color]\n<br />[*][color=#b6b6b6]character cannot change facial expression and poses while the AI or game is frozen. So ensuring you got the right pose is important before starting the shot. This is especially critical when it comes to facial expression for combat scene - set the expression before you even find the best pose. Expression won't go away or reset even if character talks.[/color]\n<br />[*][color=#b6b6b6]understand that NPC head movement follows the player. Not all poses from poser mods have fixed head position, so you can tweak their head position by simply moving yourself around. If you want them to look up, make yourself bigger or use no-clip mode. If you want them to look down, just do the opposite.[/color]\n<br />[*][color=#b6b6b6]sometime environment lighting is simply not good enough to focus onto your character. This is where you can use your character as lighting assistant, carrying torch or lantern and move around until you find a good spot. While you can do this with NPC, it just takes a bit more work.[/color]\n<br />[*][color=#b6b6b6]it is far easier to swap character item trough the use of follower mod such as EFF, rather than typing console command. Approach the character in question, even if their AI is frozen, force recruit with EFF MCM then swap whatever item you need trough the inventory interface.[/color]\n<br />[*][color=#b6b6b6]understand that outfit or hair physic is frozen when a character AI is frozen. Physic effect will gives the shot more approprait motion and dynamic. However, swapping out these HDT items will reset the physic position to default, so make sure to have the right item equipped before deciding on physic effect.[/color]\n<br />[*][color=#b6b6b6]know that changing items will remove blood stains.[/color]\n<br />[*][color=#b6b6b6]understand that final composition doesn't need to be \"straight\", especially for action scene - rotating the picture might result in a more dramatic result.[/color]\n<br />[*][color=#b6b6b6]don't be afraid of lowering the camera all the way to the ground, or placing at any other position that isn't eye-level[/color]\n<br />[/list][b][color=#ffff00][size=3]\n<br />Manual Focus[/size][/color][/b]\n<br />You don't want to use Auto Focus when doing character shot while panning camera around, as the point of focus moves around when capturing with panorama method, even goes offscreen.\n<br />\n<br />[img]https://4.bp.blogspot.com/-MbLAxqb5OV0/W2IDVN1fjzI/AAAAAAAAJSE/ym6BCrKn0EwRw-TBtFzwQW4MGNB9MqbhgCLcBGAs/s1600/2018.08.02-01.49_05.jpg[/img]\n<br />[i][color=#b6b6b6]Manual Focus ENB Adjustment[/color][/i]\n<br />\n<br />The example above uses Marty McFly's bokeh DoF. Other solution such as from Kingeric's is similar, just slight differences in option naming.\n<br />\n<br />[list]\n<br />[*][color=#b6b6b6]Manual focus depth, smaller number means focus to object closer to camera, larger for further[/color]\n<br />[*][color=#b6b6b6]Near blur curve, is blurring between the focused subject and camera position. Usually this isn't working so well if distance from camera to focused subject is very short; so this is mostly best for scenery.[/color]\n<br />[*][color=#b6b6b6]Far blur curve, blur the background, smaller number is more intense.[/color]\n<br />[*][color=#b6b6b6]Hyperfocal depth distance, usually keep as 1.0. [/color][color=#8e7cc3]Adjusting this to around the same as Manual focus depth to FORCE subject &amp; background focus, while enabling blurring of forground objects between camera and focused subject through Near Blur Curve, WHILE the distance from camera position to focused subject is very close. [/color]\n<br />[/list]\n<br />Sample shot of using low \"Near blur curve\" value to blur out object near to camera - in this case, the grasses:\n<br />[url=https://www.nexusmods.com/skyrim/images/708099]https://www.nexusmods.com/skyrim/images/708099[/url]\n<br />\n<br />Detailed adjustment explanations can be found on [url=https://www.nexusmods.com/skyrim/mods/89671]McFly's own mod page[/url].\n<br />The following demonstrate a sample stagging process for capturing, and post-process:\n<br />\n<br />[youtube]gRtLLmcn02w[/youtube]\n<br />[i][color=#b6b6b6]Scane staging and capturing process, yes I know it's kinda funny when trying to find a good pose.[/color][/i]\n<br />\n<br />[youtube]Wn3iIdlpOG0[/youtube]\n<br />[i][color=#b6b6b6]Stitching and post-process.[/color][/i]\n<br />\n<br />[i][color=#b6b6b6]// end of article ---------------------------------------------------------------------------------------------------------------------------------------\n<br />[/color][/i][i][color=#b6b6b6]// -----------------------------------------------------------------------------------------------------------------------------------------------------------[/color][/i]\n<br />\n<br />My terrible screenshot collection: [url=https://www.flickr.com/photos/147399796@N06/]https://www.flickr.com/photos/147399796@N06/[/url]﻿\n<br />My terrible messy mod list: [url=https://docs.google.com/spreadsheets/d/1Nkjyn4SvEqyNOnHxRF7z-KDdN5wF5CR2-5nxdPK87Gk/edit#gid=1498421305]https://docs.google.com/spreadsheets/d/1Nkjyn4SvEqyNOnHxRF7z-KDdN5wF5CR2-5nxdPK87Gk/edit#gid=1498421305\n<br />\n<br />[img]https://farm2.staticflickr.com/1838/42856812955_64fe610853_k_d.jpg[/img]\n<br />[img]https://farm1.staticflickr.com/897/26655044177_a21d51758d_k_d.jpg[/img][/url]",
  "categoryId": "82",
  "version": "1.0",
  "author": "MasterNanashi",
  "createdUnix": "1533242528",
  "updatedUnix": "1533250113",
  "containsAdultContent": false,
  "uploadedBy": "xonedl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000278712",
      "name": "CR-ENB version 272 Modification",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "69",
      "fileName": "CR-ENB version 272 Modification-92858-1-0.7z",
      "uploadedUnix": "1533240673",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e20e5781edad0672c6c7a149d5218a321ed65c4452ccda074cb0d9c475dd143c/analysis/1533240843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CR-ENB%20version%20272%20Modification-92858-1-0.7z?fid=1000278712&ttl=1535884007&ri=8192&rs=8192&setec=31529e4a696731d1a293eb36b6d8f9a3"
    },
    {
      "fileId": "1000278713",
      "name": "ELFX Light Adjustment - Red Color Tone",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1546",
      "fileName": "ELFX Light Adjustment - Red Color Tone-92858-1-0.7z",
      "uploadedUnix": "1533240850",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a5abef278ab9917407b49e650ea2fbdc0d039849bd13a3849515ec4863b4e57d/analysis/1533241028/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ELFX%20Light%20Adjustment%20-%20Red%20Color%20Tone-92858-1-0.7z?fid=1000278713&ttl=1535884008&ri=8192&rs=8192&setec=979b21ce5306ec8f15fcfdde1cc9dae6"
    },
    {
      "fileId": "1000278719",
      "name": "Wearable Lantern Adjustment - Red and Less Intense Light",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "13",
      "fileName": "Wearable Lantern Adjustment - Red and Less Intense Light-92858-1-0.7z",
      "uploadedUnix": "1533247292",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/772e8321681501b7266fa0a59ca251d77c467072683ba9b4148cb3f0bf7cb0e2/analysis/1533247443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wearable%20Lantern%20Adjustment%20-%20Red%20and%20Less%20Intense%20Light-92858-1-0.7z?fid=1000278719&ttl=1535884008&ri=8192&rs=8192&setec=26302a73b9b767416d47849f2395f6fb"
    },
    {
      "fileId": "1000278720",
      "name": "Lantern of Skyrim - Red and Far Less Intense Light",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "287",
      "fileName": "Lantern of Skyrim - Red and Far Less Intense Light-92858-1-0.7z",
      "uploadedUnix": "1533247336",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/edf6ded65c84cfe4c0b3465b8c2141d87cd992b22a5c8542da28747056d88817/analysis/1533247444/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lantern%20of%20Skyrim%20-%20Red%20and%20Far%20Less%20Intense%20Light-92858-1-0.7z?fid=1000278720&ttl=1535884009&ri=8192&rs=8192&setec=7faff8d16b765a74ccca347e9eac4c64"
    },
    {
      "fileId": "1000278722",
      "name": "QIRE ENB v0.7 Modification",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "938",
      "fileName": "QIRE ENB v0.7 Modification-92858-1-0.7z",
      "uploadedUnix": "1533250113",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a271008f9e5bb43d4a50e8972fbb6100246d2e8e150c52dec6387e475648fb7a/analysis/1533250206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/QIRE%20ENB%20v0.7%20Modification-92858-1-0.7z?fid=1000278722&ttl=1535884009&ri=8192&rs=8192&setec=0b2d4694b1626d60ffeffeffb3d7f65d"
    }
  ]
}