{
  "modId": 92937.0,
  "modName": "Remastered Relics for Relics Of Hyrule (Legendary Edition)",
  "summary": ": A Mod and a standalone Project dedicated to Relics of Hyrule in which Revamp, Remaster and gives life to many of known Zelda items' Textures found in Relics of Hyrule Mod.",
  "descriptionHtml": "[font=Trebuchet MS]: Relics of Hyrule has been a long date mod for me since I started my first playthrought on Skyrim and its goal fitted very well with Skyrim's World. But by the time I felt some contents.... quite death, specially the Relics itself, the items from Zelda lore such as the True Master Swords, Goddess Shield, the Hylian Armours, The Mirror Shields and etc.\n<br />\n<br />Then just this year I started this little project which Revamps many of these known Relics from ROH, under JKalenad's permission.\n<br />\n<br />\n<br />[b][size=4]- What's the Mod's goal?\n<br />\n<br />[/size][/b]: Many Zelda items, especially their textures, from ROH were designed to fit with Skyrim's realism and the mod's concept itself, however I noticed by the time that some of them don't matched very well with the official artwork and concepts from Zelda universe (even for the mod), also when you upgrade some to a new form like the Master Sword and Goddess Shield, they still have a worn out look even in their true forms. All started with the True Master Swords, though their meshes were fine, I never felt their textures fitting well to their True Form concept, this was the same for all Hylian Heavy Armours variations which they were just copied meshes from Skyrim's Blades Armour and with very few textures differences. After that I decided make a treatment and remade these textures from zero following an art style from Zelda universe especially the concepts used from Zelda Skyward Sword, Twilight Princess and Ocarina of Time, the ending result was satisfactory for me and then, other relics also received the treatment. \n<br />\n<br />Obviously that this mod also isn't perfect, during some of the revamp process I faced some issues and limitations from meshes used for the relics more Cube and UV Mapping related. An example I could give is the Gilded sword. The entire sword I redone under the Majora's Mask's Nintendo 64 design but since the sword uses entirely mixed Meshes from vanilla Skyrim such as the hilt from the Glass weapons and the blade from the Dwarven Sword, I had to readapt this texture into the Meshes and trying to look close as possible to the original artwork this also including UV Maps and Cube map , the result wasn't 100% but at least have the Zelda Feeling inside. Another case was the Mirror Shield of the Well, since its original Mesh don't use a cube map, I wasn't able to work on a polished surface, this was the same for the Golden Mirror Shield.\n<br />\n<br />\n<br />[size=4][b]- What the Mod will do?\n<br />\n<br />[/b][/size]: Just a Texture Replacement, no edited or extra meshes, scripts and etc.\n<br />\n<br />\n<br />[/font][size=4][b]- How to install?\n<br />\n<br />[/b][/size]1) Firstly I highly recommend you make a backup of your [b]Texture [/b]folder just in case you don't liked the revamped ones.\n<br />2) Have installed [url=https://www.nexusmods.com/skyrim/mods/40615?tab=files]Relics Of Hyrule (Legendary Edition)[/url], V 6.5.15 or above.\n<br />3) Download the .zip file, open, and inside there, will have a folder named [b]\"Data\"[/b].\n<br />4) Just drag and drop inside the folder where you have installed your Skyrim.\n<br />5) You'll be asked if you wish to replace around 343 files.\n<br />6) Click [b]\"Yes\"[/b] and its done.\n<br />\n<br />\n<br />[size=4][b]- Which relics were Revamped?\n<br />\n<br />[/b][/size]1) Master Sword (in weathered condition, inspired from Breath of the Wild)\n<br />2) Awakened Master Sword (in Twilight Princess style)\n<br />3) Corrupt Master Sword (a mix of concepts from Dark Link's sword)\n<br />4) True Master Sword (In Ocarina of Time style)\n<br />5) True Master Sword (from A Link to the Past)\n<br />6) Deep Corrupt Master Sword (following Demise's sword design)\n<br />7) Fierce deity's Sword\n<br />8) Tempered Sword (following the original A Link to the Past concept art)\n<br />9) Golden Sword (now a true Golden Sword with better cube map)\n<br />10) Noble Swords (more mapping and colour adjustments)\n<br />11) Sword of The Sages (just a small mapping adjustment)\n<br />12) Goddess Sword (detail implementation and more vivid colours)\n<br />13) Goddess Long Sword (the same)\n<br />14) Goddess White/True Swords (the same)\n<br />15) Magic Sword (worked the blade to look like a real polished crystal)\n<br />16) Lokomo sword (for now just a HD scabbard with unique colours following a concept from Hyrule Warrios and better environment map)\n<br />17) Kokiri Sword (just a polish to the blade and better cube map to make it shine)\n<br />18) Phantom Sword (Added a missing ornament from the original design on the blade and better cube map)\n<br />19) Biggoron Sword (more polished and shiny blade and colour replacement, following the concept of Ocarina of Time 3D)\n<br />20) Golden Gauntlets (reworked gloves to fit with the Hero's Gauntlets and polished surface)\n<br />21) Platinum Gauntlets (the same)\n<br />22) Magic Armour (following the concepts of Twilight Princess's Magic armour, removed Nordic styled Carvings added ornaments in Zelda Style)\n<br />23) All Hylian Heavy Armours (removed many Blade's Armour's characteristics and added an unique texture to each of them)\n<br />24) Wind Waker (added some cracking details and not much visible, to look like a fragile porcelain instrument)\n<br />25) Mirror Shield of the Dessert (better polished surface)\n<br />26) Mirror Shield of the Great Sea (better polished surface)\n<br />27) Mirror Shield of the Tower (also, better polished surface)\n<br />28) Terminan Shield (Texture reworked from zero following Majora's Mask's concepts)\n<br />29) Clock Shields Day / Night (also textures reworked from zero with better clock carvings)\n<br />30) Kokiri Shield (completely redone following Ocarina of Time artstyle)\n<br />31) Sacred Shield (in a more worn condition)\n<br />32) Divine Shield (all paintings and ornaments redone with the metal parts in  a mid worn condition)\n<br />33) Goddess Shield (completely new and polished, all ornaments and goddess's face redone)\n<br />34) Ordon Shield (UV Map redone)\n<br />35) Fairy Ocarina (worked with friendly wood textures and appropriate colour)\n<br />36) Ocarina of Time (redone from scratch, added some cracklings to looks like a Fragile porcelain instruments, Yet powerful!)\n<br />37) Phantom Hourglass (colour adjustments and better cube map)\n<br />38) Rupees (just cube map adjustments)\n<br />39) Gilded Sword (following Majora's Mask style from Nintendo 64)\n<br />40) Fierce deity's Armour (for now only environment map adjustments)\n<br />\n<br />\n<br />\n<br />[size=4][b]- Hey, Listen!\n<br />\n<br />[/b][/size]: All these textures were worked in 2K resolution, also inside the folder there's also a big list of Skyrim's main cube maps I've worked also in 2K res, due to many of the Relics rely on Skyrim's main Cube maps its possible that one or more other mods get affected by these cube maps in terms of colour and reflection. Removing the cube maps that's included in the package will probably make some relics quite \"ugly\" since they were worked upon these cube maps.\n<br />\n<br />\n<br />[size=4][b]- Frequently asked questions:\n<br />\n<br />[/b][/size]1) Q: Do you plan to launch a package for Special Edition too?\n<br />   A: I have no plans, even if I have a copy of Special Edition.\n<br />\n<br />2) Q: Do you plan revamp more relics futurely?\n<br />  A: Yes, by the time.\n<br />\n<br />3) Q: Why some of the relics you revamped looks quite cartoonish?\n<br />  A: Your viewpoint of realism is different than mine, so there's no the Right Realism here.\n<br />\n<br />4) Q: Will have 1K and 4K Res Textures too?\n<br />  A: I don't plan 1k Res textures as many of the relics were worked in 2K so I gave 2K the standard res for all the others that were in low res. I don't plan in 4K because it'll be performance killer and the small details will be barely noticeable.\n<br />\n<br />5) Q: Help! Some of the relics are invisible or purple and some doesn't changed!\n<br />  A: Try to reinstall or redownload the zip. Also check if your Relics of Hyrule is 6.5.15 or above\n<br />\n<br />6) Q: My textures looks in low res!\n<br />  A: If you're using SKSE go to where you installed your Skyrim and then go Data&#92;SKSE&#92; you'll find a file named \"SKSE.ini\". Open it with Notepad and under [b][Display] [/b]section[b] [/b]search for [b]iTintTextureResolution=XXXX [/b]in which XXXX is the current resolution that SKSE shows your textures resolution, normally it's set to 1024. increase this number by setting[b] 2048 [/b]or [b]4096[/b] at your preference, save and exit.\n<br />\n<br />\n<br />\n<br />[size=4][b]- Uninstalling? :'3[/b]\n<br />\n<br />[/size]: As I said in the installing process, use the Backup you did of your [b]Texture [/b]folder to replace the revamped textures you have installed in the package.\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />I'm also open to opinions and suggestions if you want to share.",
  "categoryId": "62",
  "version": "1.0",
  "author": "cALAMIN",
  "createdUnix": "1533690789",
  "updatedUnix": "1533690789",
  "containsAdultContent": false,
  "uploadedBy": "cALAMIN",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000279103",
      "name": "Remastered Relics",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "472851",
      "fileName": "Remastered Relics-92937-1-0.zip",
      "uploadedUnix": "1533690566",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Remastered%20Relics-92937-1-0.zip?fid=1000279103&ttl=1535884104&ri=8192&rs=8192&setec=6704bd5bddbfff603a361ffd3f9b7867"
    }
  ]
}