{
  "modId": 92970.0,
  "modName": "Unique Female Followers (UFF) Texture Patch",
  "summary": "Fixes a broken texture and cleans/optimizes several others (both high- and especially low-resolution versions).",
  "descriptionHtml": "Unique Female Followers (UFF) Texture Patch\n<br />v1.1, 2018-08-10\n<br />by Darklocq (tweaking the work of Mayatola, and prior texture modders)\n<br />\n<br />This is a repair job done on the high- and low-resolution texture sets for Mayatola's Unique Female Followers mod, including repair of a broken texture, and some optimizations.  MUST INSTALL MANUALLY, on top of either the original high-res mod or the low-res texture pack for it, both at:\n<br />  [url=https://www.nexusmods.com/skyrim/mods/24664?tab=files] https://www.nexusmods.com/skyrim/mods/24664?tab=files[/url]\n<br />\n<br />Only a handful of high-res textures are involved, so I didn't bother with separate archive files for them.\n<br />\n<br />They are for the UFF (Unique Female Followers) mod in particular; don't confuse it with the ADEC followers files available at the same Nexus page.\n<br />\n<br />== Details ==\n<br />\n<br />Texture problems in the original \"All-in-One UFF\" (high-res) and/or \"All-in-One Compressed Texture Pack - requires main file\" archives:\n<br />\n<br />1) There's is a corrupt texture file: textures&#92;mayatola&#92;UFF&#92;armor&#92;obcavewallfire_g.dds\n<br />It is corrupt in both the original high-resolution download and in the compressed-textures pack for UFF (\"All-in-One Compressed Texture Pack - requires main file\").  I can't fix it with the image tools I have (the best I can do is recover some of the data in it, but the red part is shifted far to the right, and the repair attempt doesn't work.  My solution is to just make this mask file blank, which will be boring but at least not broken (you won't get the intended glow effect, but you won't get broken-texture barf, either, and I'll take plain over messed up any day :-).\n<br />\n<br />2) The compressed texture pack missed compressing/reducing various files; e.g. in &#92;textures&#92;actors&#92;character&#92;facegendata&#92;facetint&#92;, there are 4K textures that clock in at about 16MB each, for nothing but trivial makeup effects. Some were incorrectly saved as DTX5 format (huge) despite having no alpha channels. There are some other perhaps unnecessarily large files (for a low-res pack, that is), like several 5MB files in each of the character directories (textures&#92;mayatola&#92;UFF&#92;armor&#92;vyliana&#92;, etc.).   Also a bunch of over-sized eyebrows, hands, etc., including a 5MB tattoo, massive 1.4 MB files for tiny scars, and so on.  No one on a low-end rig needs an eye texture that's good enough for a beach-ball sized eye.  Ha ha.  I cut most of this large stuff to 50% size so it actually fits the \"compressed texture pack\" description.  These fixes are only in the low-res version, since they don't apply to high-res.\n<br />\n<br />3) Several of the facetint masks and face spectral masks and a few other things had a terrible case of \"the jaggies\" from being blown up to huge size from smaller originals. Textures (and other images) just do not work that way!  Some of the lip makeup masks looked like they came from an old 8-bit video game. Heh.  These were easy to repair to an extent with a mild, selective blur filter.  Won't be as good as proper reasonable-resolution makeup masks, but better than what was supplied.  Also, a bunch of the specular/diffusion masks were also blown-up copies of lower-res files (this is pointless, and defeats the anti-aliasing capabilities of the shader). This also affected the high- and low-res files. Saves memory and storage space, too; e.g., two inappropriately blown up files accounted for something like 37MB and have been reduced to a total of a little over 4MB (including in the \"low-resolution\" version (see point no. 2 above - these were among the files that wern't compressed for that pack).\n<br />\n<br />PS: It seems weird to me that the ESP included in the low-res texture pack is markedly smaller than the original.  I'll just trust that this is correct (perhaps as the result of TES5Edit cleaning?) and run with it, but am keeping the original around just in case.\n<br />\n<br />== Installation ==\n<br />\n<br />Pick high- or low-resolution, and drag 'n' drop the textures folder in it to your game's data folder and let it merge, overwriting as needed.  None of these are vanilla files, so have no fears.\n<br />\n<br />Oh, you need to install the original mod first, of course.\n<br />\n<br />Patching your installers: After you're satisfied that the new textures work for you, you can extract the contents of your original \"All-in-One UFF\" (high-res) and \"All-in-One Compressed Texture Pack - requires main file\" archives and copy my updates into them, then re-archive them. This way, if you need to reinstall them for another game, you won't need to keep my patch around and re-apply it. The file modification dates of the low-res versions are set newer than the high-res ones, so Wrye Bash won't have \"anneal\" problems and refuse to overwrite the high-res textures with the low-res ones (which is what you have to do to install the low-res version at all, with or without my texture patches).\n<br />\n<br />== Boilerplate ==\n<br />\n<br />I claim exactly zero rights or credits with regard to this, other than I took some time to use an image editor to reduce somefile sizes, and did really minor (non-creative) graphic work like selective sharpening and blurring to compensate.  All rights remain with the original authors of the mod and the textures it uses from others; see [url=https://www.nexusmods.com/skyrim/mods/24664]https://www.nexusmods.com/skyrim/mods/24664[/url] for credits.",
  "categoryId": "66",
  "version": "1.1",
  "author": "Darklocq - Mayatola - et al",
  "createdUnix": "1533870316",
  "updatedUnix": "1533898161",
  "containsAdultContent": true,
  "uploadedBy": "Darklocq",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000279266",
      "name": "Unique Female Followers (UFF) Texture Patch",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "25686",
      "fileName": "Unique Female Followers (UFF) Texture Patch-92970-1-0.7z",
      "uploadedUnix": "1533868125",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e81dc120c293ba5cb600fbbb8a445fef95d65b1c0635c94fdc27b955da9b2516/analysis/1533868293/",
      "changelogHtml": " 1.0 - Initial version. I don't anticipate there being another. This entire patch could go away, even, if Mayatola merges the fixes into the original mod archives. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unique%20Female%20Followers%20%28UFF%29%20Texture%20Patch-92970-1-0.7z?fid=1000279266&ttl=1535884141&ri=8192&rs=8192&setec=59f2d103f562807f361d09fcc5151a57"
    },
    {
      "fileId": "1000279278",
      "name": "Unique Female Followers (UFF) Texture Patch",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "25968",
      "fileName": "Unique Female Followers (UFF) Texture Patch-92970-1-0.7z",
      "uploadedUnix": "1533869685",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e81dc120c293ba5cb600fbbb8a445fef95d65b1c0635c94fdc27b955da9b2516/analysis/1533869792/",
      "changelogHtml": " 1.0 - Initial version. I don't anticipate there being another. This entire patch could go away, even, if Mayatola merges the fixes into the original mod archives. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unique%20Female%20Followers%20%28UFF%29%20Texture%20Patch-92970-1-0.7z?fid=1000279278&ttl=1535884141&ri=8192&rs=8192&setec=99ab25b505feac39ce48cc30075d2020"
    },
    {
      "fileId": "1000279302",
      "name": "Unique Female Followers (UFF) Texture Patch",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25422",
      "fileName": "Unique Female Followers (UFF) Texture Patch-92970-1-1.7z",
      "uploadedUnix": "1533898161",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6fd36a79d6440c537432d211156876f29a0efde7289cbae045f5cb78dc4f0db1/analysis/1533898410/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unique%20Female%20Followers%20%28UFF%29%20Texture%20Patch-92970-1-1.7z?fid=1000279302&ttl=1535884142&ri=8192&rs=8192&setec=f01dc9c9b3988c2c0749111fb1119a55"
    }
  ]
}