{
  "modId": 93010.0,
  "modName": "Gearhogs Misc Mods and Resources",
  "summary": "Some mods I've been working on, unfinished resources, textures, whatever.",
  "descriptionHtml": "I'm trying to get more organized. I've posted a few misc mods &amp; resources here and there, but I have trouble keeping up with comments and whatnot... So this page will be dedicated to things I've worked on over the years. Once I get my hard drive back from my ex, I'll be able to go through all that too.\n<br />\n<br />For now, this is mostly retextures of resources. I've been getting a little texture happy through my treatment. It helps with disappointment. And since I don't really have a lot of time to actually use most of this, I figured maybe someone else would find it useful. \n<br />\n<br />There's also some skin textures I'll never release. Prototypes to my character overhaul. Things I did for funsies. I am keeping some stuff 'off the market', because it's for sure going to be released. Some of this stuff will be too, but I don't care if other people use it before then.\n<br />\n<br />I like textures a lot. I'm a gloomy kind of gal, so most of this is extremely dark. And most of this is unfinished, so keep that in mind. If there are issues, I apologize. This is mostly resource stuff, so you may need some knowledge of Photoshop &amp; NifSkope.\n<br />\n<br />There are also some models I've sculpted. They're extremely high poly, because I'm a graphics snob. If you can get them to work, kudos to you. I'm horrible with Nif files, and I give up. I can do what I want mostly with textures and resources, so I give you the power [huehue].\n<br />\n<br />I give permission to do whatever you want with this mess, just be sure to credit me and other authors if necessary. Don't use any of my resources in a discriminatory manor. I don't tolerate disrespect in any way, shape, or form. I'm kind of a prude.\n<br />\n<br />Have fun. If you have questions, PM me. I probably won't give this page a lot of attention, but I'll try.",
  "categoryId": "94",
  "version": "1.0",
  "author": "Gearhog",
  "createdUnix": "1534052959",
  "updatedUnix": "1534052959",
  "containsAdultContent": false,
  "uploadedBy": "Gearhog",
  "primaryFile": null,
  "files": []
}