{
  "modId": 93043.0,
  "modName": "Comida Venezolana",
  "summary": "Este Mod es sencillo y divertido, esta hecho para que los jugadores de Skyrim que le den la oportunidad podran probar 3 especiales comidas y bebidas Venezolanas y conocer lo que sus efectos hacen en los Venezolanos (lo ire actualizando y subiendo cada vez mas alimentos)",
  "descriptionHtml": "Buenas, reciban todos un cordial saludo de mi parte, este Mod lo hice primordial mente como una Diversión, lo que hace es añadir a la cocina de Skyrim 3 recetas nuevas inspiradas total y completamente en comidas Venezolanas e incluye claro esta las caracteristicas y resultados que los Venezolanos tenemos al consumir estos alimentos y bebidas.... puede que ligeramente exagerado pero bueno, la intención es divertir o no? \n<br />\n<br />que nos encontraremos en este Mod\n<br />\n<br />Nuestro famoso Mondongo: un buen mondongo en el estomago y podras pelear por Dias sin descanso (es en serio) \n<br />\n<br />Nuestra cerveza por excelencia \n<br />\n<br />el mejor Ron de Venezuela (quieres cerrar un negocio con un cliente? convencer a un jefe de un aumento? convencer a tu pareja de dar el siguiente paso? convencer a un mercader de que un anillo de 70 de oro vale 700, entonces una botella de de nuestro Cacique y todo esto sera posible, aunque si exagere con lo del anillo) \n<br />\n<br />Good morning, everyone receives a cordial greeting from me, this Mod I did it primarily as a Fun, what it does is add 3 new recipes totally and completely inspired in Venezuelan meals to the Skyrim kitchen and it includes clear the characteristics and results that We Venezuelans have to consume these foods and drinks .... may be slightly exaggerated but hey, the intention is to have fun or not?\n<br />\n<br />that we will find in this ModOur famous Mondongo: a good tripe in the stomach and you can fight for days without rest\n<br />\n<br />Our beer par excellence\n<br />\n<br />the best Ron from Venezuela (do you want to close a business with a client? Do you want a purchasing coordinator? from our Cacique and all this is possible, although if you exaggerate with the ring)",
  "categoryId": "100",
  "version": "1.0.0",
  "author": "Zucks",
  "createdUnix": "1534203937",
  "updatedUnix": "1534203937",
  "containsAdultContent": false,
  "uploadedBy": "zuckspro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000279615",
      "name": "Comida Venezolana",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "63",
      "fileName": "Comida Venezolana-93043-1-0-0.rar",
      "uploadedUnix": "1534201986",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/2540358984fbdb7db7597af9e402bcd187d81af4643b942d0b1ad3dd69ab0c94/analysis/1534202144/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Comida%20Venezolana-93043-1-0-0.rar?fid=1000279615&ttl=1535884272&ri=8192&rs=8192&setec=9ee82ea8a224abfa100df8a18cdf74c0"
    }
  ]
}