{
  "modId": 93121.0,
  "modName": "hearthfire materials bat file",
  "summary": "The second of two bat files I use.  You may find it useful.  It just drops a ton of vanilla building materials in your inventory for the sake of building the hearthfire homes without having to visit tons of shops.  (You may want to increase your carryweight significantly before hand.  I may have slightly utterly overestimated the requirements ^-^)",
  "descriptionHtml": "UPDATE:  It should now include the following\n<br />Sawn Logs 9000\n<br />3 of each amulet type\n<br />10 of each flawless gem\n<br />at least 200 of each ingot (some will be 2000 and gold Ingot is only 20)\n<br />2000 Straw (somehow I missed that the first time)\n<br />20 dragon bone\n<br />20 dragon scale\n<br />\n<br />Now you should be able to build the Shrine base for all 3 houses and accompanying shrines.  (I have no plans to include materials for things that stewards can furnish or stuffed animal wall mounts/trophy room trophies.  That said you may have materials to do those things anyway, but if something is missing for those I'm not adding it.)\n<br />\n<br />\n<br />\n<br />\n<br />With this bat file all you need to do after you own land is to type bat pimpyourland into the console.  Once you do it should give you 2000 of most building requirements (aside from lumber.  Don't know if you can add that via console command or not.  Still need to buy that.) and 200 of some other random things, possibly vampire dust?  I forgot.  Been using this forever to just quickly build hearthfire houses for new files.\n<br />   ﻿I usually use modded player homes but just feel more comfortable storing my items in vanilla/hearthfire houses.  So it comes with enough materials to fully build the house and mostly furnish the basement (does not include mounted animals or shrines but does include the shrine base and everything else).  Honestly it might give you the materials to do this for all three hearthfire houses and then some.  I went a bit overboard.\n<br />   ﻿So just buy lumber as normal and this should take care of the rest of the requirements.  Could also be used to build anything else that uses the same materials (iron, steel, ebony, etc).\n<br />\n<br />Once again, just type \"bat pimpmyland\" into console once the file placed in the proper folder.\n<br />\n<br />I did NOT set this to modify carryweight.  Expect to be encumbered unless you use the console command yourself (player.set modav carryweight #).\n<br />\n<br />Honestly I don't expect as much use from this one as my vampire bat file but I figured I'd throw it up here in case someone else might find it useful.  This may be my last bat file (unless I get requests) as the other ones I currently use are either someone else's creation or they are unique to my mod setup and would be of little use to someone without the same mod setup as me.\n<br />\n<br />Probably not going to post a link to my other bat file.  It wasn't anything all that special, just an effort to streamline becoming a vampire without quests, something other (better) mods can offer as well.  But if you want a simple way to become a vampire via console without much modding, search vampiregod.  Should show up, or PM me if you really want the link.  Or just search me...it's the only other file I've uploaded to date.\n<br />\n<br />\n<br />Having a real fascination with bat files lately so if you have any ideas that you don't want to make yourself, I'm your guy...until I start trying to get into the real modding stuff.  Then my time will be consumed with that.  I endeavor to slowly turn Skyrim into hell.  Replace water with blood, random fire, dark ENB's, replace all npc's with either demons or damned (depending on the NPC's status they get cool armor or rags) but I want to keep the vanilla quests and characters otherwise intact.  As if all of Skyrim just took place in hell.  But first I'm going to see what's already been done and what I have to do.  I'm rambling and unfocused...I've not slept much lately.  ^-^",
  "categoryId": "39",
  "version": "1",
  "author": "WakahisaSensei",
  "createdUnix": "1534554299",
  "updatedUnix": "1535296328",
  "containsAdultContent": false,
  "uploadedBy": "WakahisaSensei",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000279893",
      "name": "Hearthfire materials bat file",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "Hearthfire materials bat file-93121-1.rar",
      "uploadedUnix": "1534554245",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b2372ebdf2bb8b9a3001e6144ee96e7278f0541b16cac6394a27d848ee93d992/analysis/1534554423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfire%20materials%20bat%20file-93121-1.rar?fid=1000279893&ttl=1535884397&ri=8192&rs=8192&setec=a0dd6bf43b6184cdad02933a0cd1c011"
    },
    {
      "fileId": "1000280560",
      "name": "hearthfire materials bat",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "hearthfire materials bat-93121-2.rar",
      "uploadedUnix": "1535295758",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/c6eb6995665d99dc9c4f7c4f20f7324ca7b756b6a934228b9d9cc5db7a91c836/analysis/1535295903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/hearthfire%20materials%20bat-93121-2.rar?fid=1000280560&ttl=1535884398&ri=8192&rs=8192&setec=8f3d7139155de6dc5654e40d2f18be74"
    },
    {
      "fileId": "1000280562",
      "name": "Hearthfire material bat",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Hearthfire material bat-93121-3.rar",
      "uploadedUnix": "1535296328",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/a8cd87d20443b7d3a51fe489b74abea405ea773163401450a56c05249f82aeeb/analysis/1535296503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfire%20material%20bat-93121-3.rar?fid=1000280562&ttl=1535884398&ri=8192&rs=8192&setec=de4e4df0d2456e1af6fa7774329cfc52"
    }
  ]
}