{
  "modId": 93124.0,
  "modName": "Poor Man's Solitude (Performance Overhaul)",
  "summary": "A compilation of a few, small mods that have a greater impact on the city of Solitude, without an impact on FPS.",
  "descriptionHtml": "I've tried nearly ever Solitude overhaul on the Nexus, and even the Steam workshop, and everything was so darn hard on my ASUS ROG, even with an NVIDIA GeForce GTX 960. And after all, I didn't really want a huge overhaul of the city, just a bit of interest--some sprucing, if you will. ;) \n<br />\n<br />So, I assembled a few smaller mods that add depth to the city without killing fps, causing constant crashing, etc., while remaining lore-friendly, more immersive, and interesting. A number of them also affect all of Skyrim, not just Solitude, which I've greatly enjoyed.\n<br />\n<br />Mini Solitude Add-ons by SkyrimFreeLancer: https://www.nexusmods.com/skyrim/mods/55257\n<br />Adds some banners, benches, foliage\n<br />\n<br />Cosmopolitan Solitude by LoneWolfEburg: https://www.nexusmods.com/skyrim/mods/53482\n<br />Adds five vendors and two new unique beverages\n<br />\n<br />Better-Looking Blue Palace Courtyard by LadyTyrell: https://www.nexusmods.com/skyrim/mods/60565\n<br />GREATLY improves the Blue Palace courtyard; I picked this one because it made the courtyard actually feel like a courtyard, as opposed to others that seemed just like a garden\n<br />\n<br />The Honey Spirit - Liquor Shop in Solitude by Jokerine: https://www.nexusmods.com/skyrim/mods/58822\n<br />Fills that awkward gap between the Winking Skeever and Angela's Aromatics with a nice liquor store\n<br />\n<br />The Lucky Skeever by sa547: https://www.nexusmods.com/skyrim/mods/52254\n<br />Adds a lore-friendly and awesome player home tucked behind the Winking Skeever\n<br />\n<br />Solitude - Capital City Overhaul by Shrutesh: https://www.nexusmods.com/skyrim/mods/14946\n<br />It calls itself an overhaul, but it's really not. What it IS is one of the best immersion fixes EVER. It puts lights in ALL the windows, making the bard's tower and the Blue Palace brilliant, shining beacons of beauty and immersion!\n<br />\n<br />Holidays by isoku: https://www.nexusmods.com/skyrim/mods/64820\n<br />A classic and a 'duh' for sure. This adds oodles of immersion and interest, oh, and did I mention holidays? In Skyrim?!?! YAS!\n<br />\n<br />Immersive Laundry by nerdofprey: https://www.nexusmods.com/skyrim/mods/58084\n<br />A most lacking but necessary detail for certain! This adds laundry lines between houses, laundry basins, and of course, more immersion.\n<br />\n<br />Stormcloaks with Sleeves by FranklinZunge: https://www.nexusmods.com/skyrim/mods/25868\n<br />Adds sleeves to stormcloak/guard cuirasses.\n<br />\n<br />Perfect Legionnaire by Ali Bengali: https://www.nexusmods.com/skyrim/mods/6085\n<br />Beautifully recreates the Imperial Armor, and provides General Tullius with epic custom armor.\n<br />\n<br />Guards Use Vanilla Open Helms by quixoticynic: https://www.nexusmods.com/skyrim/mods/55361\n<br />Makes guards in each hold use a different, but vanilla, open-faced helm. Yay faces! I like how much this allowed me to connect with the guards. It made each one unique and interesting in a way they couldn't have been before.\n<br />\n<br />Guard Dialogue Overhaul by Eckss: https://www.nexusmods.com/skyrim/mods/23390\n<br />Makes guards socially aware, saying things that are appropriate to your skill level, your rank in the hold, your epic deeds as Dragon Born, and so on and so forth. REALLY improves the experience in any part of Skyrim.\n<br />\n<br />Static Mesh Improvement Mod by Brumbek: https://www.nexusmods.com/skyrim/mods/8655\n<br />SMIM! Need I say more?\n<br />\n<br />Jaxonz Positioner by Jaxonz: https://www.nexusmods.com/skyrim/mods/52583\n<br />AMAZING mod. Allows for perfect positioning of dang near anything. You can fix missing walls with this baby! It lets you pick up any junk you find in Skyrim and bring it with you. You can make copies of items, resize, rotate, reposition, cha-cha real slow with ANYTHING in Skyrim! It's fantastic! And it will be great for personalizing and easily decorating your very own Solitude.\n<br />\n<br />Dynamic Things by Dominoid: https://www.nexusmods.com/skyrim/mods/32448\n<br />Turns useless shit into useful shit! It's amazing! You can actually train with training dummies now. Mind = blown.\n<br />\n<br />Solitude Tower Flags by patriotic: https://www.nexusmods.com/skyrim/mods/48032\n<br />Adds beautiful, animated flags to the tippy-tops of all the towers in Solitude.\n<br />\n<br />Solitude HD Textures by Bythemark: https://www.nexusmods.com/skyrim/mods/419\n<br />My personal favorite texture replacer for Solitude. I like it because it doesn't change the mood/feel of Solitude.\n<br />\n<br />Pets of Skyrim by qasiermo: https://www.nexusmods.com/skyrim/mods/17424\n<br />Adds kitties to Skyrim! I only use the Cats of Skyrim esp because I have another dog mod that I prefer.\n<br />\n<br />Dogs of Skyrim by ichibu: https://www.nexusmods.com/skyrim/mods/35008\n<br />And here it is! \n<br />\n<br />Chao's Lore Friendly Elisif Replacer: https://www.nexusmods.com/skyrim/mods/80837\n<br />Again, improves Elisif without changing her \"aura\" or whatever.\n<br />\n<br />Palaces and Castles Enchanced by SetteLisette: https://www.nexusmods.com/skyrim/mods/79746\n<br />This is the only mod I included that actually gives me some FPS trouble. Usually I end up around 40 FPS. I just love it soooo much I had to include it. It beautifully remakes the interiors of every palace in Skyrim, including the Blue Palace and Castle Dour. Just. Love. It.\n<br />\n<br />Sewers for Thieves by rubypele: https://www.nexusmods.com/skyrim/mods/51751\n<br />Adds sewers to some of the major cities, and a Thieves' Guild hideout in each sewers.\n<br />\n<br />Bards' College Tweaks by Tcz: https://www.nexusmods.com/skyrim/mods/84401\n<br />Okay, I lied, one more slightly FPS-lowering mod. But it's just so PRETTY! I CAN'T LEAVE IT OFF THE LIST! *ahem* Sorry. Yes, nice mod. Do get.\n<br />\n<br />Northern Bathhouses by Dourdendevire: https://www.nexusmods.com/skyrim/mods/27489\n<br />Adds a bathhouse to a number of cities, including the Winking Skeever in Solitude. Has a shower that works perfectly with Bathing in Skyrim. There's a bard, drinks, books, a sauna, and a fire to warm up and dry off.\n<br />\n<br />SkyFalls and SkyMills by SjoertJansen: https://www.nexusmods.com/skyrim/mods/40564\n<br />Animates distant waterfalls and windmills, and increases the size of the sails on the windmills. Very immersive and pretty.\n<br />\n<br />Bells of Skyrim by Vermunds: https://www.nexusmods.com/skyrim/mods/84740\n<br />Adds alarm bells to the major cities, each with its own guard to ring the bell. Very immersive and really darn cool. \n<br />\n<br />Uh-badee-uh-badee-uh-badee-uh th-that's all, folks! Hope this improves your Solitude (much pun intended) as it has mine.",
  "categoryId": "79",
  "version": "1",
  "author": "Zoyaxchan",
  "createdUnix": "1534564332",
  "updatedUnix": "1534564332",
  "containsAdultContent": false,
  "uploadedBy": "Zoyaxchan",
  "primaryFile": null,
  "files": []
}