{
  "modId": 93135.0,
  "modName": "Tomes Of Want",
  "summary": "Spells from my project \"Beyond Reach\" - covering every magic school.",
  "descriptionHtml": "Following the \"Portents from Beyond\" mod, this mod also takes from features within [url=https://www.nexusmods.com/skyrim/mods/48467/?]Beyond Reach[/url]. This time all the spells found within my main project are free to use without the quest requirement. Though this can hamper the experience if you're playing through Beyond Reach for the first time.\n<br />\n<br />You can find these spells mostly at the College of Winterhold. The ranger spells can be acquired at the Drunken Huntsman in whiterun. \n<br />\n<br />[color=#1155Cc][b][size=5]Alteration:[/size][/b][/color]\n<br />[size=3]\n<br />Iron Legion - Improves your comrade's armor rating by 40 points for 60 seconds.\n<br />\n<br />[size=3]Ebony Legion - Improves your comrade's armor rating by 80 points and magic resistance by 25 points  for 60 seconds.[/size]\n<br />\n<br />[size=3][size=3]Dragon Legion - Improves your comrade's armor rating by 150 points and magic resistance by 35 points  for 60 seconds.[/size][/size]\n<br />\n<br />Gnat's Escape - Moments from death; you abandon the fight but not your life. Escape through a cloud of smoke with great haste. Slows time for 3 seconds.\n<br />\n<br />Deft Form - \"Blindingly fast, impossibly so\"; which is what the witnesses would say. Find yourself behind your target in an instant. \n<br />\n<br />Rabid Strike - This spell sends a swarm of ravenous insects to poison the enemy while also degrading their armor. \n<br />\n<br />Retaliatory Stance - True power is when your authority requires nothing more than your presence. Armor is boosted and damage is reflected. Can stagger enemies who attack you.\n<br />\n<br />Arcane Marauder - Summon aetheric energy to command haste in your movement. Boosts movement speed.\n<br />\n<br />Arcane Berserker - Summon a torrent of aetheric energy to command haste in your muscles - giving way to ultimate dexterity and agility. Boosts movement and weapon speed. \n<br />\n<br />Vengeful Mirror - Block and reflect hostile spells back to the caster.\n<br />\n<br />\n<br />[b][color=#1155Cc][size=5]Conjuration:[/size][/color][/b]\n<br />\n<br />Seal Of Chaos - Lay a mass of lashing tendrils which will eat away at any victim for 8 points of damage and feed you their life for 8 points of health. \n<br />\n<br />Masochist Memory - Heals the caster 15 points through vile invocations in the name of a scheming dark mistress. Absorb health from nearby foes for 30 points. You will survive, even if you have to suffer. \n<br />\n<br />Necro Fissure - A rift to a realm of death, resurrects the dead that are near to it. Can also fear enemies that come close. \n<br />\n<br />Terror's Tenacity[size=3] - Heals the caster 5 points through vile invocations in the name of a scheming dark mistress. \n<br />Absorb health from nearby foes for 15 points. A concentration spell. [/size]\n<br />\n<br />\n<br />\n<br />[color=#1155Cc][b][size=5]Destruction:[/size][/b][/color]\n<br />\n<br />Static Orb - Conjure an orb of lightning which advances inexorably, damaging all in its path for 50 points. \n<br />\n<br />Blood Hex - A desperate plea for vitality, lashing out at your enemies and replacing lost blood. Absorb 8 points of health from targeted enemies, with the chance to do critical attacks.\n<br />\n<br />Breaking Point - After a certain amount of hits, a force erupts from within the caster, knocking back foes who dare approach. \n<br />\n<br />Chain Sparks - Not content with one soul to ensnare in its shocking grasp, this spell will latch on to any other victim that is near. \n<br />\n<br />Pox Barrage - Hurl a toxic volley of disease and despair. A spell that came not of this world, but most certainly from a Daedric Prince who divulges in pestilence and ruin. \n<br />\n<br />Infernal Finger - Enchant your equipped weapon with the infernal hatred of a wrathful, neglected god of the Reach.\n<br />\n<br />Immolation - Tap into the ether to unleash a primal flame that incinerates all foes who stand close. \n<br />\n<br />Infernal Watcher - An aspect of a wrathful, forgotten god - summoned to strike at any aggressor who draws near. \n<br />\n<br />Frigid Bulwark - Call upon a frozen guardian; infused with bitter hatred. It will strike out at any enemy which evokes its ire. \n<br />\n<br />Storm Vanguard - Latent energies drawn from your surroundings concentrate into one point; bestowed with intent by a stern, strict god. This ball of temporal instability strikes at all enemies nearby. \n<br />\n<br />Frigid Mortar - Launch a frozen orb that chills any in its spill, landing with terrible force that leaves frozen all in its wake. \n<br />\n<br />Frigid Force - Transpose thought to reality by halting an approaching aggressor with this chilling rebuke. Should only be used in close quarters. \n<br />\n<br />Flaying Bolt - A sickening display of spite that cleaves a path through any unfortunate entity that happens to be in its way. Commonly used among the bygone Ayleid sadists who ensured compliance of their Man-Cattle. \n<br />\n<br />Spite - Warped strands of reality seek to undo the very structure of the victim's bioligical design. Recipitents of this hateful spell will be left a degenerated mess of genetic refuse.\n<br />\n<br />Storm Chains - Lightning tendrils erupt from the ground beneath your enemy, paralyzing muscle and undoing matter for 10 points.\n<br />\n<br />\n<br />\n<br />\n<br />[b][color=#1155Cc][size=5]Illusion:[/size][/color][/b]\n<br />\n<br />Dooming Presence - Victims within your proximity are witness to the purest terror, fleeing to find shelter wherever they can. \n<br />\n<br />Dark Burden - This spell drains your enemies confidence, slowing their speed for 8 seconds. \n<br />[/size]\n<br />\n<br />[size=5][b][color=#1155Cc]Restoration:[/color][/b]\n<br />\n<br />[size=3]Comforting Bosom - Gather close and stay under her wing. Periodically heals allies nearby. [/size]\n<br />\n<br />[size=3]Divine Bolt - A Divine bolt that does 35 points of holy damage to Health. If you hit an ally or non-hostile, heal them for 20 points.\n<br />\n<br />Retribution - A Divine stake that does 90 points of holy damage to Health. [size=5][size=3]If you hit an ally or non-hostile, heal them for 20 points.[/size][/size]\n<br />\n<br />Rebuke - Smite away omens for 40 points of damage - such a display of conviction will surely stop any nefarious being in their tracks. Will heal allies for 20 points.\n<br />\n<br />[b][color=#1155Cc][size=5]Ranger (Bow) Spells:[/size][/color][/b]\n<br />\n<br />Ranger: Impaler - The next arrow unleashed from your bow will decrease the armor of your enemy. \n<br />\n<br />Ranger: Infernal Eye - Enchant your next arrow with the infernal hatred of a wrathful, neglected god of the Reach - fearing your enemy. \n<br />\n<br />Ranger: Linebreaker - The next arrow unleashed from your bow will knockdown an aggressor. \n<br />\n<br />Ranger: Anchor Arrow - The next arrow unleashed from your bow will stop then slow an aggressor's movement. [/size]\n<br />[/size]\n<br />[size=3]Ranger: Cutting Hail - A cascade of arrows descends from rifts above, cutting down any who find themselves beneath the metal rain.[/size]",
  "categoryId": "75",
  "version": "1",
  "author": "Razorkid",
  "createdUnix": "1534627201",
  "updatedUnix": "1534627201",
  "containsAdultContent": false,
  "uploadedBy": "razorkid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000279946",
      "name": "TomesOfWant1_0",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2174",
      "fileName": "TomesOfWant1_0-93135-1.7z",
      "uploadedUnix": "1534627138",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e7050529ce2cab13f211a6e81e970add7d7c0bfe93cb7e427d93303cddc5208a/analysis/1534627269/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TomesOfWant1_0-93135-1.7z?fid=1000279946&ttl=1535884428&ri=8192&rs=8192&setec=217c007c3915f6c187bdb86e780602c9"
    },
    {
      "fileId": "1000279947",
      "name": "TomesOfWant1_0",
      "version": "1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2174",
      "fileName": "TomesOfWant1_0-93135-1.7z",
      "uploadedUnix": "1534627174",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e7050529ce2cab13f211a6e81e970add7d7c0bfe93cb7e427d93303cddc5208a/analysis/1534627269/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TomesOfWant1_0-93135-1.7z?fid=1000279947&ttl=1535884429&ri=8192&rs=8192&setec=7b3625808aaefdb9b19c20f9b80cebcc"
    }
  ]
}