{
  "modId": 9317.0,
  "modName": "Clearspring Estate - A Player Home",
  "summary": "An ever-expanding estate based just uphill from \\\"Clearsping Tarn\\\". Featuring an excellent view of the tarn\\'s surrounding mountains.",
  "descriptionHtml": "----------------------------------\r\nPLEASE READ UP ON THE NEW ADDITIONS TO 1.1\r\nI have also modified the introduction below accordingly\r\n-----------------------------------\r\n\r\n\r\n\r\nDear Adventurer...                                                                           \r\n\r\nAfter receiving the gold you sent to us three months ago our contractors set off immediately to Clearspring Tarn. The specifications you mentioned on your letter of request were fulfilled to the detail, we are delighted to include a few extra facilities to your newfound estate, courtesy of \\'Karedence Estates\\'. The list of Clearspring Manor\\'s facilities are as follows....\r\n\r\n- The manor itself which will be listed in three segments:\r\na) The ground floor was constructed before we estimated so we had time to work on the minute details on this level of the manor such as the armor stands and exquisite cutlery. We have also acquired the services of \\\"Joan\\\". Joan is one of Cyrodiil\\'s top-standard chefs. Prior to looking for word in Skyrim Joan worked in the kitchens of the White-Gold tower itself. She has since sought to pursue a career in a more... rural part of Tamriel [ Dialogue and vending to be added in 1.2 possibly, it\\'s proving difficult to make]. As well as this Travidius Dentor has offered his services to you at the estate as your personal steward, he will no doubt be lingering in the hall to greet you. The rooms on the ground floor are as follows...\r\n\r\n- A display room\r\n- Kitchen\r\n- Lounge\r\n- Dining hall/stage (Along with a bard who makes a regular visit from Riften)\r\n- Study room/library\r\n\r\nb) The second floor includes an alchemy lab and enchanting room as per your request, as well as the necessities such as the master bedroom and a number of cupboards for storing well...whatever it is you need to store.\r\n\r\nc) The basement features one of the rooms we are particularly proud of, the bar. After realizing that there was a great deal of unused space in this section of the basement we felt it only prudent to construct something more befitting of a seasoned adventurer such as yourself. We are still looking for a suitable bar-tender to man the counter but for the time being enjoy the great bounty of mead and wine at your disposal. Please note that the lower portion of the basement is still under construction [I am having problems with the room cutting itself in to different sections and disappearing until you actually enter that portion, any tips on resolving this would go far]\r\n\r\nClearspring Outfitters: [WIP] As-per your request, the Clearspring Outfitters was built as part of the manor itself, we are struggling finding a suitable blacksmith to man the forge. Perhaps this is a prospect that you could deal with yourself should you find the time in your busy schedule. \r\n\r\nServant\\'s Quarters: This small building provides residence to both your butler and your head chef/ [Still under construction]\r\n\r\nI hope that you find these facilities satisfactory and that you contact us shortly to discuss further opportunities.\r\n\r\nYours sincerely \r\n\r\nKaredence Ulfgar\r\nOwner of Karedence Estates\r\n\r\n-----------------------------------------------------------------------------------------------------------------------\r\nThe nitty-gritty\r\n-----------------------------------------------------------------------------------------------------------------------\r\n\r\nAs you can see a lot of this has yet to be completed, I uploaded what I\\'ve got so far to \r\nA) Show the community my work\r\nB) Seek help on problems I am currently facing with my project\r\n\r\nClearspring Manor is my first mod on Skyrim admitedly. With practise I hope to produce a range of manors,villas, mansions and abodes under the name \\\"Karedence Estates\\\".\r\n\r\n------------------------------------------------\r\nNEW TO 1.1\r\n------------------------------------------------\r\nI like to take what commenters say in to account when \\\"Modding my mod\\\". So I have changed a few bits \\'n\\' bobs according to the comments I have received...\r\n\r\nRandom additions...\r\n\r\n-Now known as \\\"Clearspring Estate\\\" as supposed to \\\"Clearspring Manor\\\"\r\n- Added a nice little secret to the manor itself\r\n- Added a farm behind the manor with Hrolf the farmer (Still no dialogue)\r\n- Added Travidius Dentor (Speech is messed up, I recorded for testing purposes but it may have recorded a clip of the \\\"Mighty Boosh live\\\" if you\\'re wondering what the voice is.\r\n\r\n\\\"Woopypooky\\\": We now have a bartender and maid!\r\n\r\n\\\"Adalbey\\\": I\\'ve scoured the manor, all containers should be safe to put your items in. Please let me know if you have any problems (I have had none myself)\r\n\r\n\\\"Superjack010\\\": I\\'ve added map markers, never again will you be searching the vast mountains of Skyrim for my estate!\r\n\r\n\\\"Teppouu\\\": I have TRIED to resolve your problem by using a CK tool called \\\"Portals\\\". This should stop you seeing a weird blue wall in certain areas of the manor and should in face improve FPS.\r\n\r\n\\\"miketheratguy\\\": The interior has been massively re-designed so it looks a little more unique!\r\n\r\n\\\"Aurietius\\\": Guards have been added, a couple of archers to the observatory and a few swordsmen to the front of the house.\r\n\r\nOnce again thank you for your feedback ladies and gents.\r\n\r\nAny advice of any kind regarding my work will be highly appreciated.\r\n\r\nThanks.\r\n\r\nKaredence\r\n(Jackoa19)",
  "categoryId": "68",
  "version": "1.1",
  "author": "Karedence",
  "createdUnix": "1329096014",
  "updatedUnix": "1329306527",
  "containsAdultContent": false,
  "uploadedBy": "jackoa19",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30073",
      "name": "ClearspringManorV1",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "179",
      "fileName": "ClearspringManorV1-9317.zip",
      "uploadedUnix": "1329096666",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/13b1041a3a4e11eccd2b235bf677cfd22b410ff4825c27ca017c6a884570bd2b/analysis/1406675658/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ClearspringManorV1-9317.zip?fid=30073&ttl=1535768780&ri=8192&rs=8192&setec=35fd13f62c9abcd1aaeaf482f5b3a662"
    },
    {
      "fileId": "31474",
      "name": "ClearspringManorV1_1 ",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "322",
      "fileName": "ClearspringManorV1_1 -9317-1-1.zip",
      "uploadedUnix": "1329306527",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5ff200928989d8b65bbfc15e538c02f07695b7166ce5dd8fb7d26250c2cd4dbe/analysis/1406684109/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ClearspringManorV1_1%20-9317-1-1.zip?fid=31474&ttl=1535768780&ri=8192&rs=8192&setec=3ae3fa9a2800d236a133374e15eb423d"
    }
  ]
}