{
  "modId": 9324.0,
  "modName": "Marry a female Khajiit - Brelyna Maryon becomes Khajiit",
  "summary": "I basically just changed Brelyna Maryon, a possible marriage candidate, into a Khajiit. :)",
  "descriptionHtml": "Hi all!\r\n\r\nI wanted to have a Khajiit to marry for my Khajiit character. Simplest solution seemed to be to just change one of the already possibly wives into a Khajiit. I picked Brelyna Maryon from the College of Winterhold since my character is a Mage and so is she.\r\n\r\nI kept every single setting the same, I only changed the race option, it didn\\'t touch the sliders to modify how she looks either so its just how she would look as a Khajiit with the same slider positions. I may mess with the sliders later on but for now I think she looks fine as is. She still has the same voice, I would have changed it to Khajiit but I believe there is an issue with using Khajiit voices on a character you can marry as they never recorded Khajiit voice marriage dialogue. To me her voice seems to fit her well as a Khajiit anyhow, just no \\\"raspyness\\\" to the voice as in a normal Khajiit.\r\n\r\nI made this for my own personal use but decided to share it with anyone interested in such a mod. :)\r\n\r\nI haven\\'t done much testing yet so use at your own risk. I don\\'t \\\"believe\\\" it should cause any issues since I didn\\'t touch any other settings other than race. I\\'ll update this description after awhile of testing to let you know how it went.\r\n\r\nFinal thoughts;\r\nIf anyone really wants me to change her, or another NPC, to a different race for them in a new mod I suppose I could. Sorry if I don\\'t get back to you right away though. Again, I must mention that I\\'m not completely positive changing a certain NPC\\'s race will cause any issues down the line as I\\'ve had little time to test but I don\\'t think it should.\r\n\r\nAnd PLEASE LET ME KNOW, if you find any issues or bugs with this mod. Thank you!\r\n\r\nThis mod does NOT require a new game, she will change even if your right next to her in your save.\r\n\r\nEnjoy and take care. :)",
  "categoryId": "66",
  "version": "0.2",
  "author": "Skydog287",
  "createdUnix": "1329098406",
  "updatedUnix": "1329098777",
  "containsAdultContent": false,
  "uploadedBy": "Skydog287",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30098",
      "name": "Brelyna Khajiit",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Brelyna Khajiit-9324-0-2.rar",
      "uploadedUnix": "1329098777",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/5eb88f75f448bba88af1760f8e35cf81d17367ec84a4ef3caf3dee6dfc2d17e8/analysis/1406675829/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brelyna%20Khajiit-9324-0-2.rar?fid=30098&ttl=1535768788&ri=8192&rs=8192&setec=40fc6db23b0e8765fe33eaff91e11c65"
    }
  ]
}