{
  "modId": 93268.0,
  "modName": "Bandolier Expanded",
  "summary": "Expands the function of Bandolier to include drawbacks to the larger bag sizes, and other minor effects for different types of gear, with the goal of creating interesting choices and tradeoffs.",
  "descriptionHtml": "[font=Georgia][u][size=6][center][i]Bandolier Expanded[/i][/center][/size][/u][/font]This started as a series of small tweaks that I made to my own game. I play with Requiem and a number of survival mods, so I wanted a way to balance limited carry weight with the extra gear I had to carry from Frostfall/RND/etc. I ended up adding some minor effects to other types of gear that didn't do anything in the base mod (namely books) to create interesting choices. I thought it worth sharing.\n<br />\n<br />[b][u]Notes on balance:\n<br />[/u][/b]This mod is geared towards players who use limited/realistic carry weight mods. As mentioned, I play Skyrim exclusively with Requiem, which heavily nerfs your carry weight. If you don't play that way, you may not find this mod to your liking. Be warned!\n<br />\n<br />[u]Requirements[/u]\n<br />[list]\n<br />[*][url=http://www.nexusmods.com/skyrim/mods/16438/]Bandolier[/url]﻿ (of course)\n<br />[*][url=http://www.nexusmods.com/skyrim/mods/22119]Bandolier - Dawnguard[/url]﻿ (see below)\n<br />[*][url=http://www.nexusmods.com/skyrim/mods/17879/]Bandolier - Decreased Carry Weight and Reduced Prices[/url]﻿ (it may not be explicitly required, but I made mymod using the edited esp from here, so I can't guarantee it will work correctly without it)\n<br />[/list]\n<br />[b][u]Description\n<br />[/u][/b]Overall, it's a pretty simple mod. I'll just list some of the main points:\n<br />\n<br />[list]\n<br />[*]Forces you to choose between 'smaller' and 'larger' variants of bags and bandoliers for each slot. Larger variants provide more weight, but come at the cost of slightly reduced movement speed that, if taken to an extreme, could hinder you in combat and travel. Choose wisely.\n<br />[*]Adds a few 'small' pouches for certain slots that had only \"Large\" variants to fill in the gap (namely \"Side Left\" and \"Side Right\"). The new small bags use the same models as the large ones, but have the same effects as other small bags.\n<br />[*]Satchels have been given some of the better carry-weight effects (the same as small bandoliers) since they take up two slots on the hip, though they're crafting recipes are a bit more complicated for early-game characters.\n<br />[*]Books were nice-looking adornments, but without any bonuses attached it was a hard choice to make. I added small enchantments that will decrease the casting cost of your chosen school of magic by 3%. All varieties of books can be crafted for any magic school. The notebooks from the Dawnguard mod (below) are slightly different, however. Instead of affecting a specific magic school, the notebooks (which take up the front hip slots, rather than the back) reduce the cost of all spells by 1%.\n<br />[*]Vial holders and vial belts contain a selection of salves and poultices that help you recover from you wounds (10-25% heal rate boost, balanced around Requiem).\n<br />[*]I've integrated the extra addons from [b]Bandolier - Dawnguard[/b] into this mod. The notebooks are described above. I didn't change the flasks' stamina regeneration effect, but I confirmed that it is a unique effect that will not affect Requiem's stamina drain from running - You'll still need to utilize enchantments or potions to avoid that exhaustion (a feature from Requiem 2.0, or with [url=https://www.nexusmods.com/skyrim/mods/87803]my own tweak[/url]﻿). I also edited the crafting recipes so that \"Dark Leather\" gear all uses the same dyed leather, and disabled the \"Rough Dark Leather\" recipe from the Dawnguard mod.\n<br />[*]Dark Leather is now dyed with an Inkwell, instead of spider venom.\n<br />[*]\"Assorted Buckles\" uses iron instead of steel, and now requires the Craftsmanship perk to create. Added buckles to leveled lists, they should be available at most smiths.\n<br />[/list]",
  "categoryId": "60",
  "version": "1.0",
  "author": "Paulicus",
  "createdUnix": "1535233929",
  "updatedUnix": "1535233929",
  "containsAdultContent": false,
  "uploadedBy": "Paulicus1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000280467",
      "name": "Bandolier Expanded",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Bandolier Expanded-93268-1-0.zip",
      "uploadedUnix": "1535233471",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bb0a916d86ecaa8925a2f312d9f925d18e2a4c12770afa4d36071d6650aa3dd2/analysis/1535233562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bandolier%20Expanded-93268-1-0.zip?fid=1000280467&ttl=1535884604&ri=8192&rs=8192&setec=91248d03560157f4752c1cae80444719"
    }
  ]
}