{
  "modId": 93287.0,
  "modName": "Godlike Bat file",
  "summary": "One console command to make you overpowered.",
  "descriptionHtml": "This is a single bat file that makes your character way overpowered.  Maxes all stats and perks without raising your level.  Shouts recovery time becomes 0, carryweight is 20000ish, all map markers revealed, tons of gold, a lockpick, etc.\n<br />\n<br />Teaches all shouts, including DLC (except for soul tear but it does give Summon Durnevehr so you can easily get it) as well as 100 dragonsouls.\n<br />\n<br />Gives one imperial sword of soul stealing for the purposes of disenchanting.\n<br />\n<br />2000 empty black soul gems and about 5 filled black soul gems.\n<br />\n<br />All materials from my hearthfire bat file included!\n<br />\n<br />It does not include my vampire bat file (aside from giving you vampire dust) as you may or may not want vampires depending on your modding experience.\n<br />\n<br />\n<br />\n<br />This Bat File is based on the the work of another but they seems to have taken their file down.  So I cannot find their name to credit.  I guess just know that I do not deserve full credit, and thank this now nameless creator.\n<br />\n<br />\n<br />To INSTALL:\n<br />Extract the files from the .rar.  There should be a text file called Godlike.txt.  Take that file and put it into the same folder that you find TESV.exe.  This should also be the same folder that data is in (do not put it in the data folder).  Then in game open the console and just type \"bat godlike\" and it should work.  I don't believe mod organizers can install bat files so this must be done manually, but its pretty simple.  It shouldn't cause problems if you do it wrong, it just won't work.  Also, if you rename the file then you type the new file name into the console.  Exampe:  If you name the file \"levelup\" then you would type \"bat levelup\".\n<br />\n<br />Finally, I've noticed the bat file does not give me silver ingot.  Not sure why as previous versions use to.  I may have accidentally deleted that command.  Its not difficult to fix, you just type the command into the .txt file and then its added.  Otherwise you can just add silver ingot to your inventory as you would normally.  Any mod commands (which have load order dependent values) likely won't do anything for you as your load order will be different than mine.  Though most, if not all, commands in the file are vanilla ones.",
  "categoryId": "28",
  "version": "2",
  "author": "WakahisaSensei",
  "createdUnix": "1535297930",
  "updatedUnix": "1535396464",
  "containsAdultContent": false,
  "uploadedBy": "WakahisaSensei",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000280566",
      "name": "Godlike",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Godlike-93287-1.rar",
      "uploadedUnix": "1535297860",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b13f1121c18cb1a0717f2c294086d92349673828d3f16392f3cf66688b21f27e/analysis/1535298003/",
      "changelogHtml": " First upload. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Godlike-93287-1.rar?fid=1000280566&ttl=1535884630&ri=8192&rs=8192&setec=38d1d63522f94b2638d943bd1674c7bf"
    },
    {
      "fileId": "1000280665",
      "name": "Godlike",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Godlike-93287-2.rar",
      "uploadedUnix": "1535396464",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/b13f1121c18cb1a0717f2c294086d92349673828d3f16392f3cf66688b21f27e/analysis/1535396583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Godlike-93287-2.rar?fid=1000280665&ttl=1535884631&ri=8192&rs=8192&setec=782f38cfa877c7e3ad992d8bfaee3b5c"
    }
  ]
}