{
  "modId": 9328.0,
  "modName": "Spellcraft - Preview",
  "summary": "A preview of my upcoming Spellcraft mod, this package contains nine new spells and five enchantments, plus a lore-friendly research system for acquiring them&#33;",
  "descriptionHtml": "Update: Since this file still gets the occasional comment, I should say that the project has been long since canceled.\r<br />\r<br />The upcoming Spellcraft mod adds dozens of new spells and enchantments (balanced against existing content), craftable staffs and magic arrows, and a lore-friendly research system for acquiring them. We&#39;ve selected nine of the most useful spells and five enchantments for a special sneak preview.\r<br />\r<br />===So what are the spells?===\r<br />\r<br />-Daylight: An improvement on the Candlelight spell, Daylight lasts five minutes and makes dank tombs bright as day&#33;\r<br />-Bound Chest: This special chest summoned from Oblivion can store up to 200 pounds of valuables. Great for long dungeon treks.\r<br />-Giantmight: Grow to the size of a giant and crush your foes with +40 melee and unarmed damage&#33;\r<br />-River of Flame: Ever want to set fire to... well, everything? This channeled Master-level Destruction spell torches everything in its path and leaves behind Walls of Fire.\r<br />-Diminuation: Wouldn&#39;t bandits look so much cuter if they were half their size? (They&#39;d probably also be less capable of murdering you) Find out with this nifty Alteration spell&#33;\r<br />-Consumptive Ward: Suck half the Magicka out of spells negated by this special ward.\r<br />-Celerity: Skyrim is... big. Make those miles just fly by with this 50% speed boost&#33; Also useful for fleeing from rampaging giants, dragons, and spouses.\r<br />-Shadow Image: Weave a shadowy humanoid image to distract foes - it can&#39;t fight and is destroyed if struck, but it might just be the edge a stealthy character needs.\r<br />-Reverse Gravity: Magic and physics unite to throw nearby foes into the atmosphere. Hit airborne targets with Unrelenting Force for extra fun&#33;\r<br />\r<br />===And the enchantments?===\r<br />The preview includes Fortify Duration/Power enchantments for each school. Ever wanted a hat that makes your fireballs burn hotter?\r<br />\r<br />===So what is this research system?===\r<br />Head to your fancy Archmage&#39;s Quarters and you&#39;ll notice a new research desk. From here, you can choose a spell to work on; each spell requires a certain skill level, prior knowledge, and research components. Luckily, for the purposes of this preview there&#39;s a Cheater&#39;s Chest nearby that contains all necessary components and pre-enchanted rings.\r<br />\r<br />===What can I look forward to in the full version?===\r<br />The main attraction is a list of 30+ new spells - including Mental Domination, Starfall, Wall of Ice, Animate Skeletal Dragon, Ball Lightning, and more. Don&#39;t overlook the new enchantments, either - you&#39;ll be able to craft boots that let you walk on water and run like the wind, or perhaps a ring that heals you when you&#39;re on the brink of death. Also included will be the ability to craft the Staff of (your favorite spell here) and magic arrows - haven&#39;t you always wanted an arrow that draws a bolt of lightning to whatever it strikes?\r<br />\r<br />The research system will also be significantly deeper in the full version - in addition to materials and prior knowledge, you&#39;ll need to consult with powerful mages, assign tasks to apprentices, acquire live test subjects, and even interrogate summoned Daedra for their secrets&#33;\r<br />\r<br />===Sounds wonderful&#33; When can I expect the full version?===\r<br />Current estimates put the release in late February or early March. I&#39;m a graduate student, though, so nuclear physics may take precedence over Skyrim&#33;\r<br />\r<br />===I&#39;m a 3D modeler/texture artist and I want to contribute. Are you looking for help with Spellcraft?===\r<br />A thousand times yes&#33; You can contact me on the Nexus as Kentington.",
  "categoryId": "75",
  "version": "1.0",
  "author": "Kentington",
  "createdUnix": "1329102012",
  "updatedUnix": "1329102081",
  "containsAdultContent": false,
  "uploadedBy": "Kentington",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30118",
      "name": "Spellcraft- Preview",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "146",
      "fileName": "Spellcraft- Preview-9328-1-0.zip",
      "uploadedUnix": "1329102081",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dd6221ec4d96b4f29b94b366c1267315cd3320ec75f45ff17839e0ae0c56f44f/analysis/1406675885/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spellcraft-%20Preview-9328-1-0.zip?fid=30118&ttl=1535768793&ri=8192&rs=8192&setec=80c33becd473b12bdf26ab2eff24c387"
    }
  ]
}