{
  "modId": 93343.0,
  "modName": "Shezarrine - Russian Translation",
  "summary": "Этот мод перевернёт с ног на голову всё, к чему вы привыкли. Шезаррин откроет вам истинное лицо Талмора.",
  "descriptionHtml": "[i]Тамриэль — это «Арена», здесь всегда была сцена, бойцовая яма, где Эт'ада стравливали своих избранных, заставляя их убивать друг друга.  У каждой эры есть свой Поединок. Гладиаторы режут друг друга на этой арене без угрызений совести, не задавая вопросов, во имя своих покровителей.\n<br />Шезаррин, ты зашёл так далеко.\n<br />Но пришло время завершить все поединки.\n<br />\n<br />[/i][b]От переводчика\n<br />[/b]Здесь расположен только перевод. Для установки мода загрузите и установите [url=https://www.nexusmods.com/skyrim/mods/90075]оригинальный мод[/url]﻿, затем загрузите файл с переводом и установите его, перезаписав файл Shezarrine.esp\n<br />\n<br />[b]От автора[i]\n<br />[/i][/b]\n<br />Пожалуйста, не забудьте одобрить и проголосовать за этот мод, если вам понравилась его идея :)\n<br />\n<br />Как начать? Отыщите Онмунда в Коллегии Винтерхолда.\n<br />Чего ожидать? Отлично прописанного напарника и чрезвычайно подробный исторический фон, с квестами, образующими мощную сюжетную линию.\n<br />\n<br />Особенности:\n<br />0. Вы примете непосредственное участие в сюжетной линии, связанной с Талмором. В финале вы решите судьбу Тамриэля и Талмора.\n<br />1. Почти полностью переписана сюжетная линия Онмунда, теперь это персонаж с [b]4000 строк диалогов[/b], участвующий практически во всех сюжетных линиях. С Онмундом можно дружить, развивать отношения или ссориться (да-да, вы можете ссориться со своим напарником, заставив его вас возненавидеть).\n<br />2. Много нового о мире, истории и легендах Древних Свитков.\n<br />3. Новые красивые земли.\n<br />4. Новые предметы.\n<br />5. Новые квесты.\n<br />6. Все новые диалоги полностью озвучены (на английском).\n<br />7. Интеллектуальный дизайн: Онмунд помнит, что вы ему говорили, и знает, что с этим делать. Онмунд — один из первых персонажей, обладающих чувством юмора, он понимает, шутите вы или говорите всерьёз. Он не против того, чтобы вы подшучивали над ним, пока не пересекаете красную линию, и выбирает ответ, исходя из уровня отношений и выбранного вами стиля общения.\n<br />8. Интерактивный дизайн: Онмунд взаимодействует с ванильным миром, включая квесты. Он принимает активное участие во многих ванильных квестах, таких как главный квест Алдуина, Коллегия Винтерхолда, Тёмное Братство и даже сюжетные линии DLC.\n<br />\n<br />Подробности:\n<br />История эта довольно тёмная, мрачная и таинственная, и у игрока будет большая свобода в отношении выбора диалогов и вариантов прохождения квестов. Вы сможете отыграть роль по своему вкусу и взаимодействовать с персонажами так, как хочется вам.\n<br />В этой истории немало философии и идеологии, однако игроки, которым это покажется скучным, могут просто пропустить их, а те, кому это интересно, могут обсуждать эти вопросы и даже спорить о них с персонажами, и это одна из ключевых особенностей моего мода - свобода.\n<br />Это только пролог к полной истории. Вы сделаете последние приготовления перед тем, как отправитесь в своё последнее путешествие, которое спасёт или уничтожит мир.\n<br />\n<br />Онмунд наверняка изменит ваши ощущения от ванильной игры.\n<br />\n<br />Важные примечания:\n<br />1. Чтобы полностью оценить этот мод, [b]вам следует начать новую игру[/b]. Без шуток, чтобы начать пользоваться модом,  выберите «Новая Игра» на стартовом экране или наберите в консоли coc qasmoke (только для опытных игроков). Если вы не начнёте новую игру, то пропустите не менее 20% содержания пролога и рискуете столкнуться с некоторыми проблемами в ходе ванильных квестов.\n<br />2. [b]Поместите этот мод как можно ближе к концу списка подключённых модов[/b], он ДОЛЖЕН быть ниже любых esp, которые изменяют Онмунда или ванильные квесты. При необходимости можно создать патчи совместимости.\n<br />3. Рекомендуется как можно быстрее вступить в Коллегию Винтерхолда и взять Онмунда в напарники, поскольку участие Онмунда предусмотрено даже в самых ранних ванильных квестах, таких как «Дракон в небе». Чем больше квестов вы с ним пройдёте вместе, тем проще будет продвигать ваши отношения.\n<br />4. Онмунд – далеко не единственное содержание этого мода, но, если вам не нравится ходить с ним вместе, то устанавливать этот мод нет смысла.\n<br />5. [b]Избегайте незавершённых диалогов[/b] (диалог «завершён», когда Онмунд сам прекращает разговор, или же окно диалогов возвращается к обычным «Жди здесь», «Я хочу, чтобы ты кое-что для меня сделал»). Прерывание диалога может создать проблемы от минимальных, типа потери очков отношений, до таких важных, как нарушение хода выполнения квеста. Писать обработчики завершения для тысяч диалоговых линий очень долго, поэтому я просто советую вам избегать незавершённых диалогов.\n<br />\n<br />Жёсткие требования:\n<br />1. Вы не должны начать линию квестов Коллегии Винтерхолда.\n<br />2. Unofficial Skyrim Legendary Edition Patch.\n<br />3. Все DLC.\n<br />\n<br />Рекомендации:\n<br />1. РЕКОМЕНДУЕТСЯ начать новую игру.\n<br />2. РЕКОМЕНДУЕТСЯ на протяжении всей игры ходить с Онмундом в качестве напраника, если только сама игра не отправляет вас куда-то в одиночку.\n<br />3. Вы МОЖЕТЕ устанавливать моды, изменяющие внешний вид Онмунда.\n<br />\n<br />Вопросы и Ответы:\n<br />1. Где найти Онмунда? Его класс? Можно ли завязать с ним роман?\n<br />В Коллегии Винтерхолда. Маг. Да.\n<br />\n<br />2. Зачем переписывать Онмунда вместо создания нового персонажа?\n<br />Мой первоначальный замысел был в том, чтобы превратить простых ванильных персонажей в людей, похожих на людей, с внутренней глубиной, но позже мне захотелось создать уникальную линейную историю, ориентированную на персонажа; к тому времени я вложил много времени и сил в Онмунда, так что логично было взять именно его.\n<br />\n<br />3. Будем ли мы решать судьбу мира в прологе, как вы обещали?\n<br />В прологе вы сможете решить судьбу ряда персонажей и фракций, но события, решающие судьбы мира, будут происходить в следующей части.\n<br />\n<br />4. Мне не нравится новый Онмунд.\n<br />Я не писал его для того, чтобы всем понравиться. У него есть собственные взгляды и идеалы, и в этом смысл этого персонажа. Если же речь о том, что не касается его личности и диалогов, всё это является частью этого персонажа и опыта, который моя команда разработала для вас.\n<br />\n<br />5. Как начать роман с Онмундом? Может ли у него быть роман с ГГ-мужчиной? Можно ли вступить с ним в брак?\n<br />Флиртуйте с ним, не обижайте его, показывайте ему свою заботу, дарите подарки. Онмунд может вступить в романтические отношения с ГГ любого пола, его диалоги подстраиваются под пол вашего персонажа. В финале романтической линии вы сможете вступить в брак с ним.\n<br />\n<br />6. Этот мод не соответствует лору, он слишком сильно расширяет лор.\n<br />Я убедился, что написанный мной лор в основном не противоречит канону. По большей части написанный мной лор заполняет пробелы, оставленные Bethesda.\n<br />\n<br />7. Слишком много слов, слишком мало экшена.\n<br />Экшен заключается в совместных похождениях с Онмундом.\n<br />\n<br />8. Почему размер мода с более чем 4000 строк диалогов составляет всего несколько сотен мегабайт?\n<br />Я сжал аудиофайлы в формат fuz, что значительно уменьшило их размер. Без сжатия размер пролога превышает 2 Гб.\n<br />\n<br />9. Куда можно писать комментарии или вопросы, связанные с спойлерами?\n<br />Здесь: https://forums.nexusmods.com/index.php?/topic/6465081-shezarrine-the-fate-of-tamriel-spoiler-thread/\n<br />\n<br />Credit:\n<br />\n<br />Anbeegod (Miroslav Yegorov) - Director, Head writer, Minor level design\n<br />\n<br />Level designers:\n<br />Adolon\n<br />Agerweb (unreleased level)\n<br />JayCrane\n<br />Morrodes\n<br />\n<br />Modelers:\n<br />Bassam\n<br />JayCrane\n<br />Anon\n<br />\n<br />Editor:\n<br />Kriss Martin\n<br />\n<br />Script and spells:\n<br />Anbeegod\n<br />Igar2000\n<br />\n<br />Voice acting (characters in the prologue, not in order):\n<br />Jacob \"BeardyMan\" Eccles - Onmund (Email of Jacob: BusinessBeard@hotmail.com)\n<br />Shannon Hobby - Mysterious character\n<br />Melissa Sturn - Onmund's mother\n<br />Scotland Bullard - Onmund's father, Orc chieftain, Orc's henchmen\n<br />Limroto - Commander Lo'deri of Elsweyr\n<br />Tasheni - Breton noble\n<br />Neferankh - Mysterious characters\n<br />\n<br />Voice acting (characters not yet appeared in the prologue, not in order):\n<br />Kriss Martin\n<br />Grand Stag Studio\n<br />Mr Brunswick\n<br />Seasable\n<br />SirSallas\n<br />EZPZ\n<br />Anax\n<br />Kaze\n<br />Alexa Erdogan\n<br />Uuntiedshoelace\n<br />Rocky\n<br />Stringstorm\n<br />Khobis\n<br />Bigmig\n<br />Hennessey (Bonehead)\n<br />Loveliel\n<br />MrTush\n<br />Noveria\n<br />Saeros\n<br />Saltkrakah\n<br />Andrew Reynolds\n<br />Craftiian\n<br />Hades\n<br />KDonProduction\n<br />\n<br />Additional Credit:\n<br />Arthmoor - for helping with scripts\n<br />CD Projekt RED - for several assets in the mod\n<br />Dogtown1 - for several assets in the mod\n<br />Sorenant - for help checking Elder Scrolls' lore\n<br />Madcat221 - for help checking Elder Scrolls' lore\n<br />Reality, Mythology - for giving me so many story ideas\n<br />\n<br />\n<br />Donation:\n<br />All donations made to this mod will be shared according to contribution.",
  "categoryId": "35",
  "version": "Public.Beta.07.rus1",
  "author": "ao1",
  "createdUnix": "1535564551",
  "updatedUnix": "1535564551",
  "containsAdultContent": false,
  "uploadedBy": "ao1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000280773",
      "name": "Shezarrine - Prologue - Russian",
      "version": "Public.Beta.07.rus1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3879",
      "fileName": "Shezarrine - Prologue - Russian-93343-Public-Beta-07-rus1.7z",
      "uploadedUnix": "1535563486",
      "modVersion": "Public.Beta.07.rus1",
      "virusScanUrl": "https://www.virustotal.com/file/3dc970356d2a3783a83c18c05906c33ffac9cc9b12842da9aba042f20c675423/analysis/1535563637/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shezarrine%20-%20Prologue%20-%20Russian-93343-Public-Beta-07-rus1.7z?fid=1000280773&ttl=1535884695&ri=8192&rs=8192&setec=de8b68fcf5f2d2aa60506a6ea202be03"
    }
  ]
}