{
  "modId": 9334.0,
  "modName": "Pimp my Proudspire",
  "summary": "Pimp my proudspire turns proudspire manor in solitude into the ultimate adventures hangout! Complete with a beautiful trophy room, a massive library, a fully functional blacksmith, enchanting, and alchemy workshop, and a great portal stone network that allows you easy access to all 9 hold capitals. It also includes the ability to teleport into the ",
  "descriptionHtml": "If you like this mod please endorse, lets get me some popularity!\r\n\r\n====================================================\r\nPimp my Proudspire has just recieved a HUGE update!!\r\nhttp://www.youtube.com/watch?v=WCaasz8DSd8\r\n=====================================================\r\n\r\n\r\nAll the bugs are now fixed and the house works flawlessly. Help Pimp my Proudspire take the place of Dovahkiin\\'s Hideout as the number one house mod!\r\n\r\nPimp my proudspire turns Proudspire Manor in solitude into the ultimate adventures hangout! Complete with a beautiful trophy room, a massive library, a fully functional blacksmith, enchanting, and alchemy workshop, and a great portal stone network that allows you easy access to all 9 hold capitals. It also includes the ability to teleport into the house from any location in skyim. \r\n\r\n\r\n********Important Information to Remember!***********\r\n- Make sure you leave proudspire before updating/installing\r\n- ALWAYS BACK UP YOUR GAME SAVE BEFORE INSTALLING ANY MOD!!\r\n- There is a book sitting on the note table in the upstairs library that will let you travel to the original proudspire manor and collect any gear you left behind.\r\n*****************************************************\r\n\r\nUpdated in v1.1 - \r\n###############\r\n\r\n Upgrades\r\n ~~~~~~~~\r\n  \r\n    - All the doors are now named.\r\n    - All the cabinets in the house now have Custom names. Some new cabinets were added to the bedroom. There are now 24 custom named wardrobe cabinets upstiars. On the left side are 9 cabinets for the 9 heavy armor teir classes (iron, orcish, deaderic, etc) + one cabinet for mage gear. On the Right side are the 9 cabinets for each of the 9 light armor teir sets (hide, glass, dragonscale, etc) + an extra cabinet for thief gear, each one named accordingly. Every container in the house now has a special name to help originize gear.\r\n    - Tons of new visual and lighting effects.\r\n    - Added \\\"Dimensional Rifts and You\\\", a book that will allow you to travel to the original proudspire to collect any gear left behind.\r\n    \r\n\r\n Bug Fixes\r\n ~~~~~~~~~\r\n      \r\n     - The sheild and sword racks in the trophy room now work properly \r\n     - Follwers and Animal companions can now enter and exit the house and make full use of the portal system.\r\n     - Jordis the Sword-Maiden will now appear in the house once she has been unlocked.\r\n     - You can now use the pimpjuice potion in cities and still teleport back to the last place you used the drink without getting a grey screen error.\r\n     - The doors now close behind you.\r\n\r\nPlease leave comments and suggestions, i would love to hear some feedback on the mod. Please report any buggs or errors, and enjoy the mod. I spent a crazy amount of time making it just right.\r\n\r\n===============\r\nSkyrim Nexus Link - http://skyrim.nexusmods.com/downloads/file.php?id=9334\r\n\r\nSteam Workshop Link - http://steamcommunity.com/sharedfiles/filedetails/?id=10817\r\n\r\nYoutube video tour of the mod - http://www.youtube.com/watch?v=A3vVdc3U5Sw&feature=youtu.be\r\n==============\r\n\r\n++++++++++++++\r\nSpecial Notice\r\n++++++++++++++\r\nThe steward of Solitude will still sell you proudspire mannor and allow you to upgrade it, however this will have no effected on the \\\"pimped out\\\" model. The mod will give you access to the house from the start of the game, with no special requirements needed. So don\\'t waste your money :)\r\n \r\n\r\n",
  "categoryId": "68",
  "version": "1.1",
  "author": "Jopon",
  "createdUnix": "1329103857",
  "updatedUnix": "1329343906",
  "containsAdultContent": false,
  "uploadedBy": "Jopon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31741",
      "name": "Pimp my Proudspire v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "95",
      "fileName": "Pimp my Proudspire v1_1-9334-1-1.zip",
      "uploadedUnix": "1329343906",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/37400696df10cdb66c442a8be372708a8ba08767345015124cf329ca17f95f95/analysis/1406685558/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pimp%20my%20Proudspire%20v1_1-9334-1-1.zip?fid=31741&ttl=1535768806&ri=8192&rs=8192&setec=9ad4504fcc416e7f3467b6aa2ab3937a"
    }
  ]
}