{
  "modId": 93347.0,
  "modName": "World of Rudra - Remastered - DELETED",
  "summary": "New Lands, created by : Bee9999. World of Rudra is a open world DLC. Travelling around an awesome and huge country inspired by Asian folklore and legends.Giving an amazing story and quest line, And possible the origin of the Blades.  ( All Credit goes to Bee9999. I wished to uploaded it to Nexus mods so this mod can be heard of and explored. )",
  "descriptionHtml": "[color=#4169e1]((( Please Note That All Credit Goes To - Bee9999 -. I Say This So Nexus Mods Doesn't Delete This Mod And Ban Me For Sharing Old Content. )))\n<br />\n<br />((( Bee9999 Website : http://bbs.3dmgame.com/forum.php?mod=viewthread&amp;tid=4782404 ))) + You may need Google Chrome to translate.\n<br />\n<br />((( Enjoy the New Lands )))\n<br />\n<br />-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n<br />\n<br />1.75 version update log ------------------------------------------[/color]\n<br />\n<br />- Fix some bugs \n<br />\n<br />\n<br />\n<br />[color=#4169e1]Version 1.7 update log ------------------------------------------ [/color][color=#4169e1]- mainly before The details of the old content are further improved [/color][color=#4169e1]- perfect the entire map scene [/color][color=#4169e1]- the third chapter is still in the process of writing, this version of the [/color][color=#4169e1]plot is not updated [/color][color=#4169e1]1.6 version of the update log --------------------- --------------------- [/color][color=#4169e1]- BUG to fix the initial task without task indicator [/color][color=#4169e1]- Fix the bug that Dahaka's door can't pass [/color][color=#4169e1]- Fix some models that will lead to CTD [/color][color=#4169e1]- The city has added some merchants [/color][color=#4169e1]- a small part of the area has joined the indoor scene [/color][color=#4169e1]- adjust the scene tones, try to be compatible with most ENB [/color][color=#4169e1]- fix bugs that collect no meat and no task indicators [/color][color=#4169e1]- scenes add some details of the object [/color][color=#4169e1]- the first chapter can still be after the end Return to the Atacama Desert area through a dialogue with the NPC at the Helmet City Pier [/color][color=#4169e1]- after the end of Chapter 2, you can still return to the Spring Island by talking to Andy in Old Haldane [/color][color=#4169e1]- after the end of Chapter 2, you can pass and Andy Haldane old lavender farm destined for dialogue [/color][color=#4169e1]after TES5EDIT lOG log inspection and examination, has been to achieve zero error, such as [/color][color=#4169e1]MOD found in the course of any errors, please upload the report, I will be the first time to adjust and repair after seeing the [/color][color=#4169e1]1.5 version due to negligence on the production of lead BUG, MOD can not be carried out smoothly, in this sincere apology! [/color][color=#4169e1]Thank you again for taking the time to experience the mod I made! [/color][color=#4169e1]Enjoy ![/color][color=#4169e1]\n<br />[/color]\n<br />[color=#4169e1]\n<br />[/color]\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[color=#ff0000]1.5 version[/color]\n<br />\n<br />\n<br />1. Fix the desert vision problem 2. Fix the desert map problem\n<br />3. Fix some task flow logic problems\n<br />4. Fix the dialog trigger problem, now you can start the task without archiving - reading the steps.\n<br />5. Greatly trimming the desert The scene, the original design of the content is initially presented\n<br />6. Now walking in the desert will have the effect of heat waves\n<br />7. Desert added sandstorm climate, epic spectacular desert wonders! \n<br />8. Since this version, because the project file is huge, I started to use the ESM file to update[color=#ff0000] (note! Very important! If you have already run the 1.1 version of the archive, you can't use it anymore! You must use an archive that has not run this mod or new Open the file to run normally!)[/color]\n<br />9. Start using the ESM file as the MOD master file, which perfectly solves most of the jump-out problems.\n<br />10. Modify some of the original confusing scenes.\n<br />11. Currently it is basically a stable version, and there may be small. Updates, such as the ability to wear equipment and other types of updates, big updates, look at the situation, production is too time and energy.\n<br />12. Field increase BOSS\n<br />13. Lavender Manor in the second chapter after the end in the old Haldan to find Andy Can be transferred in.\n<br />\n<br />\n<br />\n<br />Here are some updated maps of the 1.5 version, the grand and epic battle of the sandstorm!\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[color=#4169e1]-------------------------------------------------- --------------------------------2015.5.9[/color]\n<br />[color=#4169e1]\n<br />[/color]\n<br />[color=#ff0000]Version 1.1[/color]\n<br />[color=#ff0000]\n<br />[/color]\n<br />[color=#4169e1]Update log[/color]\n<br />[color=#4169e1]1. finished the main conversation[/color]\n<br />[color=#4169e1]2. Fixed some scene models that may lead to CTD[/color]\n<br />[color=#4169e1]3. Fixed the problem of BSA resource package reading. Now you can extract it directly into DATA without modifying any ini file. You only need NMM to load ESP to read MOD content completely.[/color]\n<br />[color=#4169e1]4. Fine-tuning the blood volume of the miscellaneous soldiers, so that the miscellaneous soldiers are more likely to be killed. The miscellaneous soldiers only play the role of adjusting the atmosphere of the dungeon. They should not let the players waste too much time on the mixed soldiers.[/color]\n<br />[color=#4169e1]5. Enrich scene details, followers with life AI package can now perform life actions in some scenes, such as catching insects, catching fish, or sitting, lying, leaning, etc.[/color]\n<br />[color=#4169e1]6. Fixed an issue where some conversations could not be triggered.[/color]\n<br />[color=#4169e1]7. Fixed an issue where terrain LOD could not be displayed.[/color]\n<br />[color=#4169e1]8. Adjust the color of some scenes to make it more natural[/color]\n<br />[color=#4169e1]9. Fixed NPC black face problem, now NPC can display face shape correctly[/color]\n<br />[color=#4169e1]10. Optimized part of the scene model to improve performance[/color]\n<br />[color=#4169e1]-------------------------------------------------- ------------------------[/color]\n<br />\n<br />[size=5]MOD task problem Q &amp; A[/size]\n<br />\n<br />-------------------------------------------- -----------------------------\n<br />[color=#ff0000]Q: How to start MOD[/color]\n<br />[color=#ff0000]A: Please see the picture guide[/color][color=#ff0000]Q: Why can't I open the dialogue for task[/color][color=#ff0000]A : After reading the file, you can read the file again.[/color][color=#ff0000]Q: Why is the first dungeon scene in the desert so black?[/color][color=#ff0000]A: Please bring a torch or use candlelight. The dungeon is designed to enhance the atmosphere, so the overall light source is dimmed. The light source is placed at the transfer point to avoid finding the road.[/color][color=#ff0000]Q: Why do I have no tasks after I hand over the book to Basama?[/color][color=#ff0000]A: Please talk to Dalal. Dalal has two dialogue options, one triggers the task of submitting books. A trigger meets the King's mission[/color][color=#ff0000]Q: Why do I pass through the wind wall, but I can't pass the door of Dhaka[/color][color=#ff0000]A: The correct process: After passing the wind wall, come to the door of Dahaka with the gargoyle statue, activate the two sides respectively The constellation stone, a magical array in front of the door, has the effect of 3 flame spells. This is actually a task prompt. At this time, the first door will open, the enemy soldiers will appear, and after clearing the enemy soldiers, facing the second layer of black. Door using arbitrary flame spells (note [/color][color=#ff0000]Do not stand too close, will be killed), the door will open, enter to end the first chapter[/color][color=#ff0000]Q: Why can't you submit the forged core and gear[/color][color=#ff0000]A at the[/color][color=#ff0000]beginning of the second chapter[/color][color=#ff0000]: near the hot air balloon, not far from the left Location, there is a box in the range of about 10 steps, just in the grass, the box has the core and gear needed for the task (I will not design a task that needs to find the world, any task can find the completed method nearby) After taking the core and gear to Andy, you can use any flame spell on the hot air balloon engine (can be used continuously, there will be continuous explosion, very fun)[/color][color=#ff0000] Q: The second chapter is transmitted on an island after passing , no task[/color][color=#ff0000]\n<br />[/color]\n<br />\n<br />\n<br />\n<br />\n<br />[color=#ff0000]\n<br />[/color]\n<br />\n<br />\n<br />[color=#ff0000]\n<br />[/color]\n<br />\n<br />\n<br />[color=#ff0000]\n<br />[/color]\n<br />\n<br />\n<br />[color=#ff0000]\n<br />[/color]\n<br />\n<br />[color=#ff0000]\n<br />\n<br />[/color]\n<br />[color=#ff0000]A: The second chapter is about to open on the small island. I talk to the fisherman on the side of the boat to help collect the meat. There are a lot of meat on the beach. After collecting it, [/color][color=#ff0000]I [/color][color=#ff0000]can send it to the fisherman and transfer it to the big island. [/color][color=#ff0000]Q: I can't find it. Axe Master Xuanjue [/color][color=#ff0000]A: The axe is at the bottom of the nearby waterfall[/color] ------------------------------------ ---------------------------- [color=#4169e1]Outline Planning Case ------------------- -------------------------------------------------- ------- [/color][color=#4169e1]Spring Island sets the [/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]world location: Southeast of the mainland, away from the mainland of the archipelago [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]. Landform: Subtropical island landform [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]weather system: Located on the edge of the continental westerly belt, most of the time is sunny, but occasionally hangs Violent storm [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]vegetation type: tropical subtropical vegetation [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]population: the [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]main city [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]of mysterious race from the eastern continent of Sicsia [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]: None, mainly scattered village clusters, limited by the size of the island and resources, not suitable for the establishment of dense population gathering areas [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]species: located in tropical and subtropical edge of the area, warm and humid climate, abundant species[/font][/color][color=#4169e1] on RedBlade [/color][color=#4169e1]Redblade called red edge, Sigg West Asia a very strong [/color][color=#4169e1]Forces, reportedly blade from Tamriel will be established 400 years ago in Sikh immigrants to the West. [/color][color=#4169e1]After immigrating 400 years ago, it will cut off all connections with the original blade. After 400 years of evolution, it has developed a society with its own unique cultural characteristics. Although it inherits from Tamriel's blade, they do not admit that they are The descendants of the blade will. [/color][color=#4169e1]They are very close to DAHAKA forces [/color][color=#4169e1]about Force[/color]\n<br />[color=#ff0000]\n<br />[/color]\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[color=#4169e1]\n<br />[/color]\n<br />[color=#4169e1]\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[/color]\n<br />\n<br />\n<br />[color=#4169e1]Force is the \"source force\", which is different from magic, and approximates the strength of the Nordic dragon language. It emphasizes the unity of weapons and human beings, emphasizing the overall coordination ability of the body, that is, \"body skills\", cultivation to the present People can even use a branch to make a powerful position [/color]\n<br />[color=#4169e1]: the [/color]\n<br />[color=#4169e1]Cloud Temple: built by the source cultivator, surrounded by the sea on the three sides of the mountain, is a secluded place to practice Jinshang [/color]\n<br />[color=#4169e1]Island: it was red cultivation base edge, after unknown reasons abandoned, but there are still members of the red edge activities on the island [/color]\n<br />[color=#4169e1]Samana: red edge port base, red edge forces headquarters in the spring Island [/color]\n<br />[color=#4169e1]\n<br />[font=Verdana, Helvetica, Arial, sans-serif]Atacama desert setting [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]world Location: The central part of the mainland, the throat of the mainland traffic, connecting the east and west continents, the northwest is the sea, the route through the [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif][font=arial]extremely[/font][/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif] cold land can reach the [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif][font=arial, 宋体, sans-serif]land of the Skyrim[/font][/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif] and [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif][font=arial]Morrowind provinces[/font][/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif] in the [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif][font=arial, 宋体, sans-serif]Tamriel continent[/font][/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif] : the [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]weather system in the [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]temperate desert region [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]: windy sand, often It will blow up dust storms, but most of the time is sunny with no clouds or few clouds. The temperature difference between day and night is large. At night, due to the low amount of impurities in the air, the moonlight is particularly bright. There is no need for lighting tools for walking at night. People living in the local area are like [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]To travel at night will select the departure [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]vegetation types: temperate desert vegetation [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]composition of the population: Hongwei people, people of Brighton, a small number of Nords, occasional race from the mysterious oriental continent to visit [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]major cities: the port city of Akko, brilliant Harka, the god of Dahaka, the capital of the Zahhak [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]creatures: [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]1. Desert wolf: short hair, yellowish coat color, is a very good protection color, ferocious, aggressive, like group hunting [/font][/color][color=#4169e1][font=Verdana, Helvetica, Arial, sans-serif]2. Desert Charus: A mutated giant insect, native to the province of the sky, has mutated after coming to the desert, adapts to the local dry natural environment and is more aggressive, hi-slow, afraid of light, generally hidden in dark caves and ruins in[/font][/color][font=Verdana, Helvetica, Arial, sans-serif][color=#4169e1]\n<br />[/color][/font][color=#4169e1]\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[font=Verdana, Helvetica, Arial, sans-serif]3. Mummy: There is a custom of burying a dead person into a mummies. The locals believe that people can live forever after they become mummy. Although most mummies are only a dry corpse after burial, there is an evil force through one. The way of contracting with the demon god Dahaka makes the mummies resurrected and becomes a tool of their aggression. The mummies usually appear in the ruins. There are not many witnesses [/font]\n<br />\n<br />[font=Verdana, Helvetica, Arial, sans-serif]on the [/font][font=Verdana, Helvetica, Arial, sans-serif]surface. [/font][font=Verdana, Helvetica, Arial, sans-serif]Dahaka: [/font]\n<br />[font=Verdana, Helvetica, Arial, sans-serif]Dahaka is a demon god, in charge of the desert abandoned by the gods. With the ability to control the dust dragon and the ability to control time, Dahaka has the ability to imprison the soul, so that the soul can be attached to the corrupt body forever free. Dahaka rarely participates in mortal affairs, but has many believers. During the sacrifice, the believers put the slaves captured by the war on a huge fire to sacrifice. The believers believe that the soul of the human being is the only thing of interest to the Dahaka demon. [/font]\n<br />\n<br />[font=Verdana, Helvetica, Arial, sans-serif]About the Dahaka believers: [/font]\n<br />[font=Verdana, Helvetica, Arial, sans-serif]believers in Dahaka, the power is extremely strong. a state-established country, a state-administered system of administration and teaching, with very evil religious teachings Advocating the use of force and living sacrifices, originally the same true gods as other indigenous aborigines, historically differentiated for some reason, and when they finally appeared in the desert, they claimed that they believed in the only true god Dahaka, other heretical beliefs. The flames must be used to purify [/font]\n<br />[font=Verdana, Helvetica, Arial, sans-serif]the area where Dahaka believers live. The sun is black, but it shines brightly around. The believers call it Black sun. They built their own civilizations and beliefs in the deeper desert hinterland and developed through aggression. Very fast and powerful[/font][/color][color=#4169e1] --------------------------------------------- ------------------ [/color][size=5][color=#ff0000]1. Installation requirements[/color][/size][color=#4169e1] Game No. 13 patch 1.9.32 version exe [/color][color=#4169e1]does not require other pieces of information to [/color][color=#4169e1]run the requirements \n<br />\n<br />[/color][color=#4169e1]1. Before running MOD, it is recommended to back up the archive or open File, it is recommended to use pure archive to avoid CTD to the greatest extent[/color]\n<br />[color=#4169e1]2. Considering the need to open a new file to run MOD, the monster level is not set too high, the monster level is fixed, the level is set between 15 and 30. [/color]\n<br />[color=#4169e1]3. It is recommended to use NMM to load MOD, I have not used MO, It's not clear how the MO is loaded. [/color]\n<br />[size=4][color=#ff0000]4. Load the MOD into the game and archive it once, then read the file immediately, then you can fully load the MOD content (important! Solve the problem of not being able to open the conversation, and fully load the task information, if not After the archive-reading step, the task will not be read completely!)[/color][/size][color=#4169e1] ---------------------------------- - [/color][color=#4169e1]2. installation [/color][color=#4169e1]2.1 installation Procedure [/color][color=#4169e1]Download the RAR file and extract the [/color][color=#ff0000]BSA [/color][color=#4169e1]and[/color][color=#ff0000]ESP [/color][color=#4169e1]file to the next DATA folder, NMM can be loaded, MO BSA resources you need to tick the options package [/color][color=#ff0000]with the package JPG picture tips on how to begin the task [/color][color=#4169e1]to save and close the document [/color][color=#4169e1]open NMM, load mod, because basically do not modify the original, sort random [/color][color=#4169e1]2.2 to correct the [/color][color=#4169e1]old problem of [/color][color=#4169e1]floating grass [/color][color=#4169e1], if the relevant INI has been modified before the floating grass, exit and re-read after the archive can be resolved [/color][color=#4169e1]2.3 compatibility [/color][color=#4169e1]does not modify any game underlying data, script , tasks, global parameters, very small modifications to the original field [/color][color=#4169e1]----------------------------------------------- [/color][color=#4169e1]3. Start MOD [/color][color=#4169e1]finds a mysterious character in the pharmacy of Xuemancheng to start the task ( [/color][color=#ff0000]please check the JPG picture with the specific location[/color][color=#4169e1]). [/color][color=#4169e1]    Note: If you can't open the conversation, log out and then re-read the file to solve the problem.[/color]\n<br />[size=4][color=#ff0000]\n<br />[/color][/size]\n<br />[color=#4169e1]After opening the New World mission, there is a Travel to new world task in the task to locate the NPC. [/color]\n<br />\n<br />[color=#4169e1]    Note: Because the bsa resource bundle is a compressed file, the reading will be slightly slower. If the game does not respond, please wait patiently [/color]\n<br />\n<br />[color=#4169e1]--- -------------------------------------------------- -- [/color]\n<br />[color=#4169e1]4. Possible BUG [/color]\n<br />\n<br />[color=#4169e1]  4.1 CTD: Due to the large amount of models and independent production by me, some models may have problems. The specific performance: CTD (flashback) occurs after some models, if these are found Please take a screenshot and upload the report. [/color]\n<br />[color=#4169e1] \n<br /> 4.2 Conflict: Because most of the content is new, the possibility of conflict is very small, but it does not rule out the possibility of MOD conflict. Some modified the MOD of the snowman city layout and modified the helmet city pier. MOD may cause conflicts [/color]\n<br />\n<br />\n<br />[color=#4169e1]--------------------------------------------- ---------- [/color]\n<br />\n<br />\n<br />[color=#4169e1]5.MOD reference resources and acknowledgement [/color]\n<br />\n<br />[color=#4169e1]No, the original model of calling other people's works has been deleted [/color]\n<br />\n<br />\n<br />[color=#4169e1]----------------------- -------------------------------- [/color]\n<br />[color=#4169e1]6. About ENB [/color]\n<br />\n<br />[color=#4169e1]try to use the original color of ENB, the color of the ENB will appear color Oversaturated situation [/color]\n<br />\n<br />\n<br />\n<br />[color=#4169e1]------- ------------------------------------------------ [/color]\n<br />\n<br />[color=#4169e1]7. Note: The copyright of the resources used in this MOD belongs to the copyright owner. Please do not forward or divert it. This MOD should not be used for any commercial purposes. If there is any infringement, it is not used by me. This MOD is only used for free communication and sharing. &lt;-- [/color]",
  "categoryId": "30",
  "version": "1.75",
  "author": "Bee9999",
  "createdUnix": "1535577889",
  "updatedUnix": "1535577889",
  "containsAdultContent": false,
  "uploadedBy": "J0kedNexus",
  "primaryFile": null,
  "files": []
}