{
  "modId": 93354.0,
  "modName": "Espada Harkon's",
  "summary": "A espada de Harkon como uma espada vampírica conhecida como Blood Matron.",
  "descriptionHtml": "[url=https://www.nexusmods.com/skyrimspecialedition/mods/12902/?]VERSÃO DA EDIÇÃO ESPECIAL[/url]  DA SKYRIM  \n<br />\n<br />DESCRIÇÃO:\n<br /> Esta é uma Tradução total da Espada de Harkon, a partir do qual você pode estar à sua disposição.  Isso é que é um substituto.  Matrona de Sangue será uma espada que o Harkon está carregando para você usar este mod.  Quando você está cansado, ele está tentando matá-lo.  Boa sorte com isso.  \n<br />\n<br /> [u]\n<br />MUDANÇAS: Os[/u]\n<br /> males aumentaram apenas à força principal da arma sendo os poderes relacionados com o sangue: De 8 a 11 Peso expandido para a espada estar pesada de sangue: De 9 a 15 de \n<br /> \n<br />\n<br />\n<br />  \n<br />\n<br />Velocidade aumentada para a propagação tendo alguma vez velocidade vampírica e sendo mais rápida que uma lâmina normal:\n<br /> De 1 a  1.10  \n<br />\n<br />Quando empunhada por criaturas menores  [i](não é Vampiros)[/i]  , Sangue Matrona afunda uma preséa e sua constante bebe seu sangue:  \n<br />Sede da Matrona de Sangue  - Como um não-vampiro, o Sangue Matrona está a ser feito com o seu sangue  50 DMG  para  Max Health e 25% DMG para Heal Rate  \n<br />\n<br />Quando empenhou pelo meritório  [i](Vampiros)[/i]  , uma Matrona de Sangue compartilhou o que é derramado de sua boca com o vampiro empunhando-o, assim se alimentando e o vampiro: \n<br />Derramamento da Matrona de Sangue - Como um vampiro, você é alimentado e curado pelo sangue derramado da boca da Sangue Matrona sempre que beber  [i](Exsanguinato)[/i]  .  \n<br />\n<br />Estes são dotados por Matrona de Sangue para quem quer que um  \n<br />uso  :  Exsanguinado  - 7% Chance de Matrona de Sangue se empanturrar nenhum sangue de seu oponente, recarregando um pouco de seu poder  [i](como uma gema da alma faria)[/i]  e drenando seu sangue.  Esta chance é aumentada para 12% se você for um vampiro e também irá alimentar e curar você.  \n<br />\n<br />Coagulação  - 7% Possibilidade de Matrona Sanguínea solidificada por sangue vivo paralisante-o.  \n<br />\n<br />Hemocinese - 7% Possibilidade de Blood Matron manipular o sangue de vivo e divertir-lo para jogá-lo.  \n<br />\n<br />Curva de sangue - 7% de chance de um Blood Matron infectar um alvo com o seu próprio sangue, para que seja útil depois das suas ações.  Ser exercitado por um ser humano fornece mais sangue, permitindo que uma Matriz de Sangue tenha uma  chance  maior  [i](12%)[/i]  de usar este poder.  33% de chance geral para [i]atingir as[/i] habilidades da Matrona de Coragem desencadear em uma briga. [u]Ábaco:[/u] Você precisa de um PC e você Dawnguard ... mas não o ábaco. [u]INSTALAÇÃO:[/u] É melhor usar a opção “DOWNLOAD NMM”. \n<br /> \n<br /> [i][/i]   \n<br />[u]\n<br />\n<br />[/u]\n<br /> \n<br />[u]\n<br />\n<br />[/u]\n<br />\n<br />\n<br /> \n<br />[u]\n<br />\n<br />[/u][u]\n<br />[/u]",
  "categoryId": "55",
  "version": "2.0",
  "author": "Nathan",
  "createdUnix": "1535636999",
  "updatedUnix": "1535636999",
  "containsAdultContent": false,
  "uploadedBy": "DrTrevas",
  "primaryFile": null,
  "files": []
}