{
  "modId": 93352.0,
  "modName": "True Armor Fantasy Preset",
  "summary": "All credit to True Armor by Anubis22.<br />Preset based on several lore-friendly archetypes of races to related armors plus sprinkle of imagination on my part",
  "descriptionHtml": "Personal tweak of settings of True Armor to roleplay better\n<br />\n<br />True Armor does melee damage wonderfully but doesnt cater much to mages. To work around that i started playing with the settings in the MCm. Then it kinda evolved to this mod. It changes the armor all to fit their particular race of origin in addition to considering possible builds and setups players may run throughout the game. Summary of what each armor protects: \n<br />\n<br />[b]Hide/leather/scale - [/b]Offers low protection against melee and resistant to shock and ice. Can be damaged easily by fire magics\n<br />[i]Made from animal hides which are highly flammable and weak to weapons. Scale would be slightly better but still weak to human weapons/fire\n<br />[/i]\n<br />[b]Iron[/b] - Offers medium protection against melee and resistant to fire and ice. Shock magic can pierce it at reduced damage as iron does not conduct well. Arrows can also land a hit.\n<br />[i]Roughly crafted armor. Has many gaps and cloth components. Arrowheads are made of iron too or stronger materials[/i]\n<br />\n<br />[b]Elven[/b] - Spell resistant withchunters. Also well crafted against close combat to further counter the Imperial Empire's resources\n<br />[i]Elves are the best at spells so they have best knowledge to weave armors that nerf magic\n<br />[/i]\n<br />[b]Dwarven[/b] - Tank. Think Iron Man\n<br />[i]Dwarven people were thinkers, a peaceful race. They would have prepared their Dwemer material resistant against specialties by other races considered they were not the best warriors and would not survive attack[/i]\n<br />\n<br />[b]Orcish [/b]- Bruisers. To charge without a worry. But weak to magic and arrows from a distance.\n<br />[i]Easily countered by a skillful archer or mage to take them down before they can get in melee range[/i]\n<br />\n<br />[b]Daedric and Dragonscale[/b] - A second skin.\n<br />[i]Dragonscale inherits the dragons strength such as resistant to blades and most magic. But also its weaknesses; Arrows[/i]\n<br />[i]Daedric is probably a semi- organic armor that comes from the realm of the daedra(a twisted place where armors would likely be made like this fitting with glimpses of the realm in the games). It is mostly resistant against mortal weapons and magic. But can be pierced by strong shock magic(the strongest magics are learned from the daedra)[/i]\n<br />\n<br />[b]Ebony[/b] -[i] [/i]Mystic knight. \n<br />[i]Strong flat armor pieces offering hard protection. However the material can be pierced by concentrated hits on the wide surfaces such as arrows or sustained magic.\n<br />[/i]\n<br />[b]Steel Plate and Dragonplate[/b] - Plates. Jingle jangle\n<br />[i]Steel Plate is a strong mid game armor. But metals conduct, so weak to shock magics\n<br />Dragonplate protects against arrows unlike dragonscale, but as a result can get bashed in by blunt weapons or strong magic\n<br />\n<br />[/i][b]Block [/b]- 100 percent\n<br />[i]Passive block off chance of 10 or so\n<br />Block when attacking higher chance due to active combat awareness of a well trained fighter(roleplay reason)\n<br />[/i]\n<br />Feel free to tweak using this as base. Any feedback would be helpful too. Give endorsements to original mod author. Requires original mod of course.",
  "categoryId": "77",
  "version": "1",
  "author": "Anubis22 True Armor based",
  "createdUnix": "1535606406",
  "updatedUnix": "1535606406",
  "containsAdultContent": false,
  "uploadedBy": "VergilDevilMode",
  "primaryFile": null,
  "files": []
}