{
  "modId": 93383.0,
  "modName": "Northwind Quarry",
  "summary": "Northwind Summit is now a fully open quarry complete with a cosy little house with a lovely northward view!",
  "descriptionHtml": "Anyone remember Northwind summit? If you've never heard of it, its a Dragon's lair just to the northeast of Shor's Stone. I always found the place unique because it looked very much like some kind of quarry which the Northwind Mine opened out onto. So I decided to run with that idea. The entire area has been rebuilt not just into a quarry but also a home located within that quarry, a snug two story cosy house with everything you could need. \n<br />　\n<br />Currently the place isn't set up to house children. I was going to add that feature in but I didn't think it made roleplaying sense as its a very dangerous, isolated area. You can move your spouse in there with various mods if you like. If there is a demand for it I might consider adding a children's area in a future update though.\n<br />The changes to this area include removing the dragon and enemy spawns, making the place not respawn and removing the loot chest. That was unfortunately necessary in order to make it a viable home. The word wall will still give you its word however. Enjoy! And please leave a message detailing any bugs or future improvements you'd like to see.\n<br />　\n<br />This mod should be compatiable with everything say mods that alter Northwind Summit, obviously",
  "categoryId": "67",
  "version": "1",
  "author": "Koji Okida",
  "createdUnix": "1535801510",
  "updatedUnix": "1535801510",
  "containsAdultContent": false,
  "uploadedBy": "Koji Okida",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000280919",
      "name": "Northwind Quarry",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "98",
      "fileName": "Northwind Quarry-93383-1.zip",
      "uploadedUnix": "1535801477",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/fc59b26c1566a503238650c51d4431e7c8ccca3297208886d57a0f87c14c6000/analysis/1535801582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Northwind%20Quarry-93383-1.zip?fid=1000280919&ttl=1535884738&ri=8192&rs=8192&setec=dfb42a5d1acecfaa779da48d6d1094e7"
    }
  ]
}