{
  "modId": 93406.0,
  "modName": "Winterhold Restored",
  "summary": "Restored ruined houses into shops, a stable with 4 horses, adds custom-voiced merchants, a Player cabin, a protective stone wall around the town.",
  "descriptionHtml": "Sure, there are other Winterhold mods, but I didn't like any of the ones I saw. Why add MORE USELESS RUINS??? How about we actually RESTORE the City already! Although \"The Great City of Winterhold\" is good at one thing: inspiring the immense former grandeur of the once-powerful and famous City-State.\n<br />\n<br />I've been working on this mod for several years now on and off, and actually scrapped it 3x and started over. Finally decided to research some of the actual [url=http://elderscrolls.wikia.com/wiki/Winterhold_(City)]history of Winterhold[/url] (which I found really interesting!) and incorporate some of that into the mod... somehow. So that's for the future.\n<br />\n<br />[b][color=#00ffff]Right now:[/color][/b]\n<br />1) Turned the ruined houses into shops-homes, with custom-voiced merchants\n<br />   ﻿- New custom signs too!\n<br />2) Protective stone wall around it to keep out that frigid wind!\n<br />3) Player cabin, Snowstone Lodge, done up like a Mage's home\n<br />4) Stable with 4 horses (currently free, but future will make that guy a horse merchant)\n<br />5) CW and any other markers in the ruined houses were shifted just out of the way\n<br />6) Navmeshes were adjusted around the new buildings, fully tested and finalized\n<br />7) Fully Navmeshed new interiors for Followers\n<br />8) Several skulls, boulders, snow drifts, dead trees etc. disabled\n<br />\n<br />Player Cabin Key Location:\n<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/93406/93406-1535871822-1054390296.jpeg[/img]\n<br />\n<br />[b][color=#00ffff]TES5Edit Note:[/color][/b]\n<br />- Tes5Edit shows \"no errors\" but also shows a Boss/Loot note that \"9 triangles could not be undeleted\" and says it's dirty. I don't know if that's a problem, but the mod seems to run fine.\n<br />\n<br />[b][color=#00ffff]Compatibility:[/color][/b]\n<br />- Interesting NPCs - [b][color=#00ff00]YES[/color][/b], that guy sitting on a bench and his horse Frances\n<br />- Lord Quaxe's \"Winterhold Rebuilt\" - probably [b][color=#ff0000]NO[/color][/b], since he does a lot of the same things\n<br />- JK's Winterhold - [b][color=#ff7700]PARTIALLY[/color][/b] - he doesn't restore the ruined houses, but does add ruins\n<br />Any others I don't know.\n<br />\n<br />[b][color=#00ffff]Credits:[/color][/b]\n<br />New dialogue &amp; voicing - Anduniel (Anna Castiglioni)\n<br />[b][color=#00ffff]Modders Resources:[/color][/b]\n<br />Blary\n<br />Oaristys\n<br />Lilith\n<br />Elianora\n<br />Runspect\n<br />InsanitySorrow\n<br />Jokerine\n<br />Shrike - Canvas meshes and normals\n<br />Melt-In-Your-Mouth\n<br />TF - staff crafting table\n<br />Anna Castiglioni - some textures: bedding (with Runspect), pillows, canvas, rug",
  "categoryId": "53",
  "version": "1.0",
  "author": "Anduniel",
  "createdUnix": "1535869685",
  "updatedUnix": "1535869685",
  "containsAdultContent": false,
  "uploadedBy": "Anduniel",
  "primaryFile": null,
  "files": []
}