{
  "modId": 9378.0,
  "modName": "Multiple Marriages-Spouse Dress Up-Rehousing-And More",
  "summary": "Allow player to marry up to 100 npcs, with wedding scene, Player can change spouse&#39;s outfits by giving them weapon/armors via dialogue. Spouses can live in player defined house.",
  "descriptionHtml": "Man... haven&#39;t been visited this site for years. Unfortunately this is not an update, it is just a blind permission to  anyone who wants to reuse/port my mods, go ahead and don&#39;t need to ask my permission, as I am busy dealing with daily work and a 5 year old son :).\r<br />\r<br />Note that you still cannot use my mods for business purpose.\r<br />\r<br />Goodbye again.\r<br />\r<br />============================================================================\r<br />\r<br />Requirements:\r<br />All my current updating mods are developed under the skyrim steam version (currently 1.8.151.07) with DawnGuard and Hearthfire DLC. For this mod, I&#39;ve removed the dependency for Hearthfire in CK but not sure if it works for games that hasn&#39;t purchased Hearthfire. Version 1.21Beta requires DawnGuard.\r<br />\r<br />If you want spouse (or other NPC) to open a shop or cook, you may try my new mod.\r<br />\r<br />NPC Activity Scheduler\r<br />http://skyrim.nexusmods.com/mods/28103\r<br />\r<br />To change NPC clothes\r<br />The New Outfit Changer\r<br />http://skyrim.nexusmods.com/mods/11662/\r<br />\r<br />Other small mods:\r<br />The True Emperors Robe\r<br />http://skyrim.nexusmods.com/mods/28461/\r<br />\r<br />==============================     Version 1.2.0 Beta Update Note   =======================\r<br />New features:\r<br />                            Turn spouses to vampires (fake version)\r<br />If you&#39;ve gain Vampire Lord ability from Serana or her father, you can turn your spouses to a vampire by talk to them. To cure your vampire spouses, you will need to cure yourself first, then talk to them with at least 1 filled black soul gem in your inventory.\r<br />\r<br />          Differences between vampire spouses and normal spouses\r<br />Vampire spouses have typical red eyes, will thanks you for turning them to vampire. The most significant difference is that, vampire spouses have a different set of daily routing. They will try to sleep during daytime and become active at night. Please try to find a place with enough coffins for them...such as the vampire castle. At the moment no special spell or ability is added for vampire spouse because I have no plan to touch the follower part at least for now.\r<br />\r<br />Installation:\r<br />Standard NMM upgrade, or uninstall the old version first then install the new version.\r<br />\r<br />Instructions for new users:\r<br />Unfortunately version 1.0 and above are mostly menu driven, for so many reasons...so basically you will deal with menu options.\r<br />\r<br />Here assume that you&#39;ve installed correctly, you should be able to see a mod start notice at the top left corner when you enter the game.\r<br />\r<br />The first step is go to riften, temple of mara. you should be able to see the Shrine of Dudestia right next to the main table. You will also find two spell books at the table. If you fail to find them, that means some other mod has modified the mara temple environment, either uninstall that mod and try again, or uninstall this mod.\r<br />\r<br />The Shrine of Dudestia takes care of data migration from vanilla marriage system to multiple marriage system. Once you get marry with the vanilla system, you can use the Shrine to move your vanilla spouse to one of the multiple marriage slots. You can also reset the vanilla quest using the shrine so that you can have another wedding. The Shrine also provides the capacity information of the multiple marriage system, i.e. how many slots have been occupied.\r<br />\r<br />The Relocation Operator spell is used to relocate spouses. Every spouse has a unique marker which is used to define they living locations. After casting the spell, a menu will pop up to ask you which spouses you would like them to live around the place you are standing. Once selected, the spouses will be teleported to you and start living there.\r<br />\r<br />The NPC Operator spell is the main control spell for individuals. Cast it to a npc, a pop-up menu will let you to choose one of the following functions:\r<br />1. Potential Marry: add faction that is required for vanilla marriage quests to the NPC.\r<br />2. Marry: Directly assign the NPC to one of the multiple marriage slots.\r<br />3. Divorce: Remove the NPC from the multiple marriage system.\r<br />4. Inventory: Open NPC&#39;s inventory. If you give weapons and armors to NPC that is maintained by the multiple marriage system, the NPC will equip them. The mod system should be able to keep these items equipped all the time (small time delay to regear up when the NPC or the cell is reloaded).\r<br />\r<br />Version1.2 added:\r<br />You can turn your spouses to vampires via dialogue if you are a vampire lord. If you cure yourself after, you can cure your spouses by bring a filled black soul gem and talk to them.\r<br />\r<br />If you have problem getting the shrine and the spells because other mods change the temple of mara, try the following method:\r<br />1. press ~ to enter the command console\r<br />2. type: help &#34;Shrine of Dudestia&#34;, find the item id of the shrine, in my example, the id is 0B0012c5\r<br />[img]http://static.skyrim.nexusmods.com/mods/images/9378-1-1355235661.jpg[/img]\r<br />3. type: player.placeatme 0B0012c5 1, the shrine should show up next to you (remember to replace the item id).\r<br />4. type: help &#34;NPC Operator&#34; and &#34;Relocation Operator&#34; to get the item ids of two spell tomes,\r<br />5. type: player.additem([item id], 1) to get the spell tomes \r<br />[img]http://static.skyrim.nexusmods.com/mods/images/9378-5-1355235662.jpg[/img]\r<br />\r<br />================     Version 1.1.0  Update Note (Past, Present and Future)  =================\r<br />To all friends who are still interested in this mod:\r<br />\r<br />It has been a long time since I left Skyrim. In this half year, Dawnguard and Hearthfire were released, and I have received quite a few messages regarding the update of this mod. Apologies to the ones who have sent me messages but never received my reply.\r<br />\r<br />To be honest, I am a bit surprised that no one continued developing this mod, or provided a mod with similar functionality, since all scripts were released together with v1.0.0. I guess people with good scripting skills mostly aim to develop large DLCs. Well....I have no right to judge...\r<br />\r<br />Move on. This is a Hearthfire fix for version 1.0. Unfortunately I have no intention to fix 0.9 quest version, simply because this version is messed up by the DLCs and will take very long time to fix, and even if I fix it now, it is very likely to mess up again after a new DLC.\r<br />\r<br /> I only bought the DLCs 2days ago and finish the new quest link yesterday.  Haven&#39;t adopted any child yet, and only a small house is built.  So this fix is kinda temporary solution. Please leave a message if you still find it buggy.\r<br />\r<br />Regarding the future of this mod:\r<br />I guess many of you will ask my plan of this mod. At the moment I don&#39;t have a definitive answer. The reason I return this time is simply because I&#39;ve received many messages urging me to fix it since I left, especially after hearthfire. Right now I am on a month of vacation so I decide to see what is new in this game and what happens to this mod. Life is still busy for me and I don&#39;t have the energy or time to spend nights on modding any more due to aging and parenting. So the basic plan for now is to keep the current version compatible for as long as possible, and try to add some small stuffs if I can find some time (don&#39;t get too much hope :)).\r<br />\r<br />Regarding Serana\r<br />Looks like many of you want to marry Serana. But the fact that Serana has a unique voice type make a generic marriage system difficult to include her without changing her voice or mute her. Of course I can do that, but she will not be Serana anymore and basically lost all the meaning of marrying her. Another issue is that the vanilla marriage system of skyrim is ridiculously plain and doesn&#39;t suit Serana at all. So I won&#39;t include Serana in the current system, but will try to find a better solution for her (which again without any promise).\r<br />\r<br />Installation:\r<br />Uninstall 0.93 or 1.0 and install 1.1 in NMM. This will remove all the related quests that provided by 0.93.\r<br />\r<br />Usage:\r<br />Find shrine of dudestia in riften&#39;s temple of mara, next to the main table where you get marry, and two spell books on the table. Use the shrine and spells to control.\r<br />=================================       Old Info     =======================================\r<br />So this mod kinda comes to the end. I am not sure whether I will return to skyrim modding in the future (supporting a family is hard...), but if I can find extra time, I may meet you guys again after the release of DLC. As promised, I release all source code for this mod and you are welcome to do any modification you want and distribute it.\r<br />\r<br />===============       &#33;&#33;Version 1.0.0 (Read this before you install it)     ======================\r<br />I end up spent last two days implementing this version.\r<br />\r<br />So what&#39;s new in version 1.0.0. Well, in short, everything. This version is the version that &#34;if I can do it again, what it should be&#34;. I implemented everything from scratch, so now the system is completely driven by my own scripts. This means now you don&#39;t need to worry about conflict with other mods (multiple followers, other marriage mods, etc). The only modification this mod will do to other mod is that it need to reset the relationshipmarriage quest and wedding quest if you want to have another wedding (but not necessary, other marriage mod may reset it anyway, and you can always directly assign spouse as usual). \r<br />\r<br />In terms of functions, this version provides 100 spouse slots, with clothes maintaining system. Furthermore, each spouse has individual home marker, so if you have 10 mod houses, you can assign 10 spouses for each house. Instant marriage and divorce are provided also. By the way, 1.0.0 should be able to run together with previous versions, so in principle you have 150 slots.\r<br />\r<br />This version is menu driven, because that is the only way I can complete it in two days. Also because it is more clear for people who what to learn skyrim scripting. I&#39;ve already put source code in the release pack so if you are interested, check them in CK. Most of the functions are controlled by DudestiaMultiMarriages quest, and if you do a search of &#34;Dudestia&#34;, you will find most of the implementation in this mod.\r<br />\r<br />How to use it:\r<br />it is not necessary to uninstall previous version, because this version is essentially a complete new mod. Once install, go to riften&#39;s temple of mara, find Shrine of Dudestia and two spell book on the desk. All the functions are provided by the shrine and the spells. Initially all spouses controlled by this mod have their home defined at temple of mara, I would suggest you to use the relocation operator spell to redefine the home first. The housing mechanism in 1.0.0 is different from previous versions. Instead of ask spouse to move to a given house, in this version you need to define the house for each spouse. To do so, go to the mod house you want spouses to move in, cast the relocation operator spell, a menu will popup to let you choose which spouses you want them to move in this house. once you choose a spouse, he/she will be teleported to the house and live there.\r<br />\r<br />What 1.0.0 provides:\r<br />100 slots of spouses with clothes maintaining system. Each spouse has individual special house marker, so if you have 100 mod houses, you can assign each house with 1 spouse.\r<br />Direct marry and divorce is also available by spell.\r<br />\r<br />what 1.0.0 does not provide:\r<br />high priority force housing provided in 0.9.3\r<br />quests in previous versions\r<br />spouse shop and gold earning\r<br />\r<br />Known problem:\r<br />If a slot is empty, the name panel will display npc name that previously assigned to this slot, instead of empty slot.\r<br />\r<br />So if there is no serious bug in this version, I guess it is time to say a real goodbye, at least for now. Consider this version as a farewell gift.\r<br />\r<br />Dudestia\r<br />2012.5.5\r<br />\r<br />More about 1.0.0\r<br />1.0.0 is what a mod developer would call &#34;the core system&#34;. It provides all the core functions needed in the mod. Normally developer would replace the menu interface with a series of quests and call the core functions when appropriate. Unfortunately I don&#39;t have time to build up the quests so I use the simplest, menu interface instead. To scripting learners, this is actually a better example because everything is reduced to its simplest form. Of course to normal game players it is just not fun enough. But 1.0.0 never means to be used alone. Instead, I recommend player to use it as background supporting system for other marriage mods, e.g. Marriage Mod - To Have & To Hold at the steam workshop, or 0.9.3 of this mod, since 1.0.0 should have no conflict whatsoever with them. But in the end, the choice is up to you.\r<br />\r<br />========================================================================================\r<br />\r<br />This is actually my first mod (not only for skyrim ^_^;). Of course as a programmer in real life I didn&#39;t find it too difficult to understand the script language and implement it. However, since I did it in a hurry, a lot of small things were left behind. If you ask what will I change if I can do it again, here are couple of suggestions for people who want to further develop the mod.\r<br />\r<br />1. the current multiple marriages feature is implemented on top of the original scripts, making the mod easily conflict to other mods that change the same scripts. A better solution will be make a new quest that holds spouses/housing alias, and pass the LoveInterest alias in RelationshipMarriageFIN quest to the new multiple marriage quest after the wedding. In this case there will be no script conflict.\r<br />\r<br />2. use array instead of copy the code multiple times, although copying was not so bad once I got a template :).\r<br />\r<br />Goodbye & have Fun\r<br />Dudestia\r<br />\r<br />0.9.3 final update\r<br />what&#39;s new:\r<br />outfit maintainer added. Now your spouses should always put on the dress you give them.\r<br />dead spouse clean up. If a spouse die, his/her marriage and housing slots will be cleared for new spouse.\r<br />\r<br />Functions of this mod:\r<br />\r<br />1. Multiple merriages: once complete series of quest given by Dudestia, you can have multiple marriages, either follow the traditional way (get the amulet, propose, wedding, wait for couple hours, propose to another one...), or use the mara&#39;s bow/ force of mara spell to make a npc to be your spouse.\r<br />Dudestia provide associate services, i.e. reset your marriage status to single (in case something in the mod getting wrong), a poison to reset a NPC&#39;s status to be marriable, \r<br />and mara&#39;s bow / spell.\r<br /> \r<br />2. Spouse Clothes Changer and matainer: once married, you can change spouses&#39; dresses via dialogue, the dress maintaining system should  be able to keep them wear the dress and weapon.\r<br />\r<br />3. Spouse housing: You can ask spouse to live in your houses and faction headquaters. With &#34;Mark special house&#34; shout, you can define your own special house anywhere and ask your spouses to move in.\r<br />\r<br />4. Force Housing: The &#34;force housing&#34; spell forces NPCs to move in your special house marked by your shout, till you cast &#34;release force housing&#34; spell on them. The NPC is not necessary to be your spouses.\r<br />\r<br />Console cheat\r<br />bat completequests      complete all quests in this mod, find Dudestia outside blue plalace first and type in this command in console, then talk to dudestia to get the  force of mara spell and other stuffs.\r<br />bat clearmarriage                clear your marriage status to be single, you can also do this by talking to Dudestia once complete the quests\r<br />bat getbowmaterials      get all materials needed for the bow quest\r<br />bat marriable         make a npc marriable, remember choose the npc first and enter this command, same effect as &#34;secret poision of seduction&#34;\r<br />\r<br />\r<br />----------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />I am new to modding and cannot guarantee that my mod is 100% safe, and this mod is still in beta test, so please always backup your stuffs. \r<br />\r<br />This mod allows player to marry up to 50 npcs, all with wedding scene, allows all spouses to move from one house to another. Player can also change spouse&#39;s outfits by giving them \r<br />weapon/armors via dialogue. Since 0.9.3, spouses can live in player defined house.\r<br />\r<br />BY-Products and other mods:\r<br />NPC Clothes Changer and Maintainer\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=11662\r<br />\r<br />SM Solitude\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=12189\r<br />\r<br />Friendly reminder:\r<br />It feels strange :), but I would like to remind you that before any plan of endorsement, please make sure all the functions and items in this mod are working correctly. I know quite a lot of you will like the quests but due to many reasons (patch, other mods etc) the items and functions may not work properly, and in this case I don&#39;t think it is worthy enough for your endorsement, rather I would like a bug report from you.\r<br />\r<br />As couple of things being testing, and busy working in real life, the update will be a bit slower than before, I hope to provide something new every 1 or 2 weeks.\r<br />-------------------------------------------------\r<br />\r<br />To people who are too lazy for the quests\r<br />You can now use the completequests bat file in optional files to complete all quests in this mod, you will still need to talk to Dudestia to get the &#34;Force of Mara&#34; spell.\r<br />\r<br />To 0.9.3 users\r<br />You know where to find me:)\r<br />Only one quest this time, &#34;New Home&#33;&#34;\r<br />\r<br />This version integrates Multiple Marriages and Spouse Housing.\r<br />\r<br />------------------------------------------------\r<br />To 0.9.2 users\r<br />\r<br />This mod is now completely quest driven, i.e. all functions implemented in the mod will be presented to you via quests. So why not go in the game and see what has been changed. As start, you should receive a mysterious letter from the courier. If you haven&#39;t seen him, try get in and get out a house, or move to another city. If you still cannot see him, try the bypass version, it should start the quest automatically as soon as you enter the game. If not, say good bye to this mod and have fun with others, marriage is just a small adventure in your journey of Skyrim, right?\r<br />\r<br />You should be able to finish three new quests and receive some items. If you have any problem finishing the quests or using the items, please leave a comment.\r<br />\r<br />If you want to see the changes before finishing the quests, go to read the update note below, but why spoil the fun?\r<br />\r<br />For some user that never see the courier, just to test if the mod has been installed, go to console (...) and type in: \r<br />help &#34;mysterious letter&#34; 4\r<br />If the game can&#39;t find the letter, the mod hasn&#39;t been installed correctly.\r<br />IF the game can find the letter but you still haven&#39;t seen the courier, some other mod has modified the scripts.\r<br />\r<br />If you have problem finding the quest item for desperate of love, go to console and type\r<br />\r<br />showqueststages dudestiamodsecretofseduction\r<br />\r<br />this will list all the stages for this quest, with 1 means complete, 0 means not yet.\r<br />find the first one with 0, for example stage 20, and type\r<br />\r<br />setstage dudestiamodsecretofseduction 20\r<br />\r<br />this will get you pass that stage.\r<br />you can also use &#34;help dudestia&#34; to check the id of other quests in the mod and jump over stages if you have problem.\r<br />\r<br />\r<br />I&#39;ve just done a clean test with the original game and this mod only, the mod seems working fine. So if you have problem marry to multiple spouses, chances are other mod is conflict to this one, could be some new npc mods that associated with RelationMarriageFIN script.\r<br />\r<br />-----------------------------------------------------------------------------------------------------------------------------------\r<br />Requirements:\r<br />This mod requires the update.esm from official patch 1.4\r<br />\r<br />Known mod conflicts\r<br />1. Liina Companion\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=9071\r<br />issue: has problem dismiss follower.\r<br />\r<br />2. Marriage Mod WIP\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=11579\r<br />Both mods currently modify the existing marriage quest scripts, so I am pretty sure there is a conflict.\r<br />\r<br />3. Spouses can live everywhere\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=11370\r<br />------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />Installation:\r<br />simply install via NMM,\r<br />If you are not using any mod manager that can automatically load the plugins, extra the zip file and copy everything to &#92;Data (don&#39;t modify the directories), open skyrim launcher, choose data files, and load the multiplemarriage.esp. Here is an tutorial for how to enable plugin\r<br />http://www.youtube.com/watch?v=YatCiPBp1-A\r<br /> \r<br />If you&#39;ve installed the older version, please uninstall it first before installing the new one. \r<br />For NMM, it means to deactivate the old version and activate the new version.\r<br />**************************************\r<br />How to use it:\r<br />For 0.9.2: \r<br />Play the game\r<br />\r<br />**********************************************************************************************************\r<br />Update Note 0.9.2 (Spoiler Alert&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;)\r<br />\r<br />*******Spoiler Alert*******************Spoiler Alert**********************Spoiler Alert*****\r<br />\r<br />An update note will be handed over to you in-game, so here is just a catch up.\r<br />You should receive a letter from courier, which starts the initial quest &#34;Master of Relationship&#34;, \r<br />Followed by &#34;Desperate for Love&#34;, and finish with &#34;Marry Me&#33; Marry Me&#33; Marry Me&#33;&#33;&#34;\r<br />\r<br />Quest lines in details (use the journal objective system to see objective marks for the quest):\r<br />Master of Relationship: You receive a mysterious letter and ask you to see Dudestia for the help of your marriage. He is at Blue Palace courtyard, a kid. Through conversations he agree to help you but ask you to find him stolen poison first (not sure if the transform of dog and dragon work perfectly, please leave comments if you find any bug). Start the quest &#34;Desperate for Love&#34;\r<br />\r<br />Desperate for Love:\r<br />Talk to Dudestia again and he mentions that the poison is used to seduce people, someone that is desperate for love may be the thief. You should go to firstly Blue Palace (Solitude), then Bannered Mare (Whiterun), then The Hag&#39;s Cure (Markarth), and finally Haelga&#39;s bunkhouse (Riften) for the hints. use your objective tracking system for the items. once you get the strange empty bottle, return it to Dudestia. You can then ask him about the detail of the poison, and he will explain to you, and start providing you the poison.\r<br />\r<br />Marry me&#33; Marry me&#33; Marry Me&#33;&#33;:\r<br />After the second quest, talk to Dudestia and complain about still unable to marry people. He will ask you to get a list of materials for him in exchange for help. Once you have all the items, talk to him again and he will give you Mara&#39;s bow. You can now complain that the bow sometimes kill the npc, and he will give you the spelltome: Force of Mara.  \r<br />\r<br />After these quests, you should receive the following items:\r<br />Secret Poison of Seduction: use to add necessary factions for marriage\r<br />Mara&#39;s Bow: Force assigning NPC to be your spouse, If your marksman skill is too high, the bow may kill the NPC, try use iron arrow, and no sneak, don&#39;t use full power of the bow.\r<br />Spelltome Force of Mara (in beta version only): teach you the spell Force of Mara, an alternative way for Mara&#39;s Bow.\r<br />A update note 092: list the update of the mod.\r<br />\r<br />If you find anything strange with your marriage (cannot propose etc) go to Dudestia in-game to reset your marriage, or use the bow&#92;spell.\r<br />\r<br />***************************************************Spoiler Complete**************************************************\r<br />\r<br />console commands: forget the console, everything implemented in this mod will be presented to you by the quests. If you are crazy about console commands, good news is the bat wife, bat clearmarriage still works, but what&#39;s the fun of that??\r<br />\r<br />**********************************************************************************************************\r<br />Old Stuffs\r<br />---------------------------------------------------------------------------------------------------------\r<br />\r<br />To 0.9.1 users:\r<br />The file is now split into two versions, the default priority version make your spouse behaves as it was predefined in game, which means if spouses have quest that with higher priority, the ai package that provided by this quest will overwite the spouse AI and make them not staying at your house. \r<br />\r<br />The high priority version will let the spouse stay at home AI overwrite almost all other AI packs to make them stay in your house. But this will prevent them to follow you as follower, since the follower quest has a relatively low priority.\r<br />\r<br />at the moment the changing spouse outfits function is very basic and don&#39;t even have check for different items. so please don&#39;t give your spouse anything except armor and weapon. \r<br />\r<br />How to use it:\r<br />For 0.9.1 and older versions:\r<br />1. If you are still single, go to get marry as usual, after 4-5 hours (in-game time of course), the game will notice you that you are able to marry again. Do remember to ask your spouses to move house. Due to house space, the maximum allowed NPC for Solitude is 50, and 10 for all others.\r<br />\r<br />2. If you&#39;ve already married, go to console and type &#34;bat clearmarriage&#34;, this will clear your current marriage status, (i.e. You current wife will leave you and your house, see 3 for the fix) and reset the quest, start from buying the amulet of mara. For second marriage and forward you don&#39;t need to buy the amulet again, just wear the old one and say hello to another pretty. \r<br />\r<br />3. If you want to marry a npc that not yet available for marriage (or has been married to you but for some reason left, e.g. you used &#34;bat clearmarriage&#34;, and does not show the interest me dialogue), go to console, select the npc (click the NPC with left button of the mouse, you should see the id appears) and type &#34;bat wife&#34;, this will add necessary factions to the npc and allow marriage. You still can not marry some of the special npcs.\r<br />\r<br />4. Once you&#39;ve married, you can change you spouse&#39;s outfit via the given dialogue (see figure), This will open the spouse&#39;s inventory and allow you to give her items (just like follower). According to the function description, the spouse will wear the item forever unless you take it back from her inventory, but I haven&#39;t tested it yet. (the outfit could be still changed by other AI packs or quests).\r<br />\r<br />*************************************\r<br />Cheat:\r<br />All these cheats (except the directly assign house one, will be added in next version) are implemented as quest components in 0.9.2, so forget it.\r<br />\r<br />Sometimes wedding is exhausting, particularly if you have 50 of them. Here is a cheat. open your console, and pick your target (click the NPC, you should see the id appears), type &#34;ssq 21382&#34;, then type &#34;forcerefintoalias LoveInterestXXX&#34;, XXX is from 000 to 050. using the same way you can assign your spouse to a a house, just &#34;ssq 21382&#34; and &#34;forcerefintoalias SolitudeHouseXXX&#34;, you can replace the house name and id by yourself. you can check all the available slots by using &#34;showquestaliases 21382&#34;.\r<br />Using this way you may likely rewrite the behavior of some of special NPCs, i.e. astrid and make them stay at your house.  \r<br />\r<br />Some of the dialugue options still need to be tested so please leave comment if you find any bug, or can&#39;t run it at all.... \r<br />\r<br />----------------------------------------------------------------------------------------------------------------------------------\r<br />Known Issues:\r<br />1. If you hasn&#39;t ask your first spouse to your house after the wedding, it will prevent the &#34;assign to LoveInterest000&#34; dialogue event, and the mod will not work correctly. I will fix this in the next release, but at the meantime, try asking them to move the house as soon as the wedding finishes. If the mod is working, you should see a popup &#34;Assign to LoveInterestXXX&#34; dialogue box every time. (fixed 0.9.1)\r<br />\r<br />2. Some NPCs that with quest will stay in their quest place rather than you house even if you get marry and ask for moving. This is a protection for the quest line. Will see how to tweak this in the future. (semi fixed 0.9.1)\r<br />\r<br />3. The part that let spouse stays at their own house has not modded yet, so at the moment always ask them to live with you.\r<br />\r<br />4. If a npc has married you but been removed from marriage (e.g. use the bat clearmarriage), you may not be able to marry him/her again, this will be fixed in the next update. (fixed 0.9.1)\r<br />\r<br />5  if you are still wearing Mara&#39;s necklace the dialogue to marry will still pop up (fixed 0.9.1)\r<br />\r<br />6. shop option and meal option missing for some npc.\r<br />\r<br />7.  (thanks to UNSF0) when I try to give her equipment via the Present dialogue option. After the hugging animation, Aela kneels as if she is out of HP, but never recovers and cannot be interacted. Pressing ESC before choosing &#34;Do you like it?&#34; option seems to prevent this from happening,(bug confirmed, will check if this also happens to other npc or just Aela, Aela is special, you know)\r<br />\r<br />8. (Again thanks to UNSF0) Follower will not follow you if you as them to live with you. (fixed with the default priority version).\r<br />\r<br />9. If you give our spouses an item that is neither a weapon nor armor, for example a potion, they will drink it endlessly, this will be fixed in the next update (fixed 0.9.2).\r<br />\r<br />10. (thanks to OnyxNightBlack0) Dialogue missing voice for some npc when proposing (fixed 0.9.2 beta)\r<br />-----------------------------------------------------------------------------------------------------------------------------\r<br />user found bugs for the record:\r<br />Thank you guys&#33; Your supports are the most important things to keep me working on this mod.\r<br />\r<br />\r<br />Dropastone0 \r<br />I think I found a bug. I went a little nuts marrying all the hotties, just a little. So I told a couple of em I wanted to move to another home. They went through the proper dialogue but they just stood there. I went outside and waited 24 hours went back in and they were still standing in the same spot doing nothing. So I told them I wanted to move back and now they&#39;re back to normal. \r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />Notes from the developer\r<br />3-10-2012\r<br />Next update will be a big one that integrates multiple marriage, multiple followers, relocation anywhere, divorce all together. But as I work alone, the implementation will take some time.\r<br />\r<br />2-22-2012\r<br />IF you remember the required materials list for Mara&#39;s bow, the bow material is actually a Daedric bow, and with a daedra heart. The reason is that I was not sure would Mara support polygamy in skyrim. So the kid Dudestia may just lie to you, the force could come from Oblivion :)\r<br />\r<br />2-20-2012\r<br />I start to think that I should put back the single marriage as an option, and let the player choose either way. Funny that this mod does something I strongly against in real life. In the future I may use a quest to express my opinion on it.\r<br />\r<br />2-16-2012\r<br />just for the record, I am working on the quest dialogue driving system that performs all functionalities in this mod, which means in the future you won&#39;t need any console command to reset your marriage, etc.\r<br />\r<br />2-15-2012\r<br />\r<br />The outfit changing system is finally completed&#33; I always think of that, guess you guys too.\r<br />At the moment the new dialogues do not have voices (I don&#39;t even have a mic), but I add a hug animation that shows how much your spouses love your gifts :) \r<br />\r<br />So let&#39;s change the spouses&#39; outfits and get party then&#33;\r<br />------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />2-14-2012 (happy Valentine&#39;s day, not a good day for MULTIPLE marriages)\r<br />Look&#39;s like the basic functions of the mod are working, but still have couple of bugs. I will continue working on this mod and maybe extend it to a better quest, e.g. add option that let you get marry without the wedding (to be honest I am getting more and more annoyed by the weddings due to repeat debugging).",
  "categoryId": "35",
  "version": "1.21Beta",
  "author": "Dudestia",
  "createdUnix": "1329123899",
  "updatedUnix": "1354702272",
  "containsAdultContent": true,
  "uploadedBy": "dudestia",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30302",
      "name": "MultipleMarriage",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "149",
      "fileName": "MultipleMarriage-9378.rar",
      "uploadedUnix": "1329134477",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/6848d90ef88b1f5fc80e588831680986e9faf820a17ba9800dbe061a37fbe02c/analysis/1406676725/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MultipleMarriage-9378.rar?fid=30302&ttl=1535768877&ri=8192&rs=8192&setec=aa55780776cfc89a6acfdf4faab8315e"
    },
    {
      "fileId": "31211",
      "name": "Mulmarriage091HighPriority",
      "version": "0.9.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "147",
      "fileName": "Mulmarriage091HighPriority-9378.rar",
      "uploadedUnix": "1329259376",
      "modVersion": "0.9.1",
      "virusScanUrl": "https://www.virustotal.com/file/0b39fb68ae02629417c44f7d349158580bbdad17ee7b87f6d0570b729850195c/analysis/1406682614/",
      "changelogHtml": " bug fixed for having second marriage without speak to first spouse prevents mod functioning. <br/> \n bug fixed for showing interest me option even if you\\'ve married the NPC <br/> \n Add dialogue for changing spouse\\'s outfits <br/> \n minor text changes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mulmarriage091HighPriority-9378.rar?fid=31211&ttl=1535768878&ri=8192&rs=8192&setec=7ccbc131c3ae43a775730fd888df284e"
    },
    {
      "fileId": "31364",
      "name": "Mulmarriage091DefaultPriority",
      "version": "0.9.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "147",
      "fileName": "Mulmarriage091DefaultPriority-9378.rar",
      "uploadedUnix": "1329280671",
      "modVersion": "0.9.1",
      "virusScanUrl": "https://www.virustotal.com/file/c09c3c48e32f1f0a3daa4154f7f80b4e32c3724d26fc538407c4d9373c85781b/analysis/1406683407/",
      "changelogHtml": " bug fixed for having second marriage without speak to first spouse prevents mod functioning. <br/> \n bug fixed for showing interest me option even if you\\'ve married the NPC <br/> \n Add dialogue for changing spouse\\'s outfits <br/> \n minor text changes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mulmarriage091DefaultPriority-9378.rar?fid=31364&ttl=1535768878&ri=8192&rs=8192&setec=b004d383def53adeec169eddab645049"
    },
    {
      "fileId": "34138",
      "name": "Mulmarriage092DefaultPriorityAlpha",
      "version": "0.9.2alpha",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17463",
      "fileName": "Mulmarriage092DefaultPriorityAlpha-9378.7z",
      "uploadedUnix": "1329729875",
      "modVersion": "0.9.2alpha",
      "virusScanUrl": "https://www.virustotal.com/file/e43a9ce4aab074dd6a4085f2902ae65e05550995a9caa0438b7fc1dc4ebdf364/analysis/1406698032/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mulmarriage092DefaultPriorityAlpha-9378.7z?fid=34138&ttl=1535768879&ri=8192&rs=8192&setec=ff4491b594d0dfdc0323a6c312bedcee"
    },
    {
      "fileId": "34491",
      "name": "Mulmarriage092DefaultPriorityBeta",
      "version": "0.9.2b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18960",
      "fileName": "Mulmarriage092DefaultPriorityBeta-9378.7z",
      "uploadedUnix": "1329781881",
      "modVersion": "0.9.2b",
      "virusScanUrl": "https://www.virustotal.com/file/e483cc42fb930db9cffd4f9f5047a66b9bdb74a2ee601e9e413ae066a2dd356c/analysis/1406699837/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mulmarriage092DefaultPriorityBeta-9378.7z?fid=34491&ttl=1535768879&ri=8192&rs=8192&setec=c4c2e3ecbefb4994b34510c360190866"
    },
    {
      "fileId": "34806",
      "name": "Mulmarriage092DefaultPriorityBetaBypassCourier",
      "version": "0.9.2b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18960",
      "fileName": "Mulmarriage092DefaultPriorityBetaBypassCourier-9378.7z",
      "uploadedUnix": "1329836677",
      "modVersion": "0.9.2b",
      "virusScanUrl": "https://www.virustotal.com/file/39fbdc55b9598db7f71335fbf4eadcd6e672cfa5f8cae25ae1773f1c7f466038/analysis/1406701656/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mulmarriage092DefaultPriorityBetaBypassCourier-9378.7z?fid=34806&ttl=1535768880&ri=8192&rs=8192&setec=c645b5a4dc99445855140902f2c8ebb4"
    },
    {
      "fileId": "37976",
      "name": "source092beta",
      "version": "0.9.2b",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "15",
      "fileName": "source092beta-9378-0-9-2b.7z",
      "uploadedUnix": "1330424503",
      "modVersion": "0.9.2b",
      "virusScanUrl": "https://www.virustotal.com/file/b16ba83959b7d3708f69234c4ccf1da672c1a3a76bcfbcda22c9d708484178a5/analysis/1406719033/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/source092beta-9378-0-9-2b.7z?fid=37976&ttl=1535768880&ri=8192&rs=8192&setec=7523eb5d59c8dfae59c047cb234b8e9f"
    },
    {
      "fileId": "44422",
      "name": "Mulmarriage093Alpha",
      "version": "0.9.3a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23831",
      "fileName": "Mulmarriage093Alpha-9378.7z",
      "uploadedUnix": "1332073141",
      "modVersion": "0.9.3a",
      "virusScanUrl": "https://www.virustotal.com/file/399d21ab2592c23af415d6ea7f9ed8ad84f48c6effcf23434bb70597d4b369f5/analysis/1406765864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mulmarriage093Alpha-9378.7z?fid=44422&ttl=1535768881&ri=8192&rs=8192&setec=b71e98e2c66a3b49d24d91557171b73d"
    },
    {
      "fileId": "44996",
      "name": "completequests",
      "version": "0.9.3a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "0",
      "fileName": "completequests-9378-0-9-3a.7z",
      "uploadedUnix": "1332215452",
      "modVersion": "0.9.3a",
      "virusScanUrl": "https://www.virustotal.com/file/1f893f67f1e62b0a1939eaf99d7f77ad52993d3ac5c55d720fed42b775b5bff8/analysis/1406769006/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/completequests-9378-0-9-3a.7z?fid=44996&ttl=1535768882&ri=8192&rs=8192&setec=a3d8b5185202fe368a505e89e33a4b46"
    },
    {
      "fileId": "57845",
      "name": "Mulmarriage093FullPackage",
      "version": "0.9.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23834",
      "fileName": "Mulmarriage093FullPackage-9378-0-9-3.7z",
      "uploadedUnix": "1335884963",
      "modVersion": "0.9.3",
      "virusScanUrl": "https://www.virustotal.com/file/9cf5bcce8280025c18d8f9188b6f20d0af79ae5ce004cbdd519cfcf2ffed0a2a/analysis/1406859089/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mulmarriage093FullPackage-9378-0-9-3.7z?fid=57845&ttl=1535768882&ri=8192&rs=8192&setec=e81fed30fa2fc941c8f4c406bde2f855"
    },
    {
      "fileId": "57847",
      "name": "Mulmarriage093UpdatePackageFromAlpha",
      "version": "0.9.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51",
      "fileName": "Mulmarriage093UpdatePackageFromAlpha-9378-0-9-3.7z",
      "uploadedUnix": "1335885187",
      "modVersion": "0.9.3",
      "virusScanUrl": "https://www.virustotal.com/file/05f8f50a1b6c1db5aae53be3c9c50741eadce2a1612b78deb82d0d3a3a3844c2/analysis/1406859122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mulmarriage093UpdatePackageFromAlpha-9378-0-9-3.7z?fid=57847&ttl=1535768883&ri=8192&rs=8192&setec=c291b47c1dc4a608c52eb8042f3a9c71"
    },
    {
      "fileId": "57854",
      "name": "093FinalScriptSource",
      "version": "0.9.3",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1064",
      "fileName": "093FinalScriptSource-9378-0-9-3.7z",
      "uploadedUnix": "1335887408",
      "modVersion": "0.9.3",
      "virusScanUrl": "https://www.virustotal.com/file/6380a25a21d0909286fac1ecd379a8428690ea8bff9ac47bcdc0de252e646f3f/analysis/1406859194/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/093FinalScriptSource-9378-0-9-3.7z?fid=57854&ttl=1535768884&ri=8192&rs=8192&setec=10c8d9eea35d29dd5cc2aaa59a8437a0"
    },
    {
      "fileId": "58821",
      "name": "MultiMarriages100",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11543",
      "fileName": "MultiMarriages100-9378-1-0-0.7z",
      "uploadedUnix": "1336202787",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/14e35c483d6b8093b3178a6c5119a7c78831c96fd606a73a215a3e403e85f4c1/analysis/1406868255/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MultiMarriages100-9378-1-0-0.7z?fid=58821&ttl=1535768884&ri=8192&rs=8192&setec=272f4e4582890cecc8d364c49e2d5397"
    },
    {
      "fileId": "102504",
      "name": "Multimarriages1_10bHearthfireFix",
      "version": "1.10beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13608",
      "fileName": "Multimarriages1_10bHearthfireFix-9378-1-10beta.zip",
      "uploadedUnix": "1354347629",
      "modVersion": "1.10beta",
      "virusScanUrl": "https://www.virustotal.com/file/c61ab5d52d98e30c81b05bca7d23c397452d2f1a490c89b34933d4a2bc1df003/analysis/1407286670/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Multimarriages1_10bHearthfireFix-9378-1-10beta.zip?fid=102504&ttl=1535768885&ri=8192&rs=8192&setec=8922010f3880596e2c50ea25fdb2dbc4"
    },
    {
      "fileId": "103142",
      "name": "MultiMarriages120Beta",
      "version": "1.20Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23196",
      "fileName": "MultiMarriages120Beta-9378-1-20Beta.7z",
      "uploadedUnix": "1354624925",
      "modVersion": "1.20Beta",
      "virusScanUrl": "https://www.virustotal.com/file/4e3952a9e1b9472e9c3e6f5380426beffe6ca1fe4aded38f66975c34400b1d3e/analysis/1407291096/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MultiMarriages120Beta-9378-1-20Beta.7z?fid=103142&ttl=1535768885&ri=8192&rs=8192&setec=8de0a11afabf809c821a53d83383e439"
    },
    {
      "fileId": "103323",
      "name": "MultiMarriages121Beta",
      "version": "1.21Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23197",
      "fileName": "MultiMarriages121Beta-9378-1-21Beta.7z",
      "uploadedUnix": "1354702272",
      "modVersion": "1.21Beta",
      "virusScanUrl": "https://www.virustotal.com/file/81518f35bc9ca2fb8477e9dcc1fe401c660cc7e95a068b5cb997d662fbac787a/analysis/1407292033/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MultiMarriages121Beta-9378-1-21Beta.7z?fid=103323&ttl=1535768886&ri=8192&rs=8192&setec=cd75af6d4c3188fb25a958cab9d93e10"
    }
  ]
}