{
  "modId": 9419.0,
  "modName": "Aleks Weapon Skills Overhaul - AWSO",
  "summary": "Better weapon damage skill scaling, three new perks one for each weapon skill, rebalanced and reworked some vanilla perks. New and changed perks include: Whirlwind, Dual Berserking, Dual Sweep, Bow Smash, Crippling Wounds. Works with existing characters.",
  "descriptionHtml": "If you like the mod you can also check [url=http://skyrim.nexusmods.com/downloads/file.php?id=10471]Alek\\'s Armor Skills Overhaul - AASO[/url]\r\n\r\nAWSO is an overhaul of weapon skills and perks. Goal is to give better skill scaling, improve existing perks where needed and add couple of cool new and unique ones. By default skill damage multiplier is 1.5 when at 100 skill and with 5 ranks in first tier perks you get total of x3 damage at 100 skill. I changed skill scaling multiplier to 2.5 which is less than 3 but boosted some of the existing perks that were weak so net damage should stay around the same perimeter. I used the existing perk layout and added new perks in such manner so that it doesn\\'t break vanilla perk dependency. Therefore existing characters can install and use the mod without the need to start the new game.\r\nNote that this mod also change playable race records because I had to add new keywords to specific attacks so some new perks can work as intended therefore if you use any mod that change any of 10 existing playable races it might get overriden by this mod, or you might end up with Dual Sweep not working at all. On the other hand custom races will not get overriden but they will probably miss the attack data I added so Dual Sweep will not work on them. While doing this I also discovered that Argonian race doesn\\'t have keyword assigned to a power bash attack so that means that disarming bash will not work for Argonians! I fixed this issue along the way and fix is included in this mod.\r\n\r\n* In short this mod does the following:\r\n\r\n- Perks no longer do what skill is supposed to do therefore weapon damage fully scale with the skill.\r\n- Better weapon specialization perks.\r\n- Each weapon skill gets one new perk in the tree.\r\n- Some original perks have been reworked or improved with scripts.\r\n- New unique perks: Whirlwind, Dual Berserking, Dual Sweep, Bow Smash, Crippling Wounds.\r\n- Removed archery auto aiming in 1st person view.\r\n- Fixed game bug where Argonian race is not able to use disarming bash.\r\n\r\n* Compatibility:\r\n\r\n- Not compatible at all with mods that change weapon perks or alter weapon damage skill scaling.\r\n- Not fully compatible with mods that alter any of 10 default and 10 vampire races. Dual Sweep will not work with custom or modified races.\r\n- Not fully compatible with mods that add custom perks with \\\"Apply Combat Hit Spell\\\" entry set to high priority. If you find that Crippling Wounds and Quick Shot stacking effect does not work for you then mod is probably in an indirect conflict and no load order will help. These custom perks might be hidden and applied via scripts to perform the task of applying magic effect on targets when being hit by the player so it is hard to know which mod is in conflict. Most modders don\\'t know that \\\"Apply Combat Hit Spell\\\" perks cannot stack and only one can work at the time.  It can be managed with priority indexes and conditions to make two coexist to some degree like Bethesda done with Limbsplitter bleed damage which will not apply when your Warmaster perk proc so if one mod breaks Crippling Wounds it will also break default axe bleeding perks. Believe me that it will be most common issue to conflicts before it become well known issue as there is no other mean to apply magic effect on hit on general basis.\r\n\r\n* Install & Uninstall Notes:\r\n\r\n- You may use this mod with existing characters without any problems but backup your saves first.\r\n- Uninstalling after picking new perks (Whirlwind, Dual Sweep or Bow Smash) will not refund the perk points.\r\n- Do not save the game with Dual Berserking active or weapon damage will stay boosted after you uninstall. To deactivate it just sheathe your weapons before saving. In case of mistake it can be fixed via console: \\\"player.modav attackdamagemult -value\\\". You can find value by querying the actor value: \\\"player.getav attackdamagemult\\\" where default value is 1 so use this formula to find value to substract: value=attackdamagemult-1.\r\n\r\n* Change Log:\r\n\r\nV1.4:\r\n- Updated mounted combat attack data so attacks should no longer miss.\r\n- Enemies that you hit with sprinting attacks will no longer say \\\"Hey, watch it...\\\" as if you have bumped into them.\r\nV1.3:\r\n- Rebalanced Crippling Wounds damage at lower ranks by reducing duration from 10 sec all ranks to 2/4/6/8/10 seconds each rank.\r\n- Incorporated Skyrim 1.5 patch weapon bleed damage fixes.\r\nV1.2:\r\n- Fixed Whirlwind perk description displaying wrong percentage.\r\n- Added Dual Sweep support for vampire races.\r\n- Optimized some scripts. Remote spells no longer need to be cast from an activator (old habit from Oblivion, not needed with Papyrus).\r\nV1.1:\r\n- Fixed Crippling Wounds rank 5 sometimes not working if player had Bullseye perk.\r\n- Whirlwind weapon speed bonus reduced from 40% to 20%.\r\n- Quick Shot perk in addition to original effect now also increase draw speed further by 5% for 10 seconds after each successful hit.\r\nV1.0:\r\n- Initial release.\r\n\r\n* Details:\r\n\r\n== Two-Handed Perks ==\r\n- Barbarian replaced with Brutality (Power attacks with two-handed weapons do 10/20/30/40/50% more damage.)\r\n- Limbsplitter bleed damage tripled.\r\n- Deep Wounds critical damage multiplier increased from 1/1.25/1.5 to 1/1.5/2.\r\n- Skull Crusher (Attacks with warhammers ignore 25/50/75% of armor and have 10/15/20% chance to stagger). Stagger works with normal attacks and has a short duration.\r\n- Greater Critical Charge criticals now do triple damage.\r\n- Whirlwind is a new perk that requires 50 skill and Champion\\'s Stance perk and is alternate route to Sweep (Attacks with two-handed weapons are 20% faster).\r\n- Warmaster has been improved with a script (Backwards power attack with two-handed weapons hit all targets in front of you and has a minimum 25% chance to knock back. Chance and force increase with severity of your wounds). In practice original perk did not use paralyze effect at all even though it said so in description. It was also lackluster because of only 25% chance to hit single opponent while backward power attack is by its own hard to use effectively due to moving out of hit range and failing to hit the opponent. It is now designed to be used in \\\"Oh, no!\\\" situations because if your health drops below 50% knock back is guaranteed to occur and will hit the enemies with a fair amount of force.\r\n\r\n== One-Handed Perks ==\r\n- Armsman replaced with Savagery (Power attacks with one-handed weapons do 10/20/30/40/50% more damage).\r\n- Hack and Slash bleed damage tripled.\r\n- Bone Breaker (Attacks with maces ignore 25/50/75% of armor and have 10/15/20% chance stagger). Stagger works with normal attacks and has a very short duration.\r\n- Bladesman critical damage multiplier increased from 1/1.25/1.5 to 1/1.5/2.\r\n- Critical Charge criticals now do triple damage.\r\n- Dual Savagery replaced with Dual Berserking and now requires 60 skill (Dual wielding damage is increased with severity of your wounds). This is brand new scripted ability. Damage is increased exponentially as you lose health with a maximum of +150% damage. Includes screen effect that indicates the damage increase by gradually increasing screen tint color to red and giving more of a tunnel vision. Berserking works only while weapons are drawn. Also note that some NPCs in game now also use this perk instead of Dual Savagery.\r\n- Dual Sweep is a new perk that requires 70 skill and Dual Berserking (Dual wielding power attack hit all targets in front of you).\r\n- Paralyzing Strike duration increased from 2 to 4 seconds.\r\n\r\n== Archery Perks ==\r\n- Overdraw replaced with Crippling Wounds (Wounded targets suffer 2/4/6/8/10 damage and move 30% slower for 2/4/6/8/10 seconds.). Basically, shots apply damage over time dealing total 4/16/36/64/100 damage over the duration which can be stacked but each instance has its own timer. Slow effect will stack with Nightingale Bow enchant potentially giving maximum slow of 80%.\r\n- Bow Smash is a new scripted perk that requires 20 skill and Crippling Wounds perk (Chance to knock down and deal bonus damage when bashing with the bow). Chance will increase while wounded giving you more guaranteed knockdown if you are in life threatening situations. Damage is symbolic 10 physical flat.\r\n- Critical Shot critical damage multiplier increased from 1/1.25/1.5 to 1/1.5/2.\r\n- Quick Shot perk improved (Can draw a bow 30% faster. Every successful hit increase draw speed further by 5% for 10 seconds). Effect can be stacked but each instance has its own timer. It is possible to overlap the effect and sustain additional 30% draw speed boost if using faster bow, making minimal delay between shots and hitting the target every time. Effect is lost immediatelly if not in combat or not having a bow drawn.",
  "categoryId": "79",
  "version": "1.4",
  "author": "Alek",
  "createdUnix": "1329148241",
  "updatedUnix": "1339930558",
  "containsAdultContent": false,
  "uploadedBy": "mitchalek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30390",
      "name": "AWSO_1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "63",
      "fileName": "AWSO_1_0-9419.zip",
      "uploadedUnix": "1329148292",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/368547dbd1af0b524a2a5033cb164a071d5e71ee6761488a2204719ca71c9dac/analysis/1406678592/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AWSO_1_0-9419.zip?fid=30390&ttl=1535768954&ri=8192&rs=8192&setec=20e7030dfb62c07c9c60cbbc9b491afa"
    },
    {
      "fileId": "32086",
      "name": "AWSO_1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "66",
      "fileName": "AWSO_1_1-9419.zip",
      "uploadedUnix": "1329405127",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b6e8a901891adc2b0017627837fd9130c87fdc5cf2c6791d032d13d0de8cd0f4/analysis/1406687351/",
      "changelogHtml": " Whirlwind weapon speed bonus reduced from 40% to 20%. <br/> \n Quick Shot perk in addition to original effect now also increase draw speed further by 5% for 10 seconds after each successful hit. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AWSO_1_1-9419.zip?fid=32086&ttl=1535768954&ri=8192&rs=8192&setec=1c24084da1ec037e1e992ab7d76908a4"
    },
    {
      "fileId": "34372",
      "name": "AWSO_1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "114",
      "fileName": "AWSO_1_2-9419.zip",
      "uploadedUnix": "1329771615",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/69f18cab913e1de85f8c26e53bb06b996a673f178de2434e2c03e8aee349fd29/analysis/1406698929/",
      "changelogHtml": " Fixed Whirlwind perk description displaying wrong percentage. <br/> \n Added Dual Sweep support for vampire races. <br/> \n Optimized some scripts. Remote spells no longer need to be cast from an activator (old habit from Oblivion, not needed with Papyrus). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AWSO_1_2-9419.zip?fid=34372&ttl=1535768955&ri=8192&rs=8192&setec=4ba1ff4f19b5352d3c7e51d05ae8c9a3"
    },
    {
      "fileId": "45132",
      "name": "AWSO_1_3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "114",
      "fileName": "AWSO_1_3-9419-1-3.zip",
      "uploadedUnix": "1332265784",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/1322b18a2e7eac7706af9894a6cca255e6d2e7cc5207cef6cd0be9b4dacbcf21/analysis/1406769814/",
      "changelogHtml": " Rebalanced Crippling Wounds damage at lower ranks by reducing duration from 10 sec all ranks to 2/4/6/8/10 seconds each rank. <br/> \n Incorporated Skyrim 1.5 patch weapon bleed damage fixes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AWSO_1_3-9419-1-3.zip?fid=45132&ttl=1535768955&ri=8192&rs=8192&setec=37da229ab56e054ea0f7cf1d4bc66891"
    },
    {
      "fileId": "68562",
      "name": "AWSO_1_4",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "116",
      "fileName": "AWSO_1_4-9419-1-4.zip",
      "uploadedUnix": "1339930558",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/2fc96e3d5506706986668878d4fba1dd9b1410e246ceaefe0d43169f31ab704d/analysis/1406964728/",
      "changelogHtml": " Updated mounted combat attack data so attacks should no longer miss. <br/> \n Enemies that you hit with sprinting attacks will no longer say \"Hey, watch it...\" as if you have bumped into them. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AWSO_1_4-9419-1-4.zip?fid=68562&ttl=1535768956&ri=8192&rs=8192&setec=13c35d49bad2784bf4e7bd15abf44a5d"
    }
  ]
}