{
  "modId": 9439.0,
  "modName": "Vandor",
  "summary": "The necromancers of Vandor have struck again, will you rise to defeat them once and for all, or will you become another of their vile minions.",
  "descriptionHtml": "From the docks of solitude stumbles a lone sailor, haggard and weary from weeks at sea. He collapses at the gates, the dust of his crumbled lungs escapes with his final breath. On his ship lay the bodies of his crew, flaking like ash in the biting wind. They say these men had gone to Vandor, and like so many before them, never returned home alive.\r\nIt is evident that the vile necromancers known only as the Sload inhabiting the distant Isle have struck again, attempting their latest blight on the rest of Tamriel. It is time a hero rose up to put a blight on them.\r\n\r\nWHAT THE MOD ADDS\r\nThis mod adds a new island world space and dungeon accessable through a door on the boat at the East Empire docks at Solitude. There are a lot of enemies, so go prepared. Designed to be a challenge for 18-25th level characters. I do not recomend trying this at any level lower than 15, as it was designed to be a challenge at Medium difficulty. \r\nI used all vanilla models so unfortunately no new looking monsters yet.\r\n\r\nConstructive criticism appreaciated, let me know if you find it too easy/too hard or have suggestions as to the layout.\r\n\r\nINSTALL\r\nextract the contents of the archive to a temporary folder and copy/paste into your skyrim data directory.\r\n\r\n\r\n\r\nmade by Kyman3",
  "categoryId": "30",
  "version": "1.0",
  "author": "Kyman3",
  "createdUnix": "1329158921",
  "updatedUnix": "1329159292",
  "containsAdultContent": false,
  "uploadedBy": "Kyman3",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30480",
      "name": "Vandor1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "218",
      "fileName": "Vandor1-9439-1-0.zip",
      "uploadedUnix": "1329159292",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/807e2460d068d818bf41e99317aab9fa3836cbcb3d515aec2a56cac55a026b39/analysis/1406679063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vandor1-9439-1-0.zip?fid=30480&ttl=1535768983&ri=8192&rs=8192&setec=55bda71cb68339d23abecdf129c817d2"
    }
  ]
}