{
  "modId": 9463.0,
  "modName": "Deployable Traps v151",
  "summary": "Allows the user to deploy traps to impede foes.",
  "descriptionHtml": "Deployable Traps v1.5\r\n\r\nNow with a handy dandy book to help you craft. :) \r\nAnd lorecraft-ready!\r\n\r\nRead the changelog!!!!!! :)\r\n\r\n[Current Traps]\r\n\r\nAnkle Trap: Craftable via one strip of leather and one iron ingot.\r\nOil Trap: Craftable via two pieces of leather and one Ale.\r\nBarricade: Craftable via six pieces of firewood and one iron ingot.\r\nDwemer Oil Trap: Craftable via two pieces of leather and one dwarven oil.\r\nGas Trap: Craftable via one piece of leather and two frostbite venoms.\r\nHeavy Boulder: Craftable via three pieces of iron ore.\r\nSmall Boulder: Craftable via one piece of iron ore.\r\nCaltrops!: Craftable via one iron ingot. :)\r\nFrenzy Trap: Craftable via one deathbell annnd two leather.\r\nLiquid Ice Trap: Craftable via one frost salt annnd two leather.\r\nDwemer Battery Trap: Craftable via 5x dwarven gear, and 5x dwarven scrap metal.\r\nCompressed Air Trap: Craftable via 1x dwarven oil and 3x hawk feathers. :)\r\nVariations on all explosive traps/oil trap variations - Sticky versions craftable with 1x spriggan sap.\r\n\r\n\r\n\r\n[Basics]\r\n\r\nOne of the letdowns I saw when I was playing skyrim is that traps, be they bear, spear, or rock - were generally in place. You couldn\\'t pick them up, adjust them, plan ambushes, or anything of the sort. So, I endeavored to create a basic mod to let users create traps which they can then deploy wherever they like. \r\n\r\n[Use]\r\n\r\nThere is a book ontop of a chest in riverwood (near the logging site). :)\r\n\r\n[Known Issues]\r\n\r\n- Trap sometimes is set off as the user drops it onto the ground.\r\n- Sometimes actors trigger the trap (usually on the edges) and the trap goes off, yet no damage is inflicted.\r\n- Reported bug with crashing - this shouldn\\'t happen unless you have other mods that edit the scripts used by traps in game, so deadlier traps, etc. Simply load this .esp before your other trap mods, and it should take precedent.\r\n- Rarely, when using bows to set off oil traps, the oil trap doesn\\'t trigger. If this happens, try casting a fire spell on the pot to get rid of it/just disable it through the console. \r\n- Barricades deploy funky. This is due to them lacking a \\'rigidbody\\' from nifskope. I\\'m working on it.\r\n\r\nChangelog:\r\n\r\nv.1 - Original Release\r\nv.2 - By some freak accident, I managed to get the traps to reset once triggered; players simply have to walk ontop of them to reset, then they are ready to go! (I was super pumped about figuring this out.) Original files unchanged, readme adjusted. Chest placed near a tree in riverwood by the logging area for testing (only twenty traps.)\r\nv.3 - Returned traps to standard no-toggle. I felt the realism was lost after testing with a few enemies; they would trigger the trap, run around me a bit, and retrigger the trap. That isn\\'t what I was driving for with this mod, so I removed the toggle. If there\\'s enough clamour, I can re-enable it and offer it up as an optional file.\r\nv.4 - Oil Traps now ready to go. Be sure to crouch when placing, as they don\\'t roll or...really move at all for that matter. Still pick-upable. Just shoot an arrow and see what happens. \r\nv.5 - Destructable Barricades added. Craftable. Be sure to crouch when placing - same problem as Oil traps. They look a little funky when you drop them. Functional, though. \r\nv.6 - Tweaked some information on ankle traps, adjusted destruction info for barricades. Put caltrops as a craftable, but as of v.6 they don\\'t actually do anything except fall really cool.\r\nv.7 - Added Dwarven Oil Traps and Gas Traps. Currently using the same model as oil traps, but distinguishable by name; Sorry. I\\'ll get them uniqueified eventually. Dwemer Oil Trap is much more explosive, and requires dwarven oil to make. Gas traps explode and paralyze foes for 7 seconds. A bit much, but I\\'m hoping you use it responsibly. Might put the duration down later. Tweaked oil traps and dwemer oil traps to add a knockdown effect.\r\nv.8 - Added craftable \\\"Heavy Boulders.\\\" Basically, their use is to be placed at the top of a slant/hill overlooking a road, preferrably behind barricades (which you can then destroy) and send tumbling down. You can also just hold onto them and drop them (if you\\'re standing above.) Damage is kinda low atm, may increase.\r\nv.9 - Did a lot of tweaking. Added small boulders in addition to the already in-heavy boulders. Adjusted weights for a lot of items, tweaked a lot of variables, and FINALLY managed to get oil traps to drop properly. They now roll, are moveable, and altogether more fun now. Same applies for gas/dwemer oil traps. Caltrops are ALMOST working. So close. Look for them in v1.0 :)\r\nV1.0 - FINALLY got caltrops to work. They stagger opponents when they step on them. I trust you folks, so don\\'t abuse them by deploying a hundred. :P Tweaked damage on a lot of stuff and increased it, so traps should be deadlier. Realisticly, caltrops don\\'t damage too much (single digits). But with a lot of them laid down, it adds up fast, so just be reasonable. Also tweaked names so they should show up near the top of your misc items list. :) Barricades still deploy kinda funky, but they\\'re functional.\r\nV1.1 - Lowered the damage on caltrops significantly, should be a lot less overpowered now. :)\r\nv1.2 - Added two new traps! frost and frenzy. Frost will slow enemies and is highly damaging - I\\'ll probably cut that down in the future. Frenzy frenzies. :) I think I might have fixed ankle traps too, let me know how it works - tested ten times with the same trap, and seemed to work okay.\r\nv1.3 - Tweaked ankle traps a touch, I\\'m close to getting magic effects on ankle trap hits - look for the first few variations in 1.4 on. If you\\'re having problems getting your traps to work, get rid of the ones you have from old versions and try making new ones - see if that works. If not, it\\'s an error on my end, and i\\'ll attempt to fix. adds two new traps, dwemer battery (shock) and compressed air (air.) If you folks want, I can put in the next version variations on all of the oil traps and make it so they stick in one spot, kinda like early versions of this mod before collision was put in. I realize that them rolling all over the place might be an issue - lemme know in the comments if you want that option. \r\nv1.4 - Okay, I have a huge headache. I spent the past two days trying to get these fricken ankle trap variations to work right - I\\'m CLOSE, but it\\'s not working well as of this release. Regardless, I wanted to release this as I think I\\'ve finalized the standard ankle trap - It should be fully functioning and you shouldn\\'t be getting any bugs with it any longer. As for new traps, there are none! But!!!!!! I added sticky variations of all the rolly explosion traps, so you can now place them wherever you like - on walls, on the top of mounds, and not ever worry about them rolling off!.. assuming you happen to have some spriggan sap. :)\r\n\r\nv1.5 - I\\'ve...added a book ontop of the chest in riverwood which gives you a lore-friendly background on what is needed for construction of the traps in game. I also edited most of the recipes to give them more lore friendly requirements ( oil traps now require troll fat instead of ale. ) and I added in a perk requirement system. Dwemer traps now require dwarven smithing, annnd the enchanted traps ( air, frost, frenzy ) now require one rank of the first enchanter perk to make. Added a stagger to ankle traps, Caltrops are working kinda okay now, annd I\\'m pretty comfortable with this release.\r\n\r\nThat being said, I want to start moving into making other mods. So, as of February 28th, I will not be working on deployable traps as much. I\\'m really really happy with where this mod is at now. The intention was originally just to get bear traps in game for the hunter sort, and I think I went beyond that. Barring game-breaking bugs, this will simply not be updated as much as it currently is. I really hope you folks enjoy this mod, and feel free to let me know if you want to take up the reins to continue. ;)\r\n\r\n\r\n1.51!!!! (Lorecraft!)\r\n\r\nMakes deployable traps lorecraft-ed. :)\r\nThanks ScarabMonkey for getting this working! :)\r\nAnd ArcaneSmith for Lorecraft. :)\r\n\r\n\r\nAlso works well with Sands of Time. :) http://skyrim.nexusmods.com/downloads/file.php?id=12452 \r\nEnjoy!",
  "categoryId": "78",
  "version": "1.51",
  "author": "ciedeeh",
  "createdUnix": "1329168413",
  "updatedUnix": "1332708674",
  "containsAdultContent": false,
  "uploadedBy": "ciedeeh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35086",
      "name": "itsatrapv13",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16",
      "fileName": "itsatrapv13-9463.rar",
      "uploadedUnix": "1329881364",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/ca2b6357c151c5367af708b51969b38cf26d95043fab9cedf63c6ad60b066768/analysis/1406703919/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/itsatrapv13-9463.rar?fid=35086&ttl=1535769015&ri=8192&rs=8192&setec=c9cbf94e64cc8764e375fcb5d258c165"
    },
    {
      "fileId": "36043",
      "name": "itsatrapv14",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10",
      "fileName": "itsatrapv14-9463.rar",
      "uploadedUnix": "1330050967",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/76e7a5795e76270fcaf9803a7c216eb92c154e1a8833e4e42a5bb9850785c07f/analysis/1406709182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/itsatrapv14-9463.rar?fid=36043&ttl=1535769015&ri=8192&rs=8192&setec=be10b553607bace216e7e595b2811e23"
    },
    {
      "fileId": "38277",
      "name": "itsatrapv15final",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "itsatrapv15final-9463.rar",
      "uploadedUnix": "1330481182",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/002b315a73ab68a41074c6f22796abdd4553233d5205c5dba2dee1fadacb4866/analysis/1406720531/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/itsatrapv15final-9463.rar?fid=38277&ttl=1535769016&ri=8192&rs=8192&setec=ba69810e99f370fbc36d3dced52932b3"
    },
    {
      "fileId": "46823",
      "name": "ItsatrapLorecraftCompatible",
      "version": "1.51",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "ItsatrapLorecraftCompatible-9463.7z",
      "uploadedUnix": "1332708674",
      "modVersion": "1.51",
      "virusScanUrl": "https://www.virustotal.com/file/f7725a2f7c6f89c0618ee8b7e5fda49e9a27a6859ca3511bec5d850f72b0b16d/analysis/1406779717/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ItsatrapLorecraftCompatible-9463.7z?fid=46823&ttl=1535769016&ri=8192&rs=8192&setec=4d8950d56f631aab705d64c62513e6bc"
    }
  ]
}