{
  "modId": 9473.0,
  "modName": "Moon Sugar Manor WIP",
  "summary": "This house is a Work in Progress.  It&#39;s designed to be functional with massive amounts of storage space and scripts to automate retrieving and storing items.  It features an Alchemy Lab, Blacksmith, Kitchen, Study, Display Room, Master Bedroom, Training Room and more.",
  "descriptionHtml": "*****************************************************************\r<br />\r<br />                   TES: Skyrim\r<br />            LFox Moon Sugar Manor v0.14\r<br />          Made by LFox\r<br />\r<br />*****************************************************************\r<br />\r<br />     1. INSTALLING THE PLUGIN\r<br />\r<br />*****************************************************************\r<br />\r<br />1. Extract the mod to the Data folder and enable it via the\r<br />launcher or mod manager.\r<br />\r<br />*****************************************************************\r<br />\r<br />     2. Mod Load Order\r<br />\r<br />*****************************************************************\r<br />\r<br />This plugin should be fine anywhere in your load order.\r<br />\r<br />*****************************************************************\r<br />\r<br />     3. Updating\r<br />\r<br />*****************************************************************\r<br />\r<br />Before updating to new versions please read through the version\r<br />notes to make sure no containers you are using have been\r<br />modified.  This should not happen very often if at all.\r<br />\r<br />When you update i recommend you have your character saved outside\r<br />the house.  The reason being is a vast amount of objects that get\r<br />added have a script to disable havok physics such as the\r<br />ingredient jars, smithing material containers to prevent them\r<br />flying around or moving.\r<br />\r<br />The script takes effect upon entering the cell and is not\r<br />triggered if you load a save where your already in the house.\r<br />To trigger it if you saved inside simply leave the house and\r<br />re-enter it.\r<br />\r<br />*****************************************************************\r<br />\r<br />     4. Known Issues\r<br />\r<br />*****************************************************************\r<br />\r<br />Unfixable\r<br />*********\r<br />These bugs are unfixable unless someone can tell me otherwise\r<br />due to it being a problem with how the game engine handles things.\r<br />\r<br />- Sometimes on entering the cell the mannequins will all appear\r<br />  in the entry hall before being teleported back to their\r<br />  locations.\r<br />\r<br />- This only applies to saves using previous versions of this mod.\r<br />  A handful of objects don&#39;t seem to update their location if\r<br />  they are moved.  Even if they are deleted and placed as a new\r<br />  object.  This is due to how the game engine handles objects.\r<br />\r<br />This can be fixed by opening the console, selecting the object,\r<br />clicking on it and typing &#34;resetreference&#34;.  WARNING: THIS WILL\r<br />DELETE CONTAINERS CONTENTS.\r<br />\r<br />*****************************************************************\r<br />\r<br />     5. Mod Description\r<br />\r<br />*****************************************************************\r<br />\r<br />NOTE: This mod is currently a work in progress.  I&#39;ll try\r<br />to get it updated every so often.  There is ALOT of work left to\r<br />do on it but it&#39;s actually gotten to the point where its usuable.\r<br />Lighting has not been done yet, Navmeshing to support NPCs has\r<br />been autogenerated so its not perfect.  It also has not been\r<br />optimized yet to improve performance.\r<br />\r<br />I designed this house mod for myself to cater to my needs for\r<br />housing including the needs i don&#39;t even have yet.  This house\r<br />is not designed to just look pretty like most houses.  It&#39;s\r<br />designed to look nice (hopefully), provide quick easy access\r<br />between important rooms and provide massive storage space\r<br />with quick sort features.\r<br />\r<br />If you would like something changed or features implimented\r<br />let me know and i&#39;ll consider it.  However first and foremost\r<br />this mod is for myself.  I uploaded it so others could download\r<br />it if they so wish.\r<br />\r<br />To access the house travel to falkreath.  If you fast travel\r<br />the wall on your right hand side will have a barrel next to it.\r<br />This barrel will act as a door and allow you to enter the house.\r<br />\r<br />Q. Is there any unsafe chests or containers that respawn?\r<br />A. No every single chest or container is set not to respawn.\r<br />Normal items like cupboards or wardrobes use a seperate id from\r<br />the defaults which does not contain trash items and does not\r<br />respawn.\r<br />\r<br />Q. Why did you include such an overpowered merchant?\r<br />A. The merchant exists to provide easy access to goods, materials,\r<br />equipment to outfit companions and a easy way to offload items.\r<br />If you have a problem with that simply do not use the merchant\r<br />or do not make use of the aspects you consider cheaty.  The\r<br />merchant will not be removed and will not be made more balanced\r<br />for gameplay.\r<br />\r<br />Q. Will the house have a proper location in the game world?\r<br />A. Most likely, yes.\r<br />\r<br />1st Floor\r<br />*********\r<br />\r<br />Alchemy Lab\r<br />***********\r<br />The Alchemy lab houses the alchemy workbench as well as a\r<br />variety of tools to help with alchemy.\r<br />\r<br />NOTE: The garden is only for display it will only respawn when\r<br />the cell resets.  A script fills a chest with ingredients from the\r<br />garden daily for ease and to prevent the garden looking ugly.\r<br />\r<br />- A pair of cabinets house the entire Standing Stone collection\r<br />  in miniture form allowing you to pick a new star sign at any time.\r<br />\r<br />- A small garden displays 32 different growable ingredients.\r<br />  Instead of manually harvesting ingredients everyday 2 of each\r<br />  type will be deposited in a nearby chest.\r<br />\r<br />- Shelves hold ingredient containers for every single ingredient\r<br />  in the game with 32 unused containers for misc usage.\r<br />\r<br />- Shelves hold a multitude of potion shaped containers with\r<br />  various names intended for easy potion/poison storage.\r<br />\r<br />- The workbench has a recipe book on top which contains recipes\r<br />  for high end potions and poisons.\r<br />\r<br />- Activators on the workbench allow ingredients to be autosorted\r<br />  to their appropriate containers or retrieved.  Another activates\r<br />  the Master Craftsman Buff.\r<br />\r<br />Blacksmith\r<br />**********\r<br />The Blacksmith houses all the necessary tools to do armor and\r<br />weapon crafting.  Such as the forge, smelter, tanning rack ect.\r<br />\r<br />- Shelves hold containers for every smithing material in the\r<br />  game with several unused containers for misc usage.\r<br />\r<br />- Activators on a table allow materials and gems to be autosorted\r<br />  to their appropriate containers or retrieved.  Another activates\r<br />  the Master Craftsman Buff.\r<br />\r<br />- Five locks on a wooden beam automatically relock themselves\r<br />  upon opening allowing you to practice lockpicking and advance\r<br />  your skill.\r<br />\r<br />Display Room\r<br />************\r<br />The Display Room houses it all chests, weapon racks, mannequins.\r<br />It&#39;s the center of the house and designed to be where everything\r<br />gets stored.\r<br />\r<br />- Has a total of 16 mannequins ready to be outfitted.\r<br />\r<br />- Has a total of 16 weapon rack slots for display.\r<br />\r<br />- Has a total of 32 chests for storage.\r<br />\r<br />- Has a total of 36 display cabinets with 36 cupboards underneath\r<br />  for further storage.\r<br />\r<br />- Has a total of 4 Shield/Weapon plaques for display.\r<br />\r<br />Entry Hall\r<br />**********\r<br />\r<br />- A shelf of Portal Stones provides instant travel to all the\r<br />  major holds as well as the 4 major guilds.  Guild Portal Stones\r<br />  however will only function after doing the quests to unlock the\r<br />  area they teleport you to.\r<br />\r<br />- A small activator on the shelf allows for the Weightless buff\r<br />  to be activated.\r<br />\r<br />Kitchen\r<br />*******\r<br />The Kitchen houses all the necessary tools for cooking.\r<br />\r<br />Store\r<br />*****\r<br />WARNING: There is a bug in the game engine when a vendor has\r<br />over approximately 30,000 gold it will glitch and stop functioning.\r<br />When it is glitched items you sell will not give you any income.\r<br />When the vendor resets the gold will reset and the glitch will\r<br />disappear.\r<br />\r<br />The store is run by a female khajiit called Kisana who provides\r<br />the goods and services of an entire town.  She has the resources\r<br />to help you outfit an army of companions, learn new spells or\r<br />practice crafting.\r<br />\r<br />- She has 12,000 gold that refreshes regulary.\r<br />\r<br />- She sells Armor, Arrows, Alchemy Ingredients, Drinks, Food,\r<br />  Gems, Jewelry, Lockpicks, Potions, Scrolls, Smithing materials,\r<br />  Soul Gems, Spellbooks and Weapons in bulk.  She also sells a\r<br />  teleport spell for Moon Sugar Manor and a few Misc items.\r<br />\r<br />- A ledger on the desk allows you to buy a bulk delivery of\r<br />  alchemy ingredients which costs 120,000 gold but adds 100\r<br />  of every single ingredient to your alchemy containers.\r<br />\r<br />- Activators on the counter allow purchased items to be autosorted\r<br />  to their appropriate rooms/containers or retrieved instantly.\r<br />\r<br />- A small activator on the counter allows for the Weightless buff\r<br />  to be activated.\r<br />\r<br />- A small container on the counter allows for storage of goods\r<br />  you need to sell.\r<br />\r<br />Study\r<br />*****\r<br />The Study houses all the necessary tools to enchant equipment and\r<br />store a large collection of books.\r<br />\r<br />- A total of 32 bookshelves which allow 11 books each for a total\r<br />  storage space of 352 books.\r<br />\r<br />- Shelves hold containers for every Soul Gem with several unused\r<br />  containers for misc usage.\r<br />\r<br />- Activators on a enchanting table allow Soul Gems to be\r<br />  autosorted to their appropriate containers or retrieved.  Another\r<br />  activates the Master Craftsman Buff.\r<br />\r<br />2nd Floor\r<br />*********\r<br />\r<br />Guest Rooms\r<br />***********\r<br />There are a total of 4 Guest Rooms each is designed to house\r<br />companions and provide storage for all the various items they are\r<br />required to wear or carry.\r<br />\r<br />- Each room has a total of 8 Wardrobes so different armor sets can\r<br />  be stored seperately.\r<br />\r<br />- Each room has a total of 4 weapon rack slots for display.\r<br />\r<br />- Each room has a shelf with 8 chests for misc storage.\r<br />\r<br />Master Bedroom\r<br />**************\r<br />The Master Bedroom is the main bedroom designed for the player.\r<br />As such it houses a variety of storage containers.\r<br />\r<br />- Has a total of 4 mannequins ready to be outfitted.\r<br />\r<br />- Has a total of 4 weapon rack slots for display.\r<br />\r<br />- A total of 16 wardrobes on either side of the bed allow for\r<br />  many different sets of outfits to be stored seperately.\r<br />\r<br />- A desk holds a pair of containers.  A strong box designed to\r<br />  store the evergrowing key collection and an income ledger to store\r<br />  excess gold.\r<br />\r<br />Training Room\r<br />*************\r<br />The Training Room is exactly as it sounds a room designed to allow\r<br />you to train your combat skills and gain skill points on training\r<br />dummies.\r<br />\r<br />- Has 2 seperate training dummies that allow you to increase your\r<br />  skills.\r<br />\r<br />- A Torture set on the table allows you to collect blood once a day\r<br />  from the training dummies which can be drunk to satisfy a vampires\r<br />  thirst.\r<br />\r<br />Special Features\r<br />****************\r<br />Below is a list of various features that deserve special\r<br />documentation.\r<br />\r<br />Master Craftsman Buff\r<br />*********************\r<br />The Master Crastsman Buff is designed to remove the annoying\r<br />necessity to wear enchanted items and use potions to improve your\r<br />gear to the maximum level.  It assumes that you have all the\r<br />necessary Enchanting and Alchemy perks to achieve that result.\r<br />Below is the list of the affects that will be applied for 10 minutes.\r<br />\r<br />+30% to Enchanting (Acquired through an Alchemy Potion)\r<br />+100% to Alchemy (Acquired through Enchanting Gear)\r<br />+100% to Smithing (Acquired through Enchanting Gear)\r<br />+120% to Smithing (Acquired through an Alchemy Potion)\r<br />\r<br />The effect can be activated via a scroll looking item found in\r<br />the Alchemy, Blacksmithing and Enchanting rooms.\r<br />\r<br />Teleport Spell\r<br />**************\r<br />Moon Sugar Manor comes with its own unique teleport spell.  Simply\r<br />buy the spell tome from Kisana for a small fee and then you can\r<br />freely teleport home from wherever you are.  If you cast the\r<br />teleport spell while inside Moon Sugar Manor you&#39;ll be transported\r<br />back to where you were.\r<br />\r<br />Weightless Buff\r<br />***************\r<br />The Weightless Buff is designed to allow you to cart around all\r<br />your various armor sets, materials and other items so you can\r<br />decorate your home.  The buff will only work inside Moon Sugar Manor.\r<br />\r<br />+10,000 Carry Weight for 30 Minutes.\r<br />\r<br />*****************************************************************\r<br />\r<br />     6. Permissions\r<br />\r<br />*****************************************************************\r<br />You are not allowed to use any part of this mod or its assets\r<br />in your own mod project or another without contacting me and\r<br />getting my written permission to do so.\r<br />\r<br />Translating this mod into other languages does not require my\r<br />permission.  You are free to do so providing you include all the\r<br />proper documentation of the readme and the credits.\r<br />\r<br />*****************************************************************\r<br />\r<br />     7. Version History\r<br />\r<br />*****************************************************************\r<br />\r<br />v0.14\r<br />- Added the ability to harvest blood from the training dummies.\r<br />- Added the following DG items for sale Ammo, Blood Potions,\r<br />  Ingredients, Weapons\r<br />- Added a display garden to the Alchemy Lab with auto growth\r<br />  script so you don&#39;t need to make the garden ugly to get its\r<br />  benefits.\r<br />- Added Portal stone for College of Winterhold and The Companions.\r<br />- The Dark Brotherhood Portal Stone will now switch between the\r<br />  two sanctuaries depending on how far you are in the questline.\r<br />\r<br />v0.13\r<br />- Kisana now buys stolen items as intended.\r<br />- Rebuilt the Blacksmith to a different tileset.\r<br />- Added 6 different arrow quiver chests to Blacksmith due to lack\r<br />  of a better room to put them in.\r<br />- Added 4 Shield/Weapon plaques to the display room.\r<br />- Added 4 Guest Rooms.\r<br />- Made minor deco changes to some areas.\r<br />\r<br />v0.12\r<br />- Added Training Room.  TES fans should recognize the training\r<br />  dummies.\r<br />- Added Portal Stones to Entry Hall.\r<br />- Added cooking station to kitchen which i forgot to add last\r<br />  version.\r<br />- Teleport to Moon Sugar manor caused crashes when recalling to\r<br />  a zone such as inside whiterun town.  This should now be fixed.\r<br />  I believe it has to do with how the engine handles interior/exterior\r<br />  zones.  Recalling with Teleport will now trigger two loading\r<br />  screens. The reason is you will be teleported to the skyrim world\r<br />  and then to your destination which should prevent crashes.\r<br />- Added Weightless buff item to Alchemy Lab and Blacksmith.\r<br />\r<br />v0.11\r<br />- Removed 2 storage containers in the Blacksmith next to the\r<br />  Gem Chest.  Dragon Bones and Dragon Scales chests have been\r<br />  placed there instead they have also been added to the autosorters.\r<br />- The Moon Sugar Manor Teleport spell now works as a Mark and\r<br />  Recall Spell.\r<br />- Alchemy Shipment is now an activator on the shop counter instead\r<br />  of an item sold by Kisana.  The gold is now a fixed amount and\r<br />  you cannot trade items back for it.\r<br />- Added Soul Gem auto sorting and several misc containers.\r<br />- Key storage chest and income ledger chest added to master bedroom.\r<br />- Pickaxe and Woodcutters axe added for sale.\r<br />- Gave Kisana a new vendor sale list which should fix the\r<br />  inability to buy alot of items.\r<br />- Activatable Weightless buff added.\r<br />- Rebuilt the kitchen to a different tileset then started wondering\r<br />  if i should have.\r<br />- Minor Decor changes to Master Bedroom.\r<br />- Minor Decor changes to Alchemy Lab.\r<br />- Music added, subject to change.\r<br />- Fixed borked ceiling, accidentally copied something?\r<br />\r<br />v0.10\r<br />- Made the plugin\r<br />\r<br />*****************************************************************\r<br />\r<br />     8. Credits\r<br />\r<br />*****************************************************************\r<br />\r<br />LFox (me) - For everything\r<br />\r<br />UVXWarcat - House frame layout and help on figuring out some\r<br />furniture placement\r<br />\r<br />pheo3309 - For his suggestions and helping test various things.\r<br />\r<br />Special thanks to everyone for their nice comments and suggestions.\r<br />\r<br />Darliandor&#39;s Alchemy Lab and UESPWiki websites - For the wealth\r<br />of alchemy information they have that helped me put together the\r<br />recipe book.\r<br />http://skyrim.melian.cc/\r<br />http://www.uesp.net",
  "categoryId": "67",
  "version": "0.14",
  "author": "LFox",
  "createdUnix": "1329172449",
  "updatedUnix": "1345334542",
  "containsAdultContent": false,
  "uploadedBy": "HornedReaperMJL",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30641",
      "name": "LFox Moon Sugar Manor 0_10",
      "version": "0.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "96",
      "fileName": "LFox Moon Sugar Manor 0_10-9473.zip",
      "uploadedUnix": "1329172949",
      "modVersion": "0.10",
      "virusScanUrl": "https://www.virustotal.com/file/8e39cf14fc00779b38418f0321fafaf8e056ef9cbb071e0ab7b3b47713137e76/analysis/1406679741/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LFox%20Moon%20Sugar%20Manor%200_10-9473.zip?fid=30641&ttl=1535769034&ri=8192&rs=8192&setec=59d1faa2dabfb1f0657d79a6d51b72f7"
    },
    {
      "fileId": "31424",
      "name": "LFox Moon Sugar Manor 0_11",
      "version": "0.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "103",
      "fileName": "LFox Moon Sugar Manor 0_11-9473.zip",
      "uploadedUnix": "1329291874",
      "modVersion": "0.11",
      "virusScanUrl": "https://www.virustotal.com/file/8040106793d6a346bb4d476ef0b1beafaa80bfc8c2047bd3513f295dd1a1f650/analysis/1406683747/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LFox%20Moon%20Sugar%20Manor%200_11-9473.zip?fid=31424&ttl=1535769035&ri=8192&rs=8192&setec=4ed410eccd476e34c50d9655c61dd4aa"
    },
    {
      "fileId": "32407",
      "name": "LFox Moon Sugar Manor 0_12",
      "version": "0.12",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "122",
      "fileName": "LFox Moon Sugar Manor 0_12-9473.zip",
      "uploadedUnix": "1329454170",
      "modVersion": "0.12",
      "virusScanUrl": "https://www.virustotal.com/file/79a35a8fe22c55a926aea21d7c47dc802e7ecae3672f33d258ed5e53fb420baf/analysis/1406689039/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LFox%20Moon%20Sugar%20Manor%200_12-9473.zip?fid=32407&ttl=1535769035&ri=8192&rs=8192&setec=1e9eac794e85c94b0fa487f0ca12ddbf"
    },
    {
      "fileId": "35097",
      "name": "LFox Moon Sugar Manor 0_13",
      "version": "0.13",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "128",
      "fileName": "LFox Moon Sugar Manor 0_13-9473-0-13.zip",
      "uploadedUnix": "1329883762",
      "modVersion": "0.13",
      "virusScanUrl": "https://www.virustotal.com/file/1c55914575e9ddb0bd38d936c9e7e4f9111af708e3131b71500bec9e24f6309c/analysis/1406704085/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LFox%20Moon%20Sugar%20Manor%200_13-9473-0-13.zip?fid=35097&ttl=1535769035&ri=8192&rs=8192&setec=c2a566f7f6720ac345b66523a45a300f"
    },
    {
      "fileId": "82593",
      "name": "LFox Moon Sugar Manor 0_14 OLD",
      "version": "0.14",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "136",
      "fileName": "LFox Moon Sugar Manor 0_14 OLD-9473-0-14.zip",
      "uploadedUnix": "1345334313",
      "modVersion": "0.14",
      "virusScanUrl": "https://www.virustotal.com/file/f05fe1794c62e071765a0b3a2a8c2ca7519db36e1f057de3512fbdcae4b69d63/analysis/1407106205/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LFox%20Moon%20Sugar%20Manor%200_14%20OLD-9473-0-14.zip?fid=82593&ttl=1535769036&ri=8192&rs=8192&setec=62d143887ce2229bb588ab4a1db00f30"
    },
    {
      "fileId": "82594",
      "name": "LFox Moon Sugar Manor 0_14",
      "version": "0.14",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "140",
      "fileName": "LFox Moon Sugar Manor 0_14-9473-0-14.zip",
      "uploadedUnix": "1345334542",
      "modVersion": "0.14",
      "virusScanUrl": "https://www.virustotal.com/file/adfc8f7571ca99664b9048d404c69784b493de0533ca1dd79a6f31e31bee3c87/analysis/1407106207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LFox%20Moon%20Sugar%20Manor%200_14-9473-0-14.zip?fid=82594&ttl=1535769036&ri=8192&rs=8192&setec=2e73ba1400d0cd73dd17e2390af17a90"
    }
  ]
}