{
  "modId": 9484.0,
  "modName": "Advanced Transmutation",
  "summary": "This mod adds some advanced variants of the vanilla Transmute spell.",
  "descriptionHtml": "ADVANCED TRANSMUTATION 1.2\r\nBy Aghnaar Mareth\r\n\r\nDESCRIPTION\r\nWhen I\\'ve found that Bethesda had added the Transmute spell I was truly amazed...it was such a wonderful idea that I\\'d never believe could be part of the vanilla game...and then I found that no spell was made to affect ingots or other metals,\r\nso, after the Creation Kit was released, I started working on a little mod which would add a few new spells which were able to do what I felt was necessary to further \\\"enhance\\\" the great Transmute spell of vanilla Skyrim.\r\n\r\nHowever, partly out of fear of making mistakes and partly out of desire to improve, I\\'ve made a completely new script which was conceived to be an \\\"universal\\\" trasmutation script which I could use for many distinct spells.\r\n\r\nThe original vanilla script was quite ingenious, but this new script, upon which Advanced Trasmutation mod is based, adds the following improvements:\r\na) Up to 128 objects could be set into a \\\"refinement scale\\\" defined within the magic effect itself.\r\nb) It checks for the amount of each object of the scale within the caster\\'s inventory and all of them are transmuted at once (not just one at time).\r\nc) It could be set either to transmute an item just once for each casting or to keep changing until it\\'s turned into the \\\"topmost\\\" element of the refinement scale.\r\nd) It comes with a generic error message which could be used for any kind of refinement.\r\n\r\nNote that the spells which make up this release of Advanced Transmutation don\\'t take advantage of all capabilities of this \\\"universal\\\" script, but it is much more versatile than the original script and, as secondary issue, shouldn\\'t conflict with the original.\r\n\r\nAdvanced Transmutation adds the following spells:\r\n- Major Refine Mineral Ingots\r\n- Major Refine Mineral Ore\r\n- Minor Refine Mineral Ingots\r\n- Minor Refine Mineral Ore\r\n- Refine Charcoal\r\n\r\nThe \\\"Major\\\" refinement spells closely mirror the original Transmute spell, since they change Iron into Silver and Silver into Gold, but one could change either ore OR ingots with them. I\\'ve chosen to define them \\\"Major\\\" because changing items one step at time is, in fact, more tedious than\r\nchanging directly to what one desires and transmuting base metals into noble metals tend to be perceived as a \\\"noble\\\" magic. The \\\"Minor\\\" refinement spells change all kinds of metal ingots or ores, with the exclusion of Steel (because it\\'s an alloy), Deadric (because seems to be demonic and demi-organic)\r\nand Dwarven (because it *could be* some kind of alloy), according to a \\\"refinement scale\\\" based on value and alphabetical order (Iron -> Corundum -> Orichalcum -> Quicksilver -> Silver -> Malachite -> Moonstone -> Gold -> Ebony). The Refine Charcoal allows to transmute a base carbon-based substance (Charcoal)\r\ninto diamonds of increasing value (normal and flawless); note that this will only work on the \\\"sticks\\\" of Charcoal which are usually sold by vendors, not with the chunks of Charcoal (which are called Coal01 in CK)!\r\n\r\nApart from the addition of the above said spells, I\\'ve changed the original Transmute spell to be less costly and have no recharge time. Note that my spells will cost a lot in terms of Magicka, so, while I don\\'t care much about balance, I still feel they\\'re not overpowered.\r\n\r\nNow the spells could be crafted at the Tanning Rack. Apart from the lowliest (Minor Refine Mineral Ore), they will require you to have a certail rank of the Alchemist perk, will require a ruined book, an alchemist skill book of appropriate power and a soul gem (the recipe is drawing from the idea that you are\r\nresearching these spells through book learning and dubious practices). All the spell tomes could also be found in an appropriate location quite near to Riverwood in which you could also find an alchemist skill book and a few ruined books, but I\\'ll give you a few hints:\r\n- The spellbooks are in a basement.\r\n- The location is hidden in the wild, but it\\'s a vanilla location.\r\n- The location\\'s owner is somewhat related to the black arts.\r\n\r\nNote also that I\\'ll release a version compatible with Jewelcraft since I\\'ve been authorized to use some of its assets to improve the compatibility with it. The Jewelcraft-compatible version will have more \\\"steps\\\" for the Refine Charcoal spell. \r\nIn fact, the CK is driving me crazy since it tends to \\\"lose\\\" data from other mods and \\\"break\\\" the parts of my mods tied to them, so I\\'m asking for permission to mod authors to add parts of their mods in order to avoid this \\\"data loss\\\" \r\n(which could be surely due to my fault, but I do have my limits...but redoing things 10 times because the CK delete them it\\'s beyond those limits!).\r\n\r\nNote the 1.2 will be the last version which won\\'t require Jewelcraft. \r\n\r\n\r\nCHANGELOG\r\n1.2\t\tUpdated the mod for 1.6 version of Skyrim.\r\n1.1\t\tMade the spelltomes craftable and added to a specific location of Skyrim.\r\n1.0\t\tRefinement spells created.\r\n\r\nPLANNED FEATURES\r\n- Implement a method to acquire the spell tome in-game (instead through console).\r\n- Make a Jewelcraft-compatible version of the mod (I\\'ve already asked Happy_spike the permission to do it and release it, but I\\'ll only release it if the permission is granted).\r\n\r\nINSTALLATION\r\nJust unpack the content of the zip file into your Data directory, select \\\"Advanced Transmutation.esp\\\" and it should work properly.\r\n\r\nUNINSTALLATION\r\nRemove all spells and items through console commands, deselect \\\"Advanced Transmutation.esp\\\", cancel AdvancedTransmutation.bsa, AdvancedTransmutation.bsl and AdvancedTransmutation.esp and the whole package should be uninstalled.\r\n\r\nCREDITS\r\n- Bethesda for making Skyrim and the vanilla Transmutation script (which inspired my mod).\r\n- Fowl for explaining me where to input the \\\"Property things\\\"\r\n- Turn on a Dime for giving me a deeper explaination on how the Properties worked in CK and giving me some hints about how Array variables worked in Papyrus.\r\n- Dave Humphrey for pointing me out why my original script failed to compile (emmh...I wanted to declare one array as variable...too bad that\\'s not possible! :( )\r\n- Thanks to Happy_spike for allowing me to use some parts of his great mod \\\"Jewelcraft\\\" to improve the compatibility with my mod and to release this variant.",
  "categoryId": "75",
  "version": "1.2",
  "author": "AghnaarMareth",
  "createdUnix": "1329176102",
  "updatedUnix": "1340274455",
  "containsAdultContent": false,
  "uploadedBy": "AghnaarMareth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30683",
      "name": "Advanced Transmutation",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Advanced Transmutation-9484.zip",
      "uploadedUnix": "1329176325",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/79a302318bb283ba1b98c3b697cbf02a1fed687ba7d99d9d2086c406cc44afa9/analysis/1406680022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Advanced%20Transmutation-9484.zip?fid=30683&ttl=1535769055&ri=8192&rs=8192&setec=03a0a4b40f7842f34a22229c0fe2bcae"
    },
    {
      "fileId": "37297",
      "name": "Advanced Transmutation Craftable and Lootable 1-1 Zip Version",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Advanced Transmutation Craftable and Lootable-9484-1-1.zip",
      "uploadedUnix": "1330293353",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b9142ab01f6e1d5224eb894ca9b20ff4b2d59282cc2b7d99129ea25ac1926009/analysis/1406715677/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Advanced%20Transmutation%20Craftable%20and%20Lootable-9484-1-1.zip?fid=37297&ttl=1535769056&ri=8192&rs=8192&setec=ebb783c5bc0271dd60b80da41fdf5481"
    },
    {
      "fileId": "40024",
      "name": "Advanced Transmutation Craftable and Lootable 1-1 Rar Version",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Advanced Transmutation Craftable and Lootable Rar Version-9484-1-1.rar",
      "uploadedUnix": "1330886214",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/38083ab9c8bf59d27f9349403db9afab0f1d9ef1659948ca565f3fc057db3118/analysis/1406730259/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Advanced%20Transmutation%20Craftable%20and%20Lootable%20Rar%20Version-9484-1-1.rar?fid=40024&ttl=1535769057&ri=8192&rs=8192&setec=4de30f719638f83a2dc0045a317ccc7e"
    },
    {
      "fileId": "69374",
      "name": "Advanced Transmutation Craftable and Lootable Zip Version",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Advanced Transmutation Craftable and Lootable Zip Version-9484-1-2.zip",
      "uploadedUnix": "1340274426",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/4ac77fd5248225b6bf4a5eda2e8a094eaee42e69e8512b9eae0a6e51bddb944d/analysis/1406973254/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Advanced%20Transmutation%20Craftable%20and%20Lootable%20Zip%20Version-9484-1-2.zip?fid=69374&ttl=1535769057&ri=8192&rs=8192&setec=a090dd23b8a5cbd9a1925532750f6972"
    },
    {
      "fileId": "69375",
      "name": "Advanced Transmutation Craftable and Lootable Rar Version",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Advanced Transmutation Craftable and Lootable Rar Version-9484-1-2.rar",
      "uploadedUnix": "1340274455",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/76af74136340abbf16f4391a838562f8424c333c02790de29166fccf53f13b84/analysis/1406973255/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Advanced%20Transmutation%20Craftable%20and%20Lootable%20Rar%20Version-9484-1-2.rar?fid=69375&ttl=1535769058&ri=8192&rs=8192&setec=18e33a4c49bea0979c50573c354b872e"
    }
  ]
}