{
  "modId": 9487.0,
  "modName": "Markarth Vlindrel Hall Redecoration",
  "summary": "Replaced many useless objects to make Vlindrel hall more like a warrior\\'s home.",
  "descriptionHtml": "**In throne room replaced top row of weapon plaques with city/faction shields as decoration. Remove placed weapons before updating. If you can\\'t Reach them press \\\"~\\\" then enter \\\"TCL\\\" float around until you get your weapons back. Then apply the new version.\r\n\r\nV0.2 Lowered weapon plaques, made accessible the 4 that were not working properly.\r\n\r\nMarkarth Vlindrel hall:\r\nEntrance: Removed useless plants and clutter and added 12 weapon racks.\r\n\r\nMain room: Removed reading tables by the fireplace and made a small forge. (Tanning, grinding wheel, armor table,  anvil, chests and storage.\r\n\r\nAlchemy room: Removed clutter and replaced it with 16 containers for your ingredients.\r\n\r\nEnchant Room: Removed clutter added 2 strong boxes on altar and 10 weapon racks\r\n\r\nBack Room: Between the bedrooms, I removed everything and made a throne room with 8 new mannequins, 12 weapon plaques, weapon rack for 4, and 6 storage containers. \r\n\r\nMannequins: Buggy, will wander until you go to their pedestal and activate their inventory, then they revert to normal.\r\n\r\nIf you already own the hall, then the table clutter will fall on the floor and you will have some housekeeping to do. If you did not yet get the hall, well it \\\"should\\\" work fine, I don\\'t know.\r\n\r\nBuilt off vanilla Skyrim, no dependencies. \r\n\r\nThis is my first public mod ever, and the first one I made since Morrowind GOTY. Take it, use it, change it, burn it, whatever you want, I give it freely to the community. If someone knows how, or does fix my mannequins please share how, or the file!\r\n\r\nP.S. Ok first time compressing something with 7z. If it fails to work let me know.",
  "categoryId": "67",
  "version": "0.3",
  "author": "Carlton Schmoyer",
  "createdUnix": "1329177240",
  "updatedUnix": "1329399850",
  "containsAdultContent": false,
  "uploadedBy": "emt545",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32060",
      "name": "Markarth Vlindrel Hall Redecorate",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Markarth Vlindrel Hall Redecorate-9487-0-3.7z",
      "uploadedUnix": "1329399850",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/fb9a154cf7d5e9a88975324d05cc2bcb2b23ef76397f68f7951583aaec48dbda/analysis/1406687236/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Markarth%20Vlindrel%20Hall%20Redecorate-9487-0-3.7z?fid=32060&ttl=1535769061&ri=8192&rs=8192&setec=cf152ff51575e4572cca5f4186231d4c"
    }
  ]
}