{
  "modId": 9516.0,
  "modName": "Hokuto Shinken - The Fist of the North Star",
  "summary": "Adds in a full perk tree to the side of the two handed tree allowing your fists to become as great as Kenshiro\\'s.",
  "descriptionHtml": "Adds in a full perk tree to the side of the two handed tree allowing your fists to become as great as Kenshiro\\'s.\r\n\r\nFeatures 8 perks with many multi-level perks.\r\nAllows you to survive while fighting unarmed by allowing you to \\\"block\\\" enemy attacks by attacking at the same time. Watch out though if your stamina drops below 30% your ability to block will falter.\r\nUse special moves such as the Muso Tensei to gain the upper hand over your foes.\r\n\r\nNotes:\r\n- Even though the perk tree falls under two handed, increasing your two handed skill isn\\'t neccissary and does not effect unarmed damage. Only working your way up the Hokuto Shinken perks will up your damage.\r\n- The only requrements for the next tier of Hokuto Shinken perks are having the previous levels.\r\n- At the moment the only requirement for Muso Tensei is that you have Hokuto Shinken Mastery, it will activate automatically when an enemy is about to hit you as long as you are not attacking. I don\\'t believe I will ever make a hard set requrement for learning Muso Tensei such as killing a companion as I think that should be up to the player if they feel they should have it or not.\r\n- I want to keep this mod fairly balanced so it will never make you completely invincible and you can still be taken out if you swing wildly even when you have all the perks.\r\n- If there is anything people would like to see changed or added feel free to leave a comment or send me a message.\r\n- Next version will include multiple fighting styles, more special moves, and expanded pressure point system. Also blood, hopefully lots of it.\r\n\r\n&#12362;&#12414;&#12360;&#12431;&#12418;&#12358;&#12375;&#12435;&#12391;&#12356;&#12427;&#12290;&#12290;&#12290;",
  "categoryId": "24",
  "version": "1",
  "author": "randombattle",
  "createdUnix": "1329186262",
  "updatedUnix": "1329186434",
  "containsAdultContent": false,
  "uploadedBy": "randombattle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30778",
      "name": "Hokuto Shinken",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Hokuto Shinken-9516-1.zip",
      "uploadedUnix": "1329186434",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/5d084ed93ec21ad9f36a67d5951a260620f80bc19be4a54def4b50c3bb274dee/analysis/1406680583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hokuto%20Shinken-9516-1.zip?fid=30778&ttl=1535769123&ri=8192&rs=8192&setec=4eda5ac79e46a1385b872e2f6fea6aaa"
    }
  ]
}