{
  "modId": 9541.0,
  "modName": "Nchuzzrezar - a dwemer mansion",
  "summary": "An elegant, lore-friendly Dwemer-style player mansion nestled in a mountain valley West of Lake Klinalth. Return this ancient ruin to it's former glory through a wide variety of purchasable upgrades and a new quest with fully developed dungeon. Navmeshed and companion friendly. All of the amenities are included.",
  "descriptionHtml": "[img]http://i.imgur.com/lFKpRG4.jpg[/img]\n<br />[img]http://i.imgur.com/oPtmB2w.jpg[/img]\n<br />\n<br />An elegant, lore-friendly Dwemer-style player mansion, nestled in a mountain valley within the Falkreath Hold region. Rebuild this ancient ruin and return it to it's former glory through a wide variety of purchasable upgrades. Discover hidden treasure and explore the back story of the house with a quest and fully developed dungeon. The whole house (excluding the balcony, barracks and dungeon) is entirely in one interior cell so there are virtually no load screens. \n<br />\n<br />Speak to the confused Dwemer automaton [b](make sure subtitles are enabled)[/b]in the ruins of Nchuzzrezar just West of Lake Klinalth to begin. \n<br />[i][u]\n<br />[color=#00ffff][size=4][b]NOTE: THIS MOD IS NO LONGER BEING WORKED ON AND WILL RECEIVE NO FURTHER UPDATES.[/b][/size][/color][/u][/i]\n<br />\n<br />[img]http://i.imgur.com/AKSADNa.jpg[/img]\n<br />Most upgrades must be purchased, with the exception of the Portal Room which requires that you complete the quest and dungeon (needs Observatory upgrade to become available). This is done so that there is some sense of accomplishment when you have a fully upgraded house, and to use up some of that excess gold. I personally think you should have work a little bit for your home for it to have any real value. The house with all upgrades costs 128,000 septims in total.\n<br />\n<br />[b][u]Possible upgrades:[/u][/b]\n<br />[list][*]Baths - with a hot spring-fed pool and luxurious hot tub\n<br />[*]Exterior courtyard improvements - Includes secure gate, stables, scenic exterior walkway and general aesthetic improvements.\n<br />[*]Mountain-top tower - offers a stunning view of the surrounding area, including a dining area, defensive traps and firepits.\n<br />[*]Alchemy garden - contains all known plants, plus 12 brand new ones from other TES games (courtesy of [url=http://skyrim.nexusmods.com/mods/15108]Harvestables[/url])\n<br />[*]Bedroom - a relaxing place to rest your head\n<br />[*]Armoury - tons of mannequins, display cases, weapon racks and storage. Includes custom scripted display cases to show off your daedric artifacts.\n<br />[*]Dining room &amp; Kitchen - fully outfitted for all of your culinary needs\n<br />[*]Library and Fungus Garden - space for over 500 books, alchemy and enchanting stations, and an observatory\n<br />[*]Forge - custom made forge room with lots of storage and all crafting stations (leatherworking, grindstone, workbench, smelter and forge).\n<br />[*]Treasure Vault - a secure space for your most valuable possessions. Includes custom scripted displays for dragon priest masks, eyes of the falmer and dragon claws.\n<br />[*]Portal Room (must complete the quest/dungeon) - teleporter access to all major dwemer ruins.\n<br />[*]Personal Animunculi - your own personal army of guards and service automatons\n<br />[*]Barracks - a simple place for your companions to rest and relax.\n<br />[/list]\n<br />Always back up your saves and/or remove items from the house before updating to a new version. Your possessions will rarely be in danger, but in this case it's better to be safe than sorry. When upgrading to a new version it is often best to do so with a [url=http://arwenevecom.ipage.com/Skyrim/Skyrim-Tips.htm#Clean_Save]clean save[/url] to avoid issues.\n<br />\n<br />Nchuzzrezar is a Nexus-only mod. Please do not upload it on the Steam Workshop or on any other webpage without my explicit permission. \n<br />\n<br />[img]http://i.imgur.com/pUYk4IF.jpg[/img]\n<br />Simply use the Nexus Mod Manager link or extract the archive to your Skyrim/data folder, activate both the esp and esm, double check that your load order is correct, and play! \n<br />\n<br />[img]http://i.imgur.com/DNqKEfj.jpg[/img]\n<br />[b]Can't find the daedric artifact displays?[/b] Mouse over the display cases in the armoury and the name of the daedric artifact should appear. Simply activate with 'e' and it will be moved from your inventory to the display case.\n<br />\n<br />[b]If the quest isn't progressing after you loot the data cube:[/b] Try dropping it on the ground and picking it back up. It is scripted to go to the next stage of the quest upon being looted, but for some players this doesn't happen. I don't know why. &gt;.&gt;\n<br />\n<br />[b]Getting CTDs?[/b] Whether it be on loading a save, entering the area or finishing the quest, this is caused by a mod conflict or load order issue of some kind. Please make sure Nchuzzrezar.esp is loaded last (or close to last). Failing that, try selectively disabling other mods to see which combination is causing the crash. Loading too many memory-intensive mods can also cause CTDs, so be selective when choosing which ones you want to run. This mod has been tested extensively and does not cause crashes.\n<br />\n<br />[b]Large sections of walls, floors and other parts of architecture disappearing inside the house?[/b] This is caused by an incorrect load order. Try reordering you mods.\n<br />\n<br />[b]Can't talk to the NPC?[/b] Make sure subtitles are enabled in general settings to see the quest text. If the NPC won't initiate the dialogue at all, please either rest for 24 hours or fast travel away and come back. Alternatively you can try unpacking the .BSA file and using loose files instead. Future updates will include a 'loose files' option to make this easier.\n<br />\n<br />[b]Is the text flying by too quickly to read?[/b] You are missing some or all of the sound files. Please try manually downloading and installing the mod.\n<br />\n<br />[b]Don't get the option to buy an upgrade, just \"No, not right now.\"?[/b] You don't have enough gold for the upgrade. \n<br />\n<br />[b]Think the vault would be more awesome if it had a closing animation?[/b] Me too. Unfortunately it doesn't come with one and I'm not a graphic artist/animator (or whatever skillset you need for something like that). Until Bethesda or an ambitious modder makes one we have to deal with the jarring insta-close - sorry.\n<br />\n<br />[b]Find the house too dark?[/b] Some ENB and lighting mods make interiors and dungeons far darker than vanilla. I personally prefer brighter interiors and don't intend to make the interior lighting of the house compensate for the myriad of lighting mods available. At this time I am happy with the lighting in Nchuzzrezar. In my game I use The Wilds ENB.\n<br />\n<br />[color=yellow][b]Mods used by Nchuzzrezar:[/b][/color] \n<br />[i]Always with permission. Please support these mod authors by endorsing them. All are included in the main file - no need to download these separately.[/i]\n<br />\n<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=12468]Automatic Item Storage[/url] and [url=http://skyrim.nexusmods.com/downloads/file.php?id=8431]Alchemy Ingredient Storage[/url] by Manilla Turtle\n<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=15108]Harvestables[/url] by ChickenDownUnder\n<br />Serpent Staff by [url=http://skyrim.nexusmods.com/modules/members/index.php?id=984264]LittleBaron[/url]\n<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=3871]Weapons of the Third Era[/url] by 747823\n<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=15997]Texture DisplayCase Noble and Dwemer[/url] by Tonynarko67\n<br /> [url=http://skyrim.nexusmods.com/mods/22018]New Plants[/url] by [url=http://skyrim.nexusmods.com/users/776954]Tamira[/url](uploader/textures)/[url=http://www.sharecg.com/pf/full_uploads.php?pf_user_name=yughues]Yughues[/url](models)\n<br />\n<br />[color=yellow][b]Supported and Recommended Mods:[/b][/color] \n<br />[url=http://skyrim.nexusmods.com/mods/24913]Skyrim Immersive Creatures[/url] - An excellent mod that adds a wide variety of lore-friendly enemies to the game. (including the leveled lists used in the dungeon)\n<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=10652]Vanilla Mannequin Script Fix[/url] by SluckyD - Fixes many mannequin bugs\n<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=10462]Tamriel Compendium[/url] by Cliffworms OR [url=http://skyrim.nexusmods.com/mods/5398]Books Books Books[/url] by Adolon - Adds tons of books from other TES games. Perfect for filling that enormous library!\n<br />\n<br />[color=yellow][b] Incompatible Mods:[/b][/color]\n<br />Skov Klan Hjem - occupies the same exterior cell.\n<br />\n<br />[img]http://i.imgur.com/8bqZvxT.jpg[/img][list]\n<br />[*][b]02/27/2013[/b] - Fixed the small area of floor tile that I inadvertently deleted in Nepos' house.\n<br />[*][b]02/16/2013[/b] - Fixed ebony blade display. Tweaked lighting. Fixed the flickering wall in the bedroom. Fixed navmesh to allow for proper companion sandboxing. Added display for gold dragon claw in the vault. Changed the steam centurion patrolling the hall into a sphere to get rid of the loud stomping noises. Various other small tweaks throughout the house. [color=red][b]Important Note:[/b][/color]The wooden bookshelves in the upper observatory floor have been removed. Make sure you remove all books from these shelves before updating to avoid losing them!\n<br />[*][b]02/10/2013[/b] - Fixed missing bed. Uploaded fixed bsa archive.\n<br />[*][b]02/05/2013[/b] - General fixes throughout the house. Got rid of the floating chest in the armoury. Fixed some items that were showing up before being activated. Fixed some various flickering issues. Got rid of a couple of vanilla script edits that slipped past my radar. Many more small changes throughout.\n<br />[*][b]01/15/2013[/b] - Fixed the issue causing the vampire bedroom to disappear.\n<br />[*][b]12/04/2012[/b] - Added Daedric artifact displays to display cases in the armory. Moved button for the gate flamethrower trap to the gate itself. Brought vampire version up to date.\n<br />[*][b]10/05/2012[/b] - Revamped the vault to be a display area for dragon priest masks, dragon claws and eyes of the falmer. Moved chests out of the vault and into the armory. Added loot display options for a few other rare loot items throughout the house - more to come later. Rearranged the forge slightly for better workflow. Added the ability to link the dungeon elevator to the main elevator of the house. Added Blackreach access - follow the river in the Blackreach area of the custom dungeon to find the entrance. Vampire edition to follow eventually.\n<br />[*][b]09/26/2012[/b] - Quick update to fix the erroneously placed bone pile for the vampire version.\n<br />[*][b]08/29/2012[/b] - Fixed issue with entry area/hallway flickering. Added some decor to the corridor. Released separate Dawnguard-required esp with a vampire bedroom - requires access to the Portal Room due to it's location. As it isn't lore friendly this upgrade will not be added to the quest dialogue. Added new Dawnguard plants to library and fungus garden.\n<br />[*][b]08/09/2012[/b] - Tweaked mod structure to allow for better compatibility - should reduce CTDs caused by conflicts with other mods. Removed balcony ballista and added 3 defensive buttons; use caution with courtyard incineration as it will kill anything wandering the grounds, including your guard and livestock. Added a surprising new mushroom to the fungus garden and dungeons. Added companion barracks (separate cell due to space constraints), included with bedroom upgrade. Tweaked interior lighting. Added [url=http://skyrim.nexusmods.com/mods/22018]New Plants[/url] by [url=http://skyrim.nexusmods.com/users/776954]Tamira[/url]/[url=http://www.sharecg.com/pf/full_uploads.php?pf_user_name=yughues]Yughues[/url]. Fixed floating rocks in the exterior. \n<br />[*][b]08/01/2012[/b] - Changed the way the quest begins, hopefully eliminating the issues with the NPC not starting the dialogue. Added exterior walkway and more details to the facade. The new walkway can be accessed through a door in the courtyard and requires the balcony upgrade. Removed sorting from many containers throughout the house.  Removed the last remnants of the Outpost, LOD included.\n<br />[*][b]07/30/2012[/b] - Fixed long pauses in dialogue by reducing length of silent sound files from 60 seconds to 10. Pauses still exist but now last a max of 10 seconds as a result of this change. Rearranged interior forge, adding a tanning rack. Removed exterior forge, replacing it with a stable. Exterior upgrade now also straightens up the facade of the house. Fixed stairs in final dungeon battle. Fixed issue where portals worked before quest completion. Fixed bedroom navmesh. Added light source to pre-upgrade alchemy garden torch. Fixed bedroom weapon rack, lowered or angled dagger display cases to better show off their contents. Made the 'strange memo' in the dungeon readable - was not supposed to be all in dwemer script. Fixed conflict with Dead Bee Scrolls (possibly some others also).\n<br />[*][b]07/17/2012[/b] - Cleaned the mod entirely, will no longer affect Vlindrel Hall or any other cell in any way. Fixed various NPC dialogue issues (the occasional long delay is still there - working on a fix). The changes to the NPC may help to resolve some mod conflict issues as well. Fixed issue with the quest not progressing after getting the data cube. The quest will now be marked cmpleted once finished. Removed daedra statues and replaced them with lore friendly alternatives. Added a smelter to the indoor forge. Removed most of the display hall, replacing it with an expanded alchemy garden (still tons of mannequins in the armoury). Changed the layout of the bedroom. Added all new plants from ChickenDownUnder's Harvestables mod. Tweaked decor throughout. As a side note, many issues with the mod can be fixed by placing Nchuzzrezar at the very top of your load order... YMMV. \n<br />[*][b]04/30/2012[/b] - Fixed issues with the NPC not speaking or not offering the quest after purchasing the observatory. \n<br />[*][b]04/30/2012[/b] - Added a new room upgrade - the Portal Room - with a corresponding quest and dungeon. The observatory upgrade must be purchased in order to begin the quest. Fixed some navmesh issues in the house. Changed display cases to dwemer textures, courtesy of 'Texture DisplayCase Noble and Dwemer' by Tony67. Tweaked imagespace. Nchuzzrezar now includes a couple of new harvestable plants from 'Harvestables' by ChickenDownUnder.\n<br />[*][b]04/04/2012[/b] - Fixed exterior CTD issue. The mod now has an esm and esp file, both of which must be loaded to avoid issues. Added a few more automatons. Fixed some random decorative issues and a misaligned room. Added sorting capability to all containers in the house. Thanks for all the comments which helped me to narrow down these bugs!\n<br />[*][b]04/04/2012[/b] - Fixed broken weapon racks and plaques. Added dagger display cases. Tweaked room primitives to prevent things from flashing in and out of view. Fixed some spiderwebbing. Added support for Automatic Item Storage and Alchemy Ingredient Storage. There are now Ore Storage Chests and Crafting Chests (interior and exterior forge), Alchemy Satchels (library) as well as Storage Urns and Chests (bedroom and kitchen) which will sort and store items for you. \n<br />[*][b]04/01/2012[/b] - Bugfix update. Tweaked navmesh slightly. Added some minor decorative touches, added ore to the fungus garden, removed crafting terrace upgrade - now part of the library. Expanded kitchen and dining room. Added more detail to the exterior facade. Fixed some errors in the upgrade dialogue and added a new lore branch to the conversation. Fixed the bug which added gold to pawnbrokers. \n<br />[*][b]03/23/2012[/b] - Added armoury, treasure vault, interior forge and automaton upgrades. The automaton upgrade includes a merchant with 20,000 gold and costs 30,000 to buy, hopefully making it somewhat balanced. Combined the interior cells of the mod to cut down on loading screens. Revamped the dialogue a bit to make upgrading easier. Fixed some typos and other small bugs throughout. Dwemer urns are now usable containers.\n<br />[*][b]02/29/2012[/b] - Fixed the issue where some rooms flickered in and out of view. Made shield plaques usable and added more throughout the house. Tweaked the decor a bit, revamped the lighting in the main hall, added some flora and fauna to the fungus garden, added music throughout the house, fleshed out the library  decor a bit, added storage and switched the bedroom bookshelves to the metal dwemer style shelf. Still working on reloading the ballista... not as easy as I thought. Added an easter egg in homage to one of my all time favorite games. If you find it and actually know of the game then you get serious bonus points.\n<br />[*][b]02/25/2012[/b] - Added a new upgrade - the Observatory floor. Features a library with space for over 500 books and a scenic fungus garden in true Blackreach style.\n<br />[*][b]02/20/2012[/b] - Returned the buyable upgrades. Fixed the issue where the sound of running water plays in every cell in the game, added and tweaked various decor items. Revamped grounds so that Nchuzzrezar is encircled by rocky cliffs, added a stream, small waterfall and new defensive gate and courtyard structures.\n<br />[*][b]02/16/2012[/b] - Fixed chests throughout so they don't respawn and destroy your stuff. Things in chests as well as items you place around the home, whether in or out of weapon racks and plaques are safe between updates. Just tested that. Quest progress and status of upgrades will be retained as well. Overhauled lighting in the main room. Now brighter and has some shadow casting lights, far less flicker. Fleshed out the forge a little more and added a statue to the garden. \n<br />[*][b]02/16/2012[/b] - Added questline and buyable upgrades. Added underground baths including hot tub and pool. Fixed lighting issues overall. Fleshed out courtyard with smelter, dragon perches, flowerbed and better portcullis. Added more decorations to the interior including statues and murals. Created new, larger balcony with lift. Fixed navmesh so companions can enter your house.\n<br />[*][b]02/14/2012[/b] - Added exterior grounds with a forge and some livestock. Will have buyable upgrades in the future. Fixed another buggy light inside. Addendum: Fixed all remaining glitchy lights. Fixed and tested all weapon racks and plaques - they will now mount properly and will stop stealing items. Resized enchanting table to fix animations. Also added a balcony with a glorious mountain view just because. \n<br />[*][b]02/13/2012[/b] - Fixed some bugged lights. Removed broken weapon racks and plaques; added more working ones. Added more storage and changed some furniture, more in keeping with dwemer theme. Increased general brightness.\n<br />[*][b]02/13/2012[/b] - Initial release.[/list]",
  "categoryId": "67",
  "version": "1.3a",
  "author": "crgobi",
  "createdUnix": "1329196386",
  "updatedUnix": "1362026162",
  "containsAdultContent": false,
  "uploadedBy": "crgobi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000013809",
      "name": "Nchuzzrezar13a",
      "version": "1.3a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16826",
      "fileName": "Nchuzzrezar13a-9541-1-3a.rar",
      "uploadedUnix": "1362026162",
      "modVersion": "1.3a",
      "virusScanUrl": "https://www.virustotal.com/file/a10ea8bb5b6fe1d593ccff45f5ed2db6327e4c4bde88cd024d8b22adf2c58334/analysis/1407443726/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nchuzzrezar13a-9541-1-3a.rar?fid=1000013809&ttl=1535769169&ri=8192&rs=8192&setec=6a4a88cb1c986f8a808f22dc782357ca"
    }
  ]
}