{
  "modId": 9543.0,
  "modName": "Body Piercings with Collar and Wrist Shackles for CBBEv3",
  "summary": "Your Skyrim female character can now have body piercings complete with wrist shackles and a stylish collar. ",
  "descriptionHtml": "Warning:\r\n\r\nNexus forum rules: \\\"Don\\'t like it? Don\\'t use it, but pass in silence.\\\"\r\n\r\nInstructions:\r\n\r\n***For use with CBBEv3***\r\n\r\nKnown Issues:\r\n\r\nThe body is currently set to one size; aka it will not \\\"slide.\\\" You have two choices atm. CBBEv3 \\\"slim\\\" (A cup) and CBBEv3 \\\"silly huge\\\" (FF cup?) \r\n\r\nWhile standing the piercings are perfectly positioned, but if you go into \\\"sneak\\\" mode, the rings will move out of place. This really isn\\'t a bit deal unless you take the camera and really put it at an extreme angle where you can see the displacement. \r\n\r\nNotes:\r\n\r\nThis mod is setup to replace your \\\"nude\\\" character meshes. Of course if you\\'re a savvy modder, you can take this mod and use it for any armor in the game you like. Even better, take this and set it up as a unique race if you know how and the sliding problem becomes even less of an issue.\r\n\r\nCBBEv3 TEXTURE FILES ARE NOT INCLUDED!!!!! You need to get these files if you\\'re not already running v3. v2 files *might* work, but there could be some \\\"weirdness.\\\" \r\n\r\nI\\'ve setup the collar texture files to be different than magnemoe\\'s \\\"leather collar\\\" mod on Nexus. (see credits) This way, you\\'ll be able to tell at a glance if you have his collar equipped or if your character is \\\"stark naked.\\\" (wearing only her piercings, shackles, and collar) \r\n\r\nThe tattoos in the screenshots are not available at this time. As you can see from colors in some areas but not others, they are still a WIP.\r\n\r\nCredits:\r\n\r\nCaliente for making such a great body mod for all of us to use.\r\n\r\nI used one object from one mesh (wrist shackles) in 2pac4eva7\\'s armor set located on another website. I\\'ve seen this object used in other designs, so I don\\'t know exactly who the creator is, but I\\'m trying to provide \\\"due credit.\\\"\r\n\r\nA guy named \\\"werewolf\\\" who\\'s work I\\'ve only seen on another website. Again, I took one object from his mod and that\\'s it. So in effect, I took the object from his mesh, then setup a different way to use it, and magnemoe took what I did and made his own mod. (search nexus for \\\"leather collar\\\") \r\n\r\nReally, all I\\'ve done is take a bunch of objects from a lot of separate meshes and smash them together in a creative way to do something never seen before. \r\n\r\nPermissions:\r\n\r\nRip it, hack it, use it, mod it etc. There are many better authors out there than me. Take the idea and improve upon it. This is how things should be done in our electronic world; it\\'s not like I\\'m making money off of this. Just throw my handle/name into the credits and send me a PM\\'ed link to the new mod okay? (read: NOT duplicated and uploaded) If I like it, I\\'ll probably end up using it. \r\n\r\n\r\nBest Regards,\r\n\r\n\r\nJammer\r\n",
  "categoryId": "60",
  "version": "v1",
  "author": "Jammer",
  "createdUnix": "1329198018",
  "updatedUnix": "1329198251",
  "containsAdultContent": true,
  "uploadedBy": "jammer2006",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30856",
      "name": "CBBEv3 Body Piercings Slim",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3265",
      "fileName": "CBBEv3 Body Piercings Slim-9543-v1.rar",
      "uploadedUnix": "1329198151",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/78582aae75f950e29c25fa454e959e7b195c1988df37ea475bfd284ccf452bb8/analysis/1406681045/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CBBEv3%20Body%20Piercings%20Slim-9543-v1.rar?fid=30856&ttl=1535769171&ri=8192&rs=8192&setec=e29444ff97aef84e43cfe9c589c623ff"
    },
    {
      "fileId": "30857",
      "name": "CBBEv3 Body Piercings Silly Huge",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3297",
      "fileName": "CBBEv3 Body Piercings Silly Huge-9543-v1.rar",
      "uploadedUnix": "1329198251",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/b4d0550d484e48a5ed9896f6c94261b70f3ef553940ccb1a92ad53785f4bcf0c/analysis/1406681048/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CBBEv3%20Body%20Piercings%20Silly%20Huge-9543-v1.rar?fid=30857&ttl=1535769172&ri=8192&rs=8192&setec=69800765bc96c3d6047fb4370a7f96f4"
    }
  ]
}