{
  "modId": 9563.0,
  "modName": "Breezehome Library",
  "summary": "Book collectors, rejoice! You may now amass a proper library, rivaling that of Tamriel\\'s finest universities, in the basement of Breezehome, the player house in Whiterun",
  "descriptionHtml": "To better organize your library try my [url=http://skyrim.nexusmods.com/downloads/file.php?id=9828]book sorting[/url] mod: \r\n\r\nIntro\r\n-------\r\nOne of my favorite aspects of the TES world is the wealth of lore that can be found in the books. In every game I\\'ve obsessed about them, diligently reading and collecting as many as possible. I was excited to see that functioning book shelves had been implemented in Skyrim out of the box but disappointed in how few there were in the player homes. I want a personal library!\r\n\r\nFeatures\r\n-----------\r\n*** Book Shelves!!! - 11 large scripted bookshelves, allowing for display of almost 600 books\r\n\r\n*** Smithy - A separate complete smithing room with labeled storage and lots of display plaques and racks\r\n\r\n*** Realistic and Logical Floor Plan - Immersive/RP friendly layout - The basement is about the same size as the house, like a basement should be. The smelter is even vented outdoors to avoid asphyxiation, though it does leak a little smoke\r\n\r\n*** Realistic Customizable Lighting - All light is provided by lanterns, and all of the lanterns can be picked up like torches allowing you to darken or brighten the rooms to your preference\r\n\r\n*** Reading Lounge - Complete with booze-stocked shelves, because nothing goes better with a good book than a strong drink\r\n\r\n*** Office - With a desk and some storage for documents and supplies\r\n\r\n*** Secret Wall Safe - For the really special stuff\r\n\r\n*** Does not alter vanilla Breezehome except to add a single trap door to the alchemy room and delete the ugly rug in that same area. Most, if not all, other mods should be fully compatible. \r\n\r\n*** Collision Protected Display Shelves - This is an experimental attempt at making things stay on shelves and tables. There are invisible collision boxes that protect all of the non-scripted display shelves (the ones with the bottles and ingots) and the small round table. While the collision boxes are activated you cannot interact with anything on the shelves via cursor activation or by bumping them. To deactivate the collision boxes you must remove the \\\"Special Torch\\\" that is located behind the smelter. This will temporarily deactivate the collision boxes, allowing you to move the items around or replace them with items of your choosing. When you have everything the way you want it just replace the special torch and the boxes will re-activate. \r\n\r\nAdditional Notes\r\n----------------------\r\n-The activation status of the lanterns does NOT persist once the cell is unloaded. This means that if you deactivate some lanterns to darken the room and leave the cell all of the lanterns will be active again when you re-enter. I tinkered around a little bit with the torch scripts trying to fix this but it was taking to much time for me to nail down so I just moved on to the more important stuff, like the book shelves.\r\n\r\n-When picking up a lantern you will actually receive a torch, and when placing a lantern you will lose a torch. This is another thing that I tried briefly to fix and then went back to building bookshelves. I may try to fix this in an update, but for now just suspend disbelief and tell yourself that torch == lantern.\r\n\r\n-There are no nav meshes yet. I prefer stealth play and avoid using followers if possible so it wasn\\'t a priority for me to implement follower compatibility. Also, considering that they are too stupid to avoid repeatedly running into the same trap, can\\'t remember who I am despite living in my house and having sworn allegiance to me and (\\\"Are you lost?\\\" - Lydia), and have difficulty operating a wooden chair (Lydia, again) I can only assume they are all illiterate anyway and wouldn\\'t have much interest in a library. The most fun I\\'ve ever had with followers is ordering them to go stand next to a pack of giants. **WHACK** Have a nice trip, Lydia, and thank you for flying with Giant\\'s Club Airlines!\r\n\r\n-The collision boxes on the shelves are sort of an experiment. I have not tested them extensively and would appreciate any feedback regarding glitches or other mayhem that may occur. If they prove to be problematic you can permanently deactivate them by disabling the special torch via the console. Removing the special torch by activating it in-game will not remove it permanently because it will re-spawn when the cell reloads. The collision boxes will not stop shouts, spells, or arrows from affecting the contents of the shelves. If you shout or shoot at the shelves the items will stay inside the box on the shelf but will rattle around in that signature Havok-style. I did some testing in a few local libraries and found that shouting is also discouraged in real life libraries. Without exception it resulted in me being forcibly removed and/or threatened with arrest so I think real life libraries must have a similar glitch :)\r\n\r\nUpgrade Notes\r\n--------------------\r\n-If you have weapons mounted on the north-facing plaques when you upgrade from version 1 to 1a they will be floating below the plaque when you load your save. Just pick them up and put them back to fix this.\r\n\r\nRelease History\r\n----------------\r\n1 - Feb 14 2012 - Initial Release\r\n\r\n1a - Feb 18 2012 - Moved three north-facing weapon plaques higher to accomodate longer weapons on the racks below\r\n\t\t\t\t - Added a three-space weapon rack to the smithy\r\n\t\t\t\t - Added a shield rack to the hanging blacksmith sign\r\n\t\t\t\t - Added shrines to Dibella and Zenithar\r\n\t\t\t\t - Added music to match Breezehome",
  "categoryId": "67",
  "version": "1a",
  "author": "TRoaches",
  "createdUnix": "1329215999",
  "updatedUnix": "1329595760",
  "containsAdultContent": false,
  "uploadedBy": "tokeroaches",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33303",
      "name": "BreezehomeLibrary-v1a",
      "version": "1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26",
      "fileName": "BreezehomeLibrary-v1a-9563-1a.zip",
      "uploadedUnix": "1329595760",
      "modVersion": "1a",
      "virusScanUrl": "https://www.virustotal.com/file/642f4cfc72314b90c58f8d80ad6e7f131cd427287041529a741b5265f2d00930/analysis/1406693670/",
      "changelogHtml": " Moved three north-facing weapon plaques higher to accomodate longer weapons on the racks below <br/> \n Added a three-space weapon rack to the smithy <br/> \n Added a shield rack to the hanging blacksmith sign <br/> \n Added shrines to Dibella and Zenithar <br/> \n Added music to match Breezehome <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BreezehomeLibrary-v1a-9563-1a.zip?fid=33303&ttl=1535769242&ri=8192&rs=8192&setec=e0ae351e1da098142bbf953caae82683"
    }
  ]
}