{
  "modId": 9567.0,
  "modName": "BlueStar Adventure And Perk Mod",
  "summary": "This mod is basically an additional perk mod giving perks for all skills above 100 currently extending to 200 on many perk trees but all have been massively extended (+run speed perks) Also will include some new interesting places. Currently a work in progress dungeon is underway and I plan to update this in the future a lot.",
  "descriptionHtml": "V0.62 (Highly Recommend) (Update SKSE and Skyrim Uncapper)\r\n*Fixed some faults with perk tree crashing - checked all trees lots didnt crash now\r\n*Added A load of extra perks\r\n*Improved Dungeon a bit more\r\n\r\nV.6    \r\n*Added A Load Of Additional Perks\r\n\r\nV0.58\r\n*Dungeon Extension to new section altogether + futher work on exisitng dungeon and new part.\r\n*Additional Perks\r\n\r\nV0.571\r\n*Hotfix For Scarmuck - hes still kinda screwed up not what I wanted but hes not invisible now lol.\r\n\r\nV0.57\r\n* Dungeon fixes and slighly additions\r\n* Heavy Armor Perk Changes + More Heavy Armor Perks + Additional Perks to other trees\r\n\r\nV0.56 \r\n* Huge Dungeon Improvement.\r\n\r\nV0.55\r\n* Added Lord Armor Set and The Scout Armor Set for 140 Smithing (Credit to Doodaboom) who created the sets and I worked them into my mod. Also there are some swords, a greatsword, bow, arrows, daggers and shields that go into it.\r\n* Improved Whiterun Cave Dungeon\r\n* Addtional Perks\r\n\r\nV0.5\r\n* Added Mithric Weapons of all Types of Weapons (8 Weapons) to Mithric category making Mithric a complete heavy armor and weapon set all available for smithing at 120 skill. (Considering adding light amor set too for this)\r\n* Added Some More Over 100 Skill Perks :)\r\n* Improved Whiterun Cave Dungeon and npcs are a bit more fluent as well now; however as you can see this Dungeon is still kinda messed up and Im hoping it to be a gaint multi part dungeon one day.\r\n\r\nV0.43\r\n*Fixed Major Bug causing all chests to give same stuff as my new chests; I didnt duplicate my newer chests properly however everything is fine now.\r\n*Whiterun Cave Dungeon Improvement\r\n\r\nV0.42\r\n*Fixed Alchemy And SpeechCraft Crash\r\n**Improved Whiterun Cave Dungeon (Its gonna be great :) )\r\n\r\nV0.41 \r\n*Fixed Now You can Download\r\n*Fixed Armor\r\n*Improved Whiterun Cave Dungeon (Lots to do still)\r\n\r\n(BTW there are new versions of SKSE and Skyrim Uncapper than you really want)\r\nThis mod simply adds additional perks to all of the skill trees that are above 100 up to 150 - 220 at the moment but I plan to add even more hopefully in the future. It also features a small skill tree that lets you run a little faster But not too fast as it causes unbalance apparently.\r\n\r\nCurrently a work in progress dungeon is underway and I plan to update this in the future a lot; you can still enter and have some fun there though. Hopefully Im going to create quite a few new things for people to enjoy though.\r\n\r\nBtw Ive tested the perks in game and they all seem to be working just fine; even the one that was based off other scripts. I anticipate there is surely something broken somewhere so please tell me if you see a perk that does not work properly.\r\n\r\nThere is a dungeon in Whiterun (the entrance is a little tacky right now) that takes you into Whiterun Cave that Im hoping to develop into a aboslitely huge multi-part dungeon eventually. Im working hard to improve my skills with the construction kit and at the moment its very rough.\r\n\r\nThis mod doesnt require but is pretty useless without the Skyrim Script Extender and Skyrim Uncapper which allow you to level skills about 100. But seeing that most the perks in this mod require you to exceed 100 skill its pointless without them. Howevever its merely a case of moving a few files to your skyrim folder. You must all then you Skse_exec_loader when you load the game This is vital!\r\n\r\n------------\r\nINSTALLATION\r\n------------\r\nSimply place all files from the archive into your /Steam/Steamapps/Common/Skyrim/Data Folder.\r\n\r\nYou can get the Skyrim Script Extender from here \\' http://skse.silverlock.org/download/skse_1_04_10.7z \\'\r\n*At the location:\r\n* \\\\Steam\\\\SteamApps\\\\common\\\\skyrim\r\n* Place the below files 3 files simple as that. And Remember the Skse_loader.exe must then be used to load skyrim.\r\n* skse_1_4_21.dll\r\n* skse_loader.exe\r\n* skse_steam_loader.dll\r\n\r\nYou will require the skyrim uncapper also from here: \\' http://skyrim.nexusmods.com/downloads/download.php?id=26446 \\' \r\n* Simply extract the archive to your \\'Steam/Steamapps/Common/Skyrim Folder.\r\n\r\n",
  "categoryId": "24",
  "version": "0.62",
  "author": "BlueGreen",
  "createdUnix": "1329220650",
  "updatedUnix": "1331616438",
  "containsAdultContent": false,
  "uploadedBy": "Bluegreen0",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34859",
      "name": "BlueStar Adventure And Perk Mod 055",
      "version": "0.55",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54971",
      "fileName": "BlueStar Adventure And Perk Mod 055-9567-0-55.rar",
      "uploadedUnix": "1329847028",
      "modVersion": "0.55",
      "virusScanUrl": "https://www.virustotal.com/file/012498f62e9e8b6131924efae5625628a8b134d1ee2cf2a4d769fbff6d1d66df/analysis/1406701943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BlueStar%20Adventure%20And%20Perk%20Mod%20055-9567-0-55.rar?fid=34859&ttl=1535769249&ri=8192&rs=8192&setec=78a757f613a43ae0a8ecd6a37ac94de1"
    },
    {
      "fileId": "42849",
      "name": "BlueStar Adventure And Perk Mod 062 Update",
      "version": "0.62",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "185",
      "fileName": "BlueStar Adventure And Perk Mod 062 Update-9567-0-62.rar",
      "uploadedUnix": "1331616438",
      "modVersion": "0.62",
      "virusScanUrl": "https://www.virustotal.com/file/b05a7523e9f9afc5ead25ae8c3f13a53c388ac86af3325ba7df821abae9fd2a5/analysis/1406746382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BlueStar%20Adventure%20And%20Perk%20Mod%20062%20Update-9567-0-62.rar?fid=42849&ttl=1535769250&ri=8192&rs=8192&setec=bd51c651e9a82ea534b9a071820fa803"
    }
  ]
}