{
  "modId": 9572.0,
  "modName": "Bromjunaar Extended",
  "summary": "This mod adds two things, after all 8 mask are collected:\r\nThe Wooden Mask gets the ability to teleport you to Bromjunaar sanctuary from any place, and you\\'ll even be teleported back to the same place, when you take off the mask again.\r\nThe door in the sanctuary unlocks, and you\\'ll be able to use the place like a home. It\\'s been filled wit ehate",
  "descriptionHtml": "The reward for collecting all 8 Dragon Priest Masks is somewhat a letdown, so I decided to create this mod, which increases the reward significantly.\r\n\r\nNone of the masks have been tampered with, except for the Wooden Mask. In fact there\\'s hardly any change for players before all 8 masks have been collected. When that happens, however, this mod adds two things:\r\n1) The Wooden Mask gets the ability to teleport you to the sanctuary from any place, as long as you can fast travel from it. You\\'ll even be teleported back to the same place, when you take off the mask again.\r\n2) The door in the sanctuary unlocks, and you\\'ll be able to use the place like a home. The area has been filled with everything you may need, and there\\'s quite enough space for storage and display for most people.\r\n\r\nI was asked to upload this here, so I hope you enjoy.\r\n\r\n#=======================================================\r\nTechnical Stuff\r\n##\r\n\r\nInstall by extracting the contents of the .rar file to your data directory. Uninstall by deleting neaExtBromjunaar.esp and .bsa\r\n\r\nThe masks haven\\'t been altered, as mentioned earlier. Only the script of the Wooden Mask has been changed, which means that there should be no conflicts with mods changing the texture of any of the masks, nor any conflicts with mods that change the behavior of the nine named masks.\r\n\r\nTwo of the urns in the sanctuary, the two big ones by the door, originally respawn their contents, which is a bug in Skyrim. I\\'ve change them to not respawn, so they\\'re safe to use. however, I don\\'t know what\\'ll happen when an official update, that fixes the issue, comes. Hopefully it won\\'t cause any problems.\r\n\r\n##=======================================================\r\nUpdate\r\n##\r\n\r\nR20: There\\'s been added a way to remove the Wooden Mask while inside the sanctuary, without being teleported back. Look for the note descriping it by the throne.\r\n\r\nR19: There\\'s been added a variety of containers, some lighting has been changed, and I found out that the invisible wall I\\'d fixed earlier, wasn\\'t actually fixed. I have no idea what\\'s causing it, then, unless it\\'s the collision box of the sanctuary itself which is being weird, in which case I have no idea how to fix it\r\n\r\n##=======================================================\r\nFAQ\r\n##\r\n\r\nI don\\'t know where to find this place: \r\nLook around by the Labyrinthian ruins, until you find a wooden mask and a note.\r\n\r\nThe door is locked/I can\\'t teleport to the sanctuary:\r\nBe sure to have collected and placed all 8 mask on the altar in the sanctuary. In the case of not teleporting, be sure to be at a place from which you can fast travel as well. If it still doesn\\'t work, ask in the comments.\r\n\r\nI want a spouse:\r\nI considered it, but since you need the mask to get to the sanctuary and there\\'s only one, I\\'ve decided not to let let spouses move there. Also, it\\'s bothersome and I\\'m lazy.\r\n\r\nCan I use this with Psychosteves mod:\r\nYes. Read the description above.\r\n\r\nCan I use this mod with some other mod:\r\nRead the description above and judge for yourself. If all else fails, try it out.",
  "categoryId": "90",
  "version": "r20",
  "author": "Kristjan",
  "createdUnix": "1329224308",
  "updatedUnix": "1329224430",
  "containsAdultContent": false,
  "uploadedBy": "Neanor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30978",
      "name": "Bromjunaar_Extended_r20",
      "version": "r20",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "39",
      "fileName": "Bromjunaar_Extended_r20-9572-r20.rar",
      "uploadedUnix": "1329224430",
      "modVersion": "r20",
      "virusScanUrl": "https://www.virustotal.com/file/de0c16ac94edb880b1564057cb1dadd3db2bae7467de0ecaaa9834b0559336d1/analysis/1406681523/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bromjunaar_Extended_r20-9572-r20.rar?fid=30978&ttl=1535769258&ri=8192&rs=8192&setec=b072984c9515b4065ebdf2c06ee0090d"
    }
  ]
}