{
  "modId": 9582.0,
  "modName": "Umbra for Skyrim",
  "summary": "This plug-in adds Umba is Oblivion",
  "descriptionHtml": "Sorry for my English\r\nDescription: The mod adds a legendary cursed sword \\\"The sword Umbra,\\\" as well as the story of his return. In order to begin that quest swords, talk with Farengarom Vaytrane in, and buy his book, \\\"Confessions of Umbra,\\\" from which you learn about the plight of the last owner of the sword. But it certainly is not the main thing in the book include tips - where or who to look for.\r\nAnd there are two models of the sword Umbra - a copy of the original, they differ in both appearance and performance. You can buy, but the original - will have to either steal or kill its owner. Just note that the receipt of the sword is directly related to one of the Shadow Brotherhood quests, but rather the quest \\\"Thank Cities.\\\"\r\nModernization: Umbra Sword can be upgraded, it requires hard rubber bars. Blood is also displayed correctly ...\r\n\r\nIn version 1.5. was made two-handed version repleyser legendary sword, changed the number of charges for both types of swords, base damage, three volumes of \\\"Confessions of Umbra,\\\" united in one book, a little bit changed design.\r\n\r\nVersion 1.5.1 corrected a bug with the enchantment of the original sword ..\r\n\r\nInstallation: copy the contents of the archive in the Data folder",
  "categoryId": "55",
  "version": "1.5.1",
  "author": "Demolir ",
  "createdUnix": "1329231068",
  "updatedUnix": "1329321241",
  "containsAdultContent": false,
  "uploadedBy": "wmgprofan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31541",
      "name": "Sword of Umbra",
      "version": "1.5.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12582",
      "fileName": "Sword of Umbra-9582-1-5-1.rar",
      "uploadedUnix": "1329321241",
      "modVersion": "1.5.1",
      "virusScanUrl": "https://www.virustotal.com/file/c0ec417c4f9ff26d639e9cec6d20afcee350144476dd4858aa7df995d2aee1eb/analysis/1406684476/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sword%20of%20Umbra-9582-1-5-1.rar?fid=31541&ttl=1535769271&ri=8192&rs=8192&setec=b0acf837e28db6791ab1a07e978a8326"
    }
  ]
}