{
  "modId": 9614.0,
  "modName": "Armed to the Teeth",
  "summary": "Armed to the Teeth - Armed to the Teeth - Shield-on-Back, Staff-on-Back, and Multiple Weapons Support\r\n",
  "descriptionHtml": "[size=4][color=orange]The complete idiots guide to Armed to the Teeth by fellow ATT user Reaper511 can be found at the bottom of the page.  I will also be uploading it as a text file.[/color][/size] \r\n\r\n[size=4][color=\\\"#FF0000\\\"]TABLE OF CONTENTS[/color][/size]\r\n[list]\r\n[*]Current Progress\r\n[*]Description\r\n[*]Quick Showcase\r\n[*]Current and Future Features\r\n[*]How To Install/Uninstall\r\n[*]Load Order\r\n[*]Tutorials\r\n[*]Troubleshooting\r\n[*]Known CTD Weapons\r\n[*]Incompatibilities \r\n[*]Credits\r\n[*]Permissions\r\n[*]Version History\r\n[/list]\r\nIf you have have bug reports, suggestions or requests feel free to place in the comments or pm me(Mergweq).  Dahaka002011 has not been involved in this mod since its begining so pm\\'ing him wouldn\\'t be a good idea.   Also if anyone is familiar with scripts and thinks they know a way to make things better feel free to let me know :)\r\n\r\n[size=4][color=orangeRed]*IMPORTANT NOTE 1*[/color][/size]\r\n[color=yellowgreen]You can find custom weapons like Jaysus Swords, LOTR Weapons etc. here[/color]  [url=file.php?id=15373] Armed to the Teeth Custom Weapons Packs by Zeridian & misiek023[/url]  [color=yellowgreen]\r\n\r\nEveryone should check out [url=file.php?id=17746]DSpSoB - Dual Sheath plus Shields on Back by DarkPhoenixxy[/url]  for getting shields on the back and if you want dual weapon support in addition to custom mods with ATTT.  The shield position customization is not as easy like ATTT shields, but if the ATTT shields cause you CTDs I doubt you are going to care :) Just make sure that my skeletons are not installed as they will overwrite his. The rest of ATTT features will work as intended.  Check it out I highly recommended![/color]\r\n\r\n[size=4][color=orangeRed]*IMPORTANT NOTE 2*[/color][/size]\r\n[color=yellowgreen]This mod is pretty much stable when applied to custom mods or a smaller amount of vanilla weapons.  The Creation Kit and the editing of the SkyrimEditor.ini are not required if you do not plan on editing any weapons yourself and just want to use the custom packs or attempt the massive vanilla version[/color] \r\n\r\n[size=4][color=orangeRed]*IMPORTANT NOTE 3*[/color][/size]\r\n[color=yellowgreen]The vanilla packs will not work for everyone.  They have been created 3 times by 3 different people and we still can not get it stable for everyone.  For some reason when you mass add scripts to Bethesda\\'s items it just causes CTDs for some people.  The Custom Weapons packs and adding some vanilla weapons yourself however work fine.[/color] \r\n\r\n[size=4][color=orangeRed]*IMPORTANT NOTE 4*[/color][/size]\r\n[color=yellowgreen]If you are having problems with the mod not working for reasons aside from the CTD problem, the error is on your side.  The only reason I know this can happen is because you have a mod conflict, however there has been the occasional person who tries it on a clean save with the same problem. [/color] \r\n\r\n[size=4][color=orangeRed]*IMPORTANT NOTE 5*[/color][/size]\r\n[color=yellowgreen]I am thinking about redoing the tutorials vids to make them more in depth like the old ones I did, so if there is anything you guys want clearer post in the comments[/color] \r\n\r\n\r\n[center][img]http://static.skyrim.nexusmods.com/downloads/images/9614-1-1329245975.jpg[/img][/center]\r\n\r\n[size=\\\"4\\\"][color=\\\"#FFFF00\\\"]Current Progress[/color][/size]\r\nAs of right now I am re-writing the scripts with SKSE to use some of the features that have recently been added to it.  At the same time I am making sure it will remain fully compatible with any of the packs already created.\r\n\r\n\r\n[size=\\\"4\\\"][color=\\\"#FFFF00\\\"]Description[/color][/size]\r\nTired of being Houdini pulling rabbits out of hats - the rabbit being your claymore and the hat your bag? Wish you could actually see some gear and really LOOK armed to the teeth? Then clickly here.\r\nWhat this mod does is allow your character to actually seem like they are a force to be reckoned with.  In vanilla skyrim a character that uses a sword, 2h axe, and bow can only see the weapon that is currently equipped, the rest are just hidden magically in the inventory.  This mod allows the other weapons to be seen in their sheathed positions while another weapon is active.  Example: When using a sword, both my bow and 2h axe appear sheathed on my back.  I can switch to my bow and my sword will then become sheathed at the hip.  Staves and Shield-on-Back are also both fully working.\r\n\r\n[center][color=\\\"#00FF00\\\"][size=\\\"4\\\"]Quick Showcase[/size][/color][/center]\r\n[center][youtube]XGM2ncHfd9o[/youtube][/center]\r\n\r\n[color=\\\"#00FF00\\\"][size=\\\"4\\\"]Current and Future Features[/size][/color]\r\n[list]\r\n[*]Full favorites and Hotkey Support\r\n[*]Supports 1h Sword, Axe, Mace, Dagger, Bow, and one 2h Weapon at the same time\r\n[*]Quick Custom Weapon Mod Implementation.  Only takes 2mins using the construction kit to set up with any mod you want\r\n[*]Tutorials for getting the staff and shield on back, and models for them are now included\r\n[*]Esp\\'s that includes all vanilla weapons, shields and staves pre-done. \r\n[/list]\r\n\r\n[color=\\\"#FF8C00\\\"][size=\\\"4\\\"]How To Install/Uninstall[/size][/color]\r\n[list]\r\n[*]First thing when updating from a previous version(with any weapons or armor mod), place all weapons into a chest, then update the file.  Pretty much eliminates any chance of a save corruption. \r\n[*]To install extract the contents of the archive into the Skyrim/Data directory manually, or install using the Nexus Mod Manager (Recommended)\r\n[*]For the ESM version edit skyrimeditor.ini in the main Skyrim folder.  Add bAllowMultipleMasterLoads=1 to the end the General Section.(Only required if you are adding items yourself)\r\n[*]To Uninstall remove ArmedttTeeth.esp from the Skyrim/Data folder, and attbase and attbackup for the Skyrim/Data/Scripts folder.  Remove the ArmedttTeeth folder from the Skyrim/Data/meshes folder.  Remove skeleton.nif from Skyrim\\\\Data\\\\Meshes\\\\ actors\\\\character \\\\character assets folder.\r\n[*]Any weapons already in the current cell will either have to be dropped, or removed and re-added with the console\r\n[*]If you are still unable to remove the mod and did not back up you save, just leave the ESM enabled, it does not actually do anything without esps so it will not mess with your game.\r\n[/list]\r\n\r\n[size=\\\"4\\\"][color=\\\"#FF0000\\\"]Load Order[/color][/size]\r\nBoss should add them soon.  I would recommend if you use something lie Jaysus that has an ESM that the ArmedttTeeth.esm comes first.\r\n\r\nAttTWeapons1.esp\r\nAttTWeapons2.esp\r\nAttTWeapons3.esp\r\nAttTShields.esp\r\nAttTStaff.esp\r\n\r\nAny custom weapon mods can be placed anywhere.\r\n\r\n[size=\\\"4\\\"][color=\\\"#FF0000\\\"]Tutorials[/color][/size]\r\nGetting already modded weapons to work\r\n\r\nExample:\r\nEquip a sword, then equip a bow.  It will automatically create a reserve item in or inventory and automatically equip it for you.  If you decided then to equip a 2h sword, the same will happen for the bow and the 1h sword reserve will remain in it spot.  So your character will have all three weapons showing. If you wish to remove an item simply un-equip the weapon and then click on the reserve version in you inventory and it will be removed.  Any questions just post in the comments section.\r\n\r\n\r\n[youtube]PCcmgcRTdfI[/youtube]\r\nSorry for rambling a bit in this vid\r\nNote: Rest of the tutorials are in the videos section\r\n\r\n[size=\\\"4\\\"][color=\\\"#FF0000\\\"]Troubleshooting[/color][/size]\r\n[list][*]If the weapons do not work as intended the errors are most likley on the user\\'s end.  If you have problems with CTDs then the error is on my side, or a problem with the custom weapons you are adding them to\r\n[*]If shields or staves are not showing up correctly(like on the ground), make sure that you have the skeleton meshes installed correctly.  I will make patches for other mods that also alter the skeleton mesh.\r\n[*]Make sure all of the ESPs and the ESM are selected.  Also you might have to alter your load order around to get things to work properly\r\n[*]If using any custom mods make sure the skyrimeditor.ini is edited. Add bAllowMultipleMasterLoads=1 at the end of the GENERAL section,\r\n[*]Any weapons already in the current cell will either have to be dropped, or removed a re-added with the console\r\n[/list]\r\n\r\n[size=\\\"4\\\"][color=\\\"#FF0000\\\"]Known CTD Weapons[/color][/size]\r\nAdding scripts to these weapons will cause a CTD on startup\r\n[list][*]Base Steel Weapons(Not including enchanted and Skyforge\r\n[*]Banded Iron Shield\r\n[/list]\r\n\r\n[size=\\\"4\\\"][color=\\\"#FF0000\\\"]Incompatibilities[/color][/size]\r\nThis mod will be semi-incompatible with any mods that also edit the vanilla weapons, shields and stave\\'s base objects.\r\n\r\nIf you choose to use shields and staves, this mod replaces the skeleton mesh, and will replace any mod that also uses a new skeleton mesh.  I will make compatibility patches as time permits.\r\n\r\n\r\n\r\n[color=\\\"#FFFF00\\\"][size=\\\"4\\\"]Credits[/size][/color]\r\nDahaka002011 - Original and updated code\r\nMergweq - Updated code, esp/mesh creation\r\nCipscis - Bethesda Forums : Code helper\r\nEwokJedi - Esp Creation, and for simplifying the creation process like a boss\r\nDrasler - Giving a great idea that simplified the code and creation process\r\nReaper511 - Creating the Step-By-Step text guide\r\n\r\nAdditional Thanks to:\r\nJaysus and Mystichybrid Used both their mods in my tutorial videos\r\n[url=file.php?id=1002]Jaysus Swords[/url]\r\n[url=file.php?id=6383]Hybrids Craftable Vicious Dawnbreaker[/url]\r\nhl84 and dDefinder  - I created a compatible mesh for their mods. This is based of both mods permissions being free to use with credit.  If this has changed let me know and it will be removed.\r\n[url=file.php?id=7716]Well Placed Weapons and Quivers[/url]\r\n[url=file.php?id=601]Realistic Ragdolls and Force[/url]\r\nNifSkope http://niftools.sourceforge.net/wiki/NifSkope\r\nBSA Unpacker http://tes.nexusmods.com/downloads/file.php?id=3117\r\nBethesda for the Game and Creation Kit\r\nRobin and Co for the Nexus\r\n\r\n\r\n[size=\\\"4\\\"][color=\\\"#00FF00\\\"]Permissions[/color][/size]\r\nAnyone interested in using this pm Me (Mergweq) first.\r\n\r\n[color=\\\"#FFA500\\\"][size=\\\"4\\\"]Version History[/size][/color]\r\nArmed to the Teeth Template\r\nV.1.3 Reduced Swapping Time\r\nV.1.2 Codes redone from scratch\r\nV.1.15 Removed Support for NPCs\r\nV.1.1 Slight Update\r\nV.1.0 Original Template\r\nArmed to the Teeth Vanilla packs\r\nv.087beta Just another attempt at mass adding scripts to vanilla\r\nv.08beta Vanilla Weapons Pre-Done and Updated Code\r\nv.07beta Shields Added\r\nv.06beta Staves added\r\nv.05beta Functional Weapon Template\r\nv.04beta Scratch CTD Problems\r\nv.03alpha New Code Early Test\r\nv.02alpha Test Version\r\nv.01alpha Old Code\r\n\r\n\r\n[size=4][color=Cyan]The Complete Idiot\\'s Guide to Armed to the Teeth\r\nor: How to make AttT 100% stable, WITH shields, WITHOUT being an expert modder.[/color][/size]\r\n\r\n\r\n[color=orange]by Reaper511[/color]\r\n\r\nContents:\r\nIntro/How you actually USE the mod\r\nSimple 12 step program to victory (ok it\\'s 17)\r\nExtras/Advanced tips:\r\n- Glitchy behavior\r\n- Hiding items in your inventory\r\n- Shields/Staves\r\n\r\n--------\r\nSo, you want to use Armed to the Teeth (well, of COURSE you do) but the Weapon Pack crashes your game, or you can\\'t use shields, or etc. NO PROBLEM! Read this, grow a pair and try it with me and I promise within the hour you will have a 100% working AttT and your Dovahkiin will feel like a true badass.\r\n\r\nFirst of all, I am not a modder. This stuff all sounds intimidating to do but once you add a SINGLE item you will see how stupid-easy it is (thanks to the great template mod mergweq and co. created!). Trust me, take the plunge! I got sick of seeing how dumb my character looked with his disappearing spellbreaker and war axe hiding inside his armor (and where does he hide his bow?) so I took the plunge and decided to see if I could make Armed to the Teeth work. To my surprise, I found out it\\'s literally as easy as poking around in an excel spreadsheet. \r\n\r\nSecondly, I will make this SUPER concise as much as I can. If any part of it isn\\'t making sense, mergweq has kindly created perfect tutorial videos that will SHOW you what I mean. I followed these steps and in 30 minutes or less I was able to mod 2-3 daggers, all artifact weapons, half of the 1H swords and waraxes, half of the bows, all shields above Dwemer. basically every weapon I currently use or plan to use with my current character. Easy, fast, and 100% stable and I can now just play and enjoy the game. Done!\r\n\r\nHOW ARMED TO THE TEETH WORKS: \r\nThe mod is actually REALLY simple: You install the main template .esm file. Now, you just need a .esp file that \\\"flags\\\" the weapons you want to use and makes a dummy copy of them. Once flagged, they work automatically in-game (i.e. you see them on your character while unequipped) and without any fuss on your part (see the end for some gameplay tips). \r\n\r\nZeridian and misiek023 already created stable, SOLID files for all the weapon mods under the sun, so check http://skyrim.nexusm...le.php?id=15373 for those. I can confirm the Jaysus swords file there is 100% stable alongside my own custom file for the vanilla weapons/shields I use.\r\n\r\nFor VANILLA weapons, you just need to take 10 minutes with these EASY steps. You can TRY the all-encompassing Vanilla Weapons file here on the Nexus, but it adds too many scripts for the game to handle and tends to cause instability. Instead, make a file for the weapons YOU plan to use and enjoy crash-free badass gameplay.\r\n\r\n**SUPER Important Caveat: Mergweq has found that basic iron and steel weapons (and the banded iron shield I believe) have a tendency to just NEVER work. I didn\\'t even TRY modding them. Attempt at your own risk if you want to add specific weapons of those lower tiers. Anything else should do fine as long as you follow the steps!** \r\n\r\nReaper\\'s 12(17) Step Program for AttT\r\n1. Install the Creation Kit (don\\'t be scared, using this will be as easy as sending an email). \r\n2. In your MAIN SKYRIM FOLDER (where TESV.exe is), open \\\"SkyrimEditorPrefs.ini\\\" using wordpad/notepad/etc.\r\n3. copy and paste this(no quotes) \\\" bAllowMultipleMasterLoads=1 \\\" right underneath the top line where it says [General]. Save and close!\r\n4. Launch the Creation Kit (CK). Click the \\\"open\\\" icon on the left of the top toolbar, or go to File->Data. This pop-up will show skyrim.esm and all your mods.\r\n5. Check the boxes next to Skyrim.esm and ArmedttTeeth.esm. Click ok. The CK will mention that you have no \\\"active file\\\", proceed anyway because we are making a NEW file and so this is what we want! Click YES for any warning messages you get. It will take a couple minutes to load all the data.\r\n\r\n6. Now the fun part: ALL we will be doing is a 2-click process to make a copy of any weapon we want to use, and then a few clicks to attach a file to it. Do this for each weapon you care to use... and you\\'re done! It\\'s easy:\r\n7. Before you sits a big window with a list of categories on the left. Select Weapons! Above the categories is a FILTER box. USE it! Say you want to use a Daedric Sword. Type Daedricsword (no spaces) into the search box.\r\n8. IMPORTANT: You can hunt in the huge list for a weapon, but this is slow and you may see stuff you didn\\'t want to see (Spoilers!) To search quickly, You have to use the editorID (not the in-game name) in the filter box, so instead of how it appears in-game, you will be typing OrcishBow, GlassDagger, ElvenShield, etc. For STAVES, type Staff<effect> like StaffFrenzy, or StaffFireball.\r\n9 ALSO important. Regarding ENCHANTED weapons If you want to use this mod with a pre-enchanted weapon you found, it will only work with that specific weapon (or other copies of it). I.e. if you mod an \\\"Orcish Sword of Dread\\\", other Orcish swords will not work. Your BEST BET: Mod the base, unenchanted version of an Orcish Sword. You are free to temper and enchant any Orcish swords you find and they will all work. However, the pre-made enchanted weapons you find (like that sword of dread) will NOT work with the mod because they are different items in the list here.\r\n\r\n**Note: I\\'ll do an example weapon here. For shields, look further down the list. Staves are a lot like Shields from what I hear so see the same section and check the tutorial video on staves after you\\'ve had a crack at a basic weapon. I haven\\'t personally done a staff yet so I\\'m not going to be arrogant and write a guide for it!**\r\n\r\n**Last note: for ARTIFACTS/UNIQUE WEAPONS like Volendrung or Mehrunes\\' Razor, the process is the same as you see below. It\\'s really only generic enchanted weapons that create complications.**\r\n\r\n10. So, pick an item. Say, DaedricSword. Right click the basic unenchanted DaedricSword and hit DUPLICATE. You now see \\\"DaedricSwordCOPY0000\\\" added to the list! Highlight the new weapon, then click again on the name to RENAME it (trust me). Use whatever you want, but make sure it STARTS with \\\"aa\\\", like aaDaedricSwordCOPY0000, or just aaDaedricSword. This will make it easy to find in a minute. Keep it simple, and remember nobody will ever see this in-game.\r\n11. When you hit enter it will say \\\"You changed the name, make a new object?\\\" SAY NO! It will now ask \\\"Are you sure, bro?\\\" YES WE\\'RE SURE.\r\n\r\n12. Open your duplicate weapon to edit(double-click or right-click->Edit). We have 5 stops to make in this screen (couple more for enchanted items): \r\n-Name(upperleft). This will show up in your inventory in-game. Try \\\"Daedric Sword - Scabbard\\\" or something if you want a lore-friendly display in your inventory. \r\n-Enchanting/Enchantment(right below): Clear this out, should be NONE and 0.\r\n-Value(below enchantment): set to 0\r\n- WEIGHT(further down, left side): Set to 0 or you will be a sad panda.\r\n- EQUIP TYPE(top right drop-down by Description): Select aa<whateverweaponitis>. aaSWORDBKUP in our example. This determines where you SEE the weapon on your dude. Intentionally picking the wrong thing to try and show a sword where you should have a mace may look retarded. There is a better way to set that up, but I will not cover it here. See the tutorial vids for that.\r\n-SCRIPTS(bottom-right): The last part. Click ADD. A searchbox appears. In the Filter, type \\\"att\\\" and the scripts will appear! For ANY of the duplicate weapons/shields you make, you will use ATTBackup. It\\'s the \\\"backup\\\" of the real weapon, so use the backup script. Simple!\r\n\r\n13. Now you see ATTBackup listed as a script there. Click it, and click Properties. The pop-up window will have a box on the left of the properties you can change, in this case, just one (yay easy!). Click the W2/Weapon line, and then click Edit Value Anytime you see W2 in a script, you will be selecting the \\\"backup\\\" or dummy item you created. So in the dropdown, select your aaDaedricSword. Hint: You can start typing in this dropdown to find the item you want, in case you named your item something absurd and it\\'s in the middle of this huge list.\r\n\r\nFind your duplicate weapon in the list and hit ok. \r\n\r\n14. Now hit OK on the main weapon page to close it. You\\'re done with the hard part. Now, open the original version of the weapon (DaedricSword in our example). ALL YOU TOUCH in here is the scripts area in the bottom right.\r\n- Add Script: This time, ATTCustomWeap. Ignore ATTBase, you will never use it.\r\n- Properties: Now you will see THREE properties, and here I give the golden rules for every time you make a weapon for your mod:\r\n\\\"Swapping\\\": Anytime you see Swapping in ANY script. you select aaBKUPCLEAR (no exceptions!)\r\n\\\"W1\\\": W1 is ALWAYS (anywhere you see it) the \\\"real version\\\" of the weapon you are messing with. Doing a Daedric Sword? Find \\\"DaedricSword\\\" in the menu.\r\n\\\"W2\\\": W2 is ALWAYS the Fake/backup/dummy weapon you created. So, aaDaedricSword or whatever you named your duplicate.\r\n\r\nClick ok to close Properties, then click Ok to close the weapon. Success!! Before you rinse and repeat to add more weapons, do the next steps:\r\n\r\n15. SAVE YOUR MOD (I know we\\'ve only done one sword). The CK is a scary thing. You can royally mess something up if you double click on the wrong spot or something... so anytime you have successfully added a weapon to your file, SAVE. That way if you mess something up you don\\'t lose more than 5 minutes of work. (it WILL take you less than 5 minutes to add new weapons after you do your first couple).\r\n- To Save, click the save button in the top left, and name your file. I created a file for each of my characters, so \\\"AttT - charactername.esp\\\" is what mine look like. \r\n-IN THE FUTURE if you want to re-open your mod and make alterations to it, then in the File->Data menu, you will simply check the box by YOUR mod, and click \\\"Set as Active File\\\", so the CK knows that the alterations you make are changes to that mod, rather than a new mod on top of the previous mod (which is going to cause you problems).\r\n\r\n16. To use in-game: Before you activate AttT at all, create a safe backup save like so: load up your dude, remove ANY weaponry or shields from his inventory (dump them into a chest or something), and move him into a building/area without any weapons lying around in it. Leave your follower at home too, to be safe! I dumped my weapons in breezehome, and stepped outside into Whiterun, and had NO PROBLEM. HOWEVER, Whiterun does contain a couple iron and/or steel weapons. If you are modding those, better find another place to go to. \r\n\r\nKeep this safe save forever in case you have a problem and need to uninstall.. I suggest testing the mod out with a lot of weapon swapping and running around hitting walls and stuff to make sure it\\'s working before you start regular gameplay again.\r\n\r\n17. Load the mods into Data files (I suggest using the Nexus Mod Manager or Wrye Bash to order your files. I never touch the normal launcher. ArmedtotheTeeth.esm should load BEFORE JaysusSwords.esm, to be safe (or other .esm based weapon mods). For the ESP file you made, load it anywhere you like. If you are running .esps for any custom weapon mods from Zeridian and co, load those wherever too.\r\n\r\n18. Play! To see the mod in action, equip an item you added. Now unequip that item (or equip a new weapon), and the script you set up will spawn one of your \\\"backup\\\" weapon copies and equip it to your character. You will see it equipped in your inventory and sheathed on your character, but it is weightless and doesn\\'t actually do anything. If you click on the dummy item (to unequip it), it will despawn altogether. Warning: Don\\'t \\\"Drop\\\" the dummy item, because then it doesnt go away and you don\\'t want to pollute your world with a hundred weightless fake swords. If you do that, just pick it up, and equip/unequip it to make it despawn.\r\n\r\n**There is the occasional glitchy behavior with the items, typically caused by dual-wielding or shields on your back. They are largely avoidable and it\\'s easy to tell what sequence of events causes them. If you run into an aggravating behavior in the mod, post in the comments here and I or another intrepid user will no doubt have a solution to avoid that problem without compromising the fun. Now go kill something!**\r\n\r\n\r\nExtra Stuff!/Advanced Notes\r\nMY WEAPON DOESN\\'T DO ANY DAMAGE! If this happens, you\\'ve got a fun bug where-in the weapon is displaying in your hand, but the game is treating it like it\\'s a different item. Example: I am holding a sword but when I swing it into a wall I hear an ARROW sound effect, and it does crappy damage to people (I have low archery skill) and gives me archery experience. (Yes I\\'ve had this happen). Just unequip and re-equip the same weapon and it will work again. Cause seems related to either using shields on the back, or the game thinks the weightless items in your weapon section must all be arrows, I dunno.\r\n\r\nMOST glitchy behavior can be solved the same way. If your weapon is hotkeyed, just tap the hotkey twice to remove/re-equip it. \r\n\r\nHiding the Dummy Items you made: You CAN prevent the dummy items from showing in your inventory if it bugs you but this carries a risk: If you can\\'t see the dummy item, there\\'s no way to forcibly unequip it if you are having a problem, or when you are ready to remove that weapon from your loadout altogether and therefore shouldn\\'t be seeing it on your character anymore. I suggest leaving them visible, but if you are confident you will not need that, you can check \\\"Hide Backpack\\\" in the dummy item\\'s screen. Located upper right-ish. Again: not recommended!\r\n\r\nSHIELDS: \r\nShields are only slightly different than weapons. Specifically: your \\\"dummy\\\" shield has to be typed as a weapon. So you can\\'t just use \\\"Duplicate\\\". Instead, follow these steps:\r\n1. In the Weapons category on the main databse, right-click and hit New. For the ID for your new \\'weapon\\' put something like aaSpellbreaker (if you are adding spellbreaker to the mod, obviously).\r\n2. Edit the following things:\r\n-Name: Try \\\"Spellbreaker - On back\\\" or something, whatever you want to see in the inventory. (Note this will appear in the weapons portion of your inventory in-game, and will not have a graphic in the inventory screen)\r\n-Equip Type: aaSHIELDBKUP\r\n-Can\\'t edit scripts yet until we finish making the item, so ignore for now\r\n3. Now click to a NEW PLACE: The Art and Sound tab (above the weight). \r\n- At the top is \\\"Model\\\". Click the edit button next to it. Click edit again in the popup. In Select File screen, you should already start in the \\\"Meshes\\\" folder. Select ArmedttTeeth->Shields->whatever shield you are adding. Hit ok, and hit ok in the model box to close it. \r\n- Now we\\'re back in the item screen, with one more IMPORTANT thing to do: in the Animation section (right in the middle) is a drop-down called \\\"Anim Type\\\". Whatever you select here will block certain items from showing at the same time as the shield. If you select \\\"OneHandAxe\\\" then the shield displaying on your back will block display of any axes on your hip while it is out. For STAVES and SHIELDS at the same time, you will have to have the Staff occupy an animation slot you don\\'t need (example: I don\\'t use maces so I could select that animationtype)\r\n- Mergweq suggests you use \\\"HandtoHandMelee\\\" since your other weapons obviously don\\'t fall into this animation slot. Has worked great so far for me. I display a sword, dagger, waraxe, shield, bow and arrows all at once.\r\n- Once you select HandtoHandMelee in the dropdown, hit ok at the bottom to close the item.\r\n4. Now re-open the item you JUST made and we can attach the script:\r\n-Add Script: ATTBACKUP (this is the dummy item, so always backup)\r\n-Properties: Just the W2 here, so like always you select the dummy item you are working on for the category, and hit ok. You\\'re all done with the backup!\r\n5. Now find the real version of the shield (remember, the real shield is under armor, so switch categories on the left of the main database window before you go typing in the filter or you won\\'t find squat!). Open the shield and ADD SCRIPT!\r\n-Add Script: ATTBaseShield\r\n-Properties: Just W2 yet again (different from weapons I know). Since it\\'s W2, you select the dummy shield from the list again (as in aaSpellbreaker or whatever you are doing).\r\n6. DONE! Save your work!\r\n\r\n\r\n- More to come if I think of other stuff.\r\n\r\nThanks for reading!",
  "categoryId": "82",
  "version": "V.1.35",
  "author": "Mergweq EwokJedi and Dahaka002011",
  "createdUnix": "1329244843",
  "updatedUnix": "1338587362",
  "containsAdultContent": false,
  "uploadedBy": "Dahaka002011",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42510",
      "name": "ArmedttTeeth V08Beta Complete Pack",
      "version": "V.08b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1319",
      "fileName": "ArmedttTeeth V08Beta Complete Pack-9614.rar",
      "uploadedUnix": "1331513433",
      "modVersion": "V.08b",
      "virusScanUrl": "https://www.virustotal.com/file/76f879d85f9d0e7eb256508bfe9d08c478b35071f75d117695d47e4b73673e7f/analysis/1406744471/",
      "changelogHtml": " Simplified Scripts and Updated ESM <br/> \n Vanilla Weapons, Shields and Staves included pre-done in 3 Packs <br/> \n Updated Template ESM Version <br/> \n Updated Literature <br/> \n End of Template ESP Version <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmedttTeeth%20V08Beta%20Complete%20Pack-9614.rar?fid=42510&ttl=1535769322&ri=8192&rs=8192&setec=c7dcfd68a8d7d47e95b40f0eebc8c36b"
    },
    {
      "fileId": "42882",
      "name": "Well Placed Quivers Patch",
      "version": "v1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "41",
      "fileName": "Well Placed Quivers Patch-9614.rar",
      "uploadedUnix": "1331631545",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ae9e5e73bfa8dc09b9c16ccb2a3967c1c781fe5aff366e8336db7ba8339f4da5/analysis/1406746424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Well%20Placed%20Quivers%20Patch-9614.rar?fid=42882&ttl=1535769322&ri=8192&rs=8192&setec=76b5e1f8b424476daa549c80ffa5a0a5"
    },
    {
      "fileId": "42883",
      "name": "Better Staff-Shield On Back Placement",
      "version": "v1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "40",
      "fileName": "Better Staff-Shield On Back Placement-9614.rar",
      "uploadedUnix": "1331631667",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/48a2c32d1f2bd57ab193128b0df7c93047e7bd918d6465580365c2d973944eda/analysis/1406746563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Staff-Shield%20On%20Back%20Placement-9614.rar?fid=42883&ttl=1535769323&ri=8192&rs=8192&setec=316a6b0fba3d603ac2b8fc6f0b2fb5a3"
    },
    {
      "fileId": "43401",
      "name": "ArmedtotheTeeth Template v1-0",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1250",
      "fileName": "ArmedtotheTeeth Template v1-0-9614.rar",
      "uploadedUnix": "1331764237",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9a7ec99a4ed307d33686159a67db2aaf7c1d6948bb45a229b4110fc313baec7d/analysis/1406749331/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmedtotheTeeth%20Template%20v1-0-9614.rar?fid=43401&ttl=1535769323&ri=8192&rs=8192&setec=4b21fc184002d7fe1141fc9f699cc18b"
    },
    {
      "fileId": "53076",
      "name": "ArmedtotheTeeth Template v1-2 -Required-",
      "version": "V.1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1251",
      "fileName": "ArmedtotheTeeth Template v1-2 -Required--9614.rar",
      "uploadedUnix": "1334388419",
      "modVersion": "V.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/cb73425daff5cdc5dc3d0ad5d615166b1bacced638489c668f660db70e5b5de0/analysis/1406814792/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmedtotheTeeth%20Template%20v1-2%20-Required--9614.rar?fid=53076&ttl=1535769324&ri=8192&rs=8192&setec=433b90fc81bb0053044f22a4764dec5b"
    },
    {
      "fileId": "54297",
      "name": "ATTT Vanilla Pack Beta86",
      "version": "v0.86",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "31",
      "fileName": "ATTT Vanilla Pack Beta86-9614.rar",
      "uploadedUnix": "1334769431",
      "modVersion": "v0.86",
      "virusScanUrl": "https://www.virustotal.com/file/f94a6df81eeb81d42c201f79b393fd0e08652218a3e91c6defa0a81b37903151/analysis/1406821989/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ATTT%20Vanilla%20Pack%20Beta86-9614.rar?fid=54297&ttl=1535769324&ri=8192&rs=8192&setec=060659100bbd55c127a668e7e853d48b"
    },
    {
      "fileId": "61607",
      "name": "ArmedtotheTeeth Template v1-35 -Required-",
      "version": "v.1.35",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1251",
      "fileName": "ArmedtotheTeeth Template v1-35 -Required--9614-v-1-35.rar",
      "uploadedUnix": "1337138588",
      "modVersion": "v.1.35",
      "virusScanUrl": "https://www.virustotal.com/file/0e5ed804ae27a91daa6e83c0fed42100e347fbafeb08d0518c8c807b3cd6042e/analysis/1406895665/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmedtotheTeeth%20Template%20v1-35%20-Required--9614-v-1-35.rar?fid=61607&ttl=1535769325&ri=8192&rs=8192&setec=519533f1ec8ff303c6725fa56dd461dc"
    },
    {
      "fileId": "63905",
      "name": "The Complete Idiots Guide to ATTT by Reaper511",
      "version": "v.1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "The Complete Idiots Guide to ATTT by Reaper511-9614.rar",
      "uploadedUnix": "1338090357",
      "modVersion": "v.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/aa742a4bd70a3c80a5854559d214c6009b0a86c0d3bfea32e5c94a0b659bb18d/analysis/1406917810/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Complete%20Idiots%20Guide%20to%20ATTT%20by%20Reaper511-9614.rar?fid=63905&ttl=1535769325&ri=8192&rs=8192&setec=09aabd6ee38d11229e1a373b372f935a"
    },
    {
      "fileId": "65173",
      "name": "ArmedttTeeth  Vanilla Weapon Pack V1-00",
      "version": "v1.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "58",
      "fileName": "ArmedttTeeth  Vanilla Weapon Pack V1-00-9614.rar",
      "uploadedUnix": "1338585687",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ccf9f31db41fad18a550d779d8718af361a84d892916a772cfc567ddc44ac2c0/analysis/1406930582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmedttTeeth%20%20Vanilla%20Weapon%20Pack%20V1-00-9614.rar?fid=65173&ttl=1535769326&ri=8192&rs=8192&setec=6d618f011b1e80619cb93b86e7c89b2e"
    },
    {
      "fileId": "65175",
      "name": "ArmedttTeeth V087Beta Shield Pack",
      "version": "v0.87b",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "6",
      "fileName": "ArmedttTeeth V087Beta Shield Pack-9614-v0-87b.rar",
      "uploadedUnix": "1338585884",
      "modVersion": "v0.87b",
      "virusScanUrl": "https://www.virustotal.com/file/0cc81ba9e516a3845084c8330a9108daaf6fe0ab4697ed4c0bfaa8ad1d285026/analysis/1406930583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmedttTeeth%20V087Beta%20Shield%20Pack-9614-v0-87b.rar?fid=65175&ttl=1535769326&ri=8192&rs=8192&setec=c10cfdb6fd9d74a4ce6162dbaccaa45a"
    },
    {
      "fileId": "65181",
      "name": "ArmedttTeeth V083Beta Staff Pack",
      "version": "v0.83b",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "4",
      "fileName": "ArmedttTeeth V083Beta Staff Pack-9614.rar",
      "uploadedUnix": "1338587362",
      "modVersion": "v0.83b",
      "virusScanUrl": "https://www.virustotal.com/file/e139ea5336183aed05b3736d58f1eb2de56a5396afedf8f63105e65ba222c08f/analysis/1406934422/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ArmedttTeeth%20V083Beta%20Staff%20Pack-9614.rar?fid=65181&ttl=1535769327&ri=8192&rs=8192&setec=4b60c58e28c82c12c1d0a9fa6dcf9285"
    }
  ]
}