{
  "modId": 9647.0,
  "modName": "New House Decorations",
  "summary": "28 new buyable items for you to arrange in your house in-game. Redecorate without using the Creation Kit. These items were converted from static Skyrim scenery to purchasable, placeable items.",
  "descriptionHtml": "28 new buyable items for you to arrange in your house. Redecorate without using the Creation Kit. These items were converted from static Skyrim scenery to purchasable, placeable items. \r\n\r\nCurrently, they can be found in Whiterun at \\\"Belethor\\'s General Goods\\\", and in Solitude at \\\"Bits and Pieces.\\\" \r\n\r\nHere is what is included: (vendors have multiples of each)\r\n-11 lighted candles of various styles: silver, ancient ruins, horned, Imperial, and glazed pottery*\r\n-2 ancient ruin style shelves\r\n-1 Noble shelf unit\r\n-1 Noble large table**\r\n-1 Nobe crate - great for storage of ingredients and food\r\n-1 Wood nightstand surface\r\n-2 Dwemer decorative barrels\r\n-1 Dragon skull\r\n-1 Mead keg\r\n-1 Shrine base & 1 Shrine of Zenithar\r\n-3 Ancient ruin pottery\r\n-1 Puzzle pillar \r\n-2 Soul Gem Holders\r\n\r\n*Candles have the fully animated flame & glow effect but do not actually cast light or shadows in the room.\r\n**The Noble large table is heavy and cannot be manipulated once placed.  Drop it exactly where you want it.\r\n\r\nAll shelves and surfaces are usable! Items are oriented and weighted properly so they are all easy to manipulate and place. The sheves are very heavy, so placing small items on them feels solid. \r\n\r\nJust to be clear, these do not replace any existing items. They are NEW items that must be bought from the vendors listed above. Prices are cheap!\r\n\r\nHow to decorate your house without physics issues (this goes for ANY Skyrim object):\r\n01) Enter your house, drop all the items onto the floor (do so in batches of less than 10 for safest results).\r\n02) Save the game (still INSIDE your house).\r\n03) Load the game you just saved.\r\n04) BEFORE touching ANY object, exit your house then re-enter (very important).\r\n05) Now you can grab onto your objects and move them around how you want.\r\n06) If you accidentally pick an object up into your inventory, you\\'ll need to repeat the steps above before placing it where you want it.\r\nAnd there you have it. You can freely exit your house now, and everything will be just how you left it when you come back. \r\n\r\nWe all know that the physics in Skyrim can be unpredictable, so please leave feedback for items acting strangely, Also feel free to suggest other static Skyrim objects you would like to see converted for home decoration. I intend to make many more and also 3D model my own.",
  "categoryId": "85",
  "version": "v1.0",
  "author": "toddkay",
  "createdUnix": "1329253401",
  "updatedUnix": "1329253514",
  "containsAdultContent": false,
  "uploadedBy": "toddkay",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31157",
      "name": "New House Decoration Clutter",
      "version": "v01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1352",
      "fileName": "New House Decoration Clutter-9647-v01.zip",
      "uploadedUnix": "1329253514",
      "modVersion": "v01",
      "virusScanUrl": "https://www.virustotal.com/file/fe3ea09655d9ce6c398a0e4429ea0ac948b3f1b318e9cd234c64de11a648b885/analysis/1406682485/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20House%20Decoration%20Clutter-9647-v01.zip?fid=31157&ttl=1535769393&ri=8192&rs=8192&setec=44f3f2b3a10349d0e523002b513cf99d"
    }
  ]
}