{
  "modId": 9668.0,
  "modName": "Caesars Legion - Imperial Empires Most Ruthless",
  "summary": "NV inspired Imperial Legion veriation - non replacer",
  "descriptionHtml": "[URL=http://imageshack.us/photo/my-images/827/72525064.jpg/][IMG]http://img827.imageshack.us/img827/4707/72525064.jpg[/IMG][/URL]\r\n\r\n*Note - for retextures, I used google search and images for the icons used and NOT ripped them from NV. I got the Imperial Legion Akatosh banner Icon from the Morrowind version of the banner to bring back a bit of Classic flavor mish-mashed with NV style,,,,\r\n\r\n====Introduction====\r\n\r\nThis adds my attept to recreate a Elder schrolls version of Fallout New Vegas\\'s Caesar\\'s Legion in Skyrim as I used to like being a Centurion in NV, with a raiding and of Legionaiires.\r\n\r\nI thought I have a go at adding these guys in Skyrim but a little more lore friendly.\r\n\r\nFor instance:\r\n\r\nCaesar: A Legion General and \\\"shadow\\\" second in command of General Tulius\r\n( He wishes to let Legate Rikka run the forces) he has his own loyal force of a thousand soldiers which range from ex-bandits, ex-convicts and sell-swords, all who do the jobs no other Legionary would normally do. Caesar heads a ruthless but effective Army. The Empire is desperate and desperate times call for desperate measures, hence Caesar and his ruthless legion.\r\n\r\nLegate Lanius: Much like his Mojave counterpart, he is a ruthless, mercerless fighter of two handed weapons but is also a excellent tactician and stategist. Although he is a Nord by birth, he was scarred in childhood on his face by Stormcloak raiders on his now gone village, from that day, he rid himself of his Nord heritage and was taken in by a Imperial family and took the name Lanius, he rose though the ranks of the Legion and also was infamous in the great war, using both his natural Nord brutaliy, despisation of the Thalmor for what they reprisent and also his Imperial upbringing. He slew many, many elven soldiers and mages, more so than anyone else that his actions where savage, too savage for the Legion to document but he was still rewarded for his services. He is Caesar\\'s most trusted bodyguard and the feeling is mutual.\r\n\r\n(I might add a Joshua Graham guy someplace, hiding in a cave someplace... dunno yet)\r\n\r\nCenturions: These guys are the lieutenants of the Legate and Caesar and well you know what these guys typically do.\r\n\r\nHeavy, medium and Light soldiers: These guys will be typically bandits, convicts and mercs with retextured legion Armor and also have slightly raised HP, stats and added to the Legion factions to prevent any infighting. They will be difficult fighters, ranging from Nords, Redguards, Imperials and Bretons. Caesar is a bit of a racist in regards to elven and beast kind.\r\n\r\nAlso since the nature of NV Caesar\\'s Legion where Slavers, this legion will also have hidden caves and outposts that deal in Slavery e.g. have dealings with Orc Slavers on the Highrock/Skyrim Border as I am sure that native Orcs in Highrock  and thier strongholds would have use of Slaves to work in thier mines, be sex slaves etc as Orcs I thinka dn waht I have seen of thier culture would atleast have some sort of captives to do all sorts of work. Please tell me if this otherwise.\r\n\r\nV1 - Just adds 2 retextured, non replacer Legion armors (light and medium) to Solitude City Castle Dower or what ever its called being worn by two Imperial Soldiers.\r\nYou will see them and also a retexured, non replacer Banner of Caesar\\'s Legion to be used in Caesar\\'s Legion Camps and places in control by them.\r\n\r\n",
  "categoryId": "25",
  "version": "1",
  "author": "nofear88",
  "createdUnix": "1329259069",
  "updatedUnix": "1329259588",
  "containsAdultContent": false,
  "uploadedBy": "nofear88",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31214",
      "name": "Caesars Legion - Skyrim Edition",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7089",
      "fileName": "Caesars Legion - Skyrim Edition-9668-1.rar",
      "uploadedUnix": "1329259588",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/028a36d6dda35943510135f7243f5d91027c7789964972bc98a9a6de172a7a38/analysis/1406682619/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Caesars%20Legion%20-%20Skyrim%20Edition-9668-1.rar?fid=31214&ttl=1535769422&ri=8192&rs=8192&setec=5778622e17d57138922b9aae45f7720c"
    }
  ]
}