{
  "modId": 9673.0,
  "modName": "Templar Shields 1_02",
  "summary": "16 custom shields with a cross in the middle, based on a new mesh",
  "descriptionHtml": "WHAT IT DOES\r\n\r\nIt adds 4 crusader shields, you know, with a big cross in the middle, each in two versions: with or without boss. This was originally supposed to be just the templar shield, but it kinda grew to include the following shields:\r\n\r\n1. The red on white cross is the Knights Templar pattern, as well as the most used symbols in the first crusades by everyone. \r\n\r\n2. A white on red shield is sometimes used as a different templar shield, but that\\'s incorrect. It was actually the flag of England in the crusades until 1188, by decree of the Pope himself, then briefly of France at the end of the 12\\'th century, and then it is adopted by Denmark in the 13\\'th century and it is they flag to this day. In the mid 13\\'th century, another pope decreed that the Knights Hospitaller should wear a surcoat of solid red with a white cross on it, and it remains the flag of the Malta Knights to this day. So you could use it as an alternate Hospitaller shield, or a follower of Richard The Lionhearted, or a couple of other possibilities for this shield.\r\n\r\n3. White on black is the shield of the Knights Hospitaller, and \r\n\r\n4. Black on white is the sheild of the feared (and hated in the north-east) Knights Teutonic.\r\n\r\nFurthermore, each of them exists in steel and dwarven variants, though since the face is painted and the back is wood, the only places where you\\'ll see different metal is the boss and border. For the history minded, the dwarven metal on the shields looks close enough to brass or bronze or possibly gold, all of which are historical enough for Earth. It won\\'t turn it into some fantasy shield. And for the Tamriel-lore minded, they at least look like something that could be done out of dwarven metal in a Skyrim forge: if you knew how to hammer the face plate, boss, back plate, and border out of steel, and also knew how to work dwarven metal, you could realistically hammer the same parts out of dwarven metal and paint the same pattern on the face. I mean, nobody\\'s holding a crossbow at your head to make you produce ONLY copies of Dwarven shields.\r\n\r\nThey can be crafted and enhanced, as follows \r\n\r\n- The steel shields are filed under steel, and need steel to build, as well as leather strips and firewood. They protect better than ordinary steel shields, actually on par with dwarven, BUT this comes at the expense of being even heavier than Orcish and needing much more material to build. \r\n\r\n- Similarly, the dwarven shields are filed under dwarven and need dwarven metal, leather strips and firewood. Just like the steel ones, their protection is actually one step up, on par with orcish, but at the expense of weighing actually more than dragon plate or daedric and needing much more dwarven metal to forge.\r\n\r\nI figure it\\'s pretty realistic to increase an armour\\'s defense by making it much thicker and heavier, and in this case the rise in weight is far higher than the rise in protection. And the cost in extra materials is even more disproportionately higher than the increase in protection. And, hey, it still doesn\\'t compete with dragon plate or daedric shields.\r\n\r\nThe general balance point I\\'m aiming for is basically that they don\\'t put you too far ahead of the curve when you can get them, and it comes at a cost, and they\\'ll be at a disadvantage in the end game, but not completely obsolete, if you still want to keep them for the looks.\r\n\r\nNote: I do not endorse the crusades or the massacres that happened there (see, Acre, Jerusalem, etc), nor their role in the final decline of Byzantium. However the templars have been a bit romanticized in games and movies where they fight against some injustice or unravel some conspiracy or such. It is this fictive game idea of a templar that I\\'m going after with this mod. You know, same as people playing dwarves in WoW don\\'t really wish they were 4ft tall humans, but a fantasy character.\r\n\r\n\r\nHOW TO GET IT\r\n\r\nCraft them. Or, if I read those lists right, they should appear at vendors sooner or later, but they\\'re much more expensive than plain steel and respectively dwarven shields.\r\n\r\n\r\nHOW TO INSTALL IT\r\n\r\nExtract the archive, with directories, in your Data folder.\r\n\r\nIf you\\'re upgrading from version 1.0, you may wish to delete the old textures first (see the uninstall instructions below), since two of the normal maps are no longer used, and basically would just take 4MB of space on your hard drive and do nothing. Or you can leave them there i it doesn\\'t bother you. As I was saying, they do nothing any more.\r\n\r\nIf you\\'re upgrading from version 1.01, you don\\'t need to do anything special. Just unpack the new version over the old one.\r\n\r\n\r\nHOW TO UNINSTALL IT\r\n\r\nDelete the .esp file from your Data directory.\r\n\r\nDelete the MTemplar directory in both the Meshes\\\\Armor, Meshes\\\\Weapons, Textures\\\\Armor and Textures\\\\Weapons directories.\r\n\r\n\r\nCONFLICTS\r\n\r\nHopefully, it shouldn\\'t conflict with anything.\r\n\r\n\r\nVERSION HISTORY\r\n\r\n1.02:\r\n\tAdded the dwarven shields\r\n\tRedone normal mapping for the metal part\r\n\tMade the metal border a little wider on the sides and bottom, closer to the width on the top\r\n\r\n1.01:\r\n\tChanged the wood pattern on the back of the shield, as requested\r\n\tAdded the Knights Hospitaller shield, as requested, and while I was at it, the Teutonic Knights too\r\n\tTweaked the texture coordinates around the edges\r\n\tRenamed them to Crusader Shield in the list since clearly most of them are not templar shields now\r\n\r\n1.0:\r\n\tFirst Skyrim Release\r\n",
  "categoryId": "54",
  "version": "1.02",
  "author": "Moraelin",
  "createdUnix": "1329260470",
  "updatedUnix": "1329558962",
  "containsAdultContent": false,
  "uploadedBy": "Moraelin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31225",
      "name": "MTemplar_1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8896",
      "fileName": "MTemplar_1_0-9673.7z",
      "uploadedUnix": "1329260772",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/093105fdba37a1fb3bb6b003c743a8aa99c0da608acbd9de3137ab8d6993044a/analysis/1406682697/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MTemplar_1_0-9673.7z?fid=31225&ttl=1535769430&ri=8192&rs=8192&setec=a7e9bc8af67d5d34168cbba52a158c31"
    },
    {
      "fileId": "31997",
      "name": "MTemplar_1_01",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5819",
      "fileName": "MTemplar_1_01-9673.7z",
      "uploadedUnix": "1329387268",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/8d2f4e7720c3d79b30ec2a83319ccc18d0d5bde7f23198c580e75417667144c9/analysis/1406686876/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MTemplar_1_01-9673.7z?fid=31997&ttl=1535769430&ri=8192&rs=8192&setec=3ec942461c851fef5406110c0f208f3d"
    },
    {
      "fileId": "33041",
      "name": "MTemplar_1_02",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9432",
      "fileName": "MTemplar_1_02-9673-1-02.7z",
      "uploadedUnix": "1329558962",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/f21d6f40984c970680fc1f0e5b20a69b36ea519a5bdb30edd978f06996869497/analysis/1406692487/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MTemplar_1_02-9673-1-02.7z?fid=33041&ttl=1535769431&ri=8192&rs=8192&setec=de9d8393cbe17db9cbf993489aca33af"
    }
  ]
}