{
  "modId": 9676.0,
  "modName": "Seabreeze Estate",
  "summary": "his lovely estate if located on your own private island off the Northern coast of Skyrim. Enjoy sensational views of Solitude, the Lighthouse, and ships coming into port from your patio overlooking the Sea of Ghosts. This home includes many features useful for most types of players.",
  "descriptionHtml": "This lovely estate if located on your own private island off the Northern coast of Skyrim. Enjoy sensational views of Solitude, the Lighthouse, and ships coming into port from your patio overlooking the Sea of Ghosts. This home includes many features useful for most types of players including:\r\n[list]\r\n[*] Alchemy Lab\r\n[*] Enchanting Table\r\n[*] Full Forge\r\n[*] Smelter & Tanning rack\r\n[*] Four Mannequins\r\n[*] Weapon & Shield Racks\r\n[*] Dagger & Weapon display cases\r\n[*] Library with large collection of books\r\n[*] Basement Armory\r\n[*] Kitchen and Cooking pot\r\n[*] Bookshelves\r\n[*] Chests & Storage\r\n[/list]\r\nThe house is unlocked and free, however, it must be discovered first before fast travelling to it! Enjoy your new Home!\r\n[line]\r\n[b]Installation[/b]\r\nUncompress and place the SeabreezeEstate.esp in your Skyrim data folder. To uninstall, simply delete it. Remember when uninstalling that you loose any items you\\'ve place in the house, so remove valuables before removing the .esp!\r\n\r\n[b]Update v1.4.2 (02/20)[/b]\r\n- Fixed Weapon rack in Living room [color=yellow](If your weapons are stuck in the wall, open up the in-game console (~) and typing \\\"tcl\\\" to toggle clipping, you will have to walk into the wall to remove your weapons. Type \\\"tcl\\\" again to toggle clipping back on. You may have to enter and exit the building for the weapon rack to become functional)[/color]\r\n- Removed rocks from around smelter and tanning rack\r\n- Added experimental fix for \\\"exploding\\\" bookshelves (Please let me know if you are still experiecing issues)\r\n- Removed pop-up text as it was causing problems with starting a new game. If you still see the pop-up simply delete the SeabreezeEstate.bsa (NOT .esp) from your Skyrim Data folder.\r\n\r\n[b]Update v1.4 (02/19)[/b]\r\n- Added a smelter and tanning rack outside\r\n- Added two dagger display cases and sword/axe display case to the basement armory\r\n- Added a barrel in the forge for blacksmith supplies\r\n- Added another chest in the small alcove to the right of the living room\r\n- Added a weapon rack in the living room\r\n- (1.4.1) Fixed Apothecary Satchel on Alchemy table set to respawn (sorry to anyone who may have lost ingredients) \r\n\r\n[b]Update v1.3.2 (02/17)[/b]\r\n- Fixed bug causing player to spawn in the air when fast travelling.\r\n\r\n[b]Update v1.3 (02/16)[/b]\r\n- Added a basement Armory with two extra mannequins, more chests, and extra weapon and shield racks\r\n- Added a library full of books and extra bookshelfs for your own collection\r\n- New Kitchen with cooking pot\r\n- Added a grindstone to the basement forge\r\n- Fixed collision issue near Enchanting table\r\n- Moved map marker slightly to prevent horses or follwers from getting stuck in rocks\r\n\r\n[b]Update v1.2: (02/15)[/b]\r\n- Fixed NavMeshes so followers will actually follow you into the house (and out)\r\n\r\n[b]Update v1.1 (02/14):[/b]\r\n- Fixed missing Landscape terrain issue\r\n- Toggled \\\"Full LOD\\\" off on buiding to fix disappearing in-game.\r\n\r\n[color=yellow][b]REGARDING SPOUSES:[/color]\r\nCurrently, implementing spousal support is proving more difficult that I had imagined. While this can be done, it would most certainly break other marriage mods. I am still researching the best way to go about this, but for the time being, you and your significant other will have to live apart! I will keep you guys posted![/b]\r\n\r\n[b][color=yellow]HELP! MY KITCHEN IS A MESS!:[/color]\r\nIf you are updating from v1.2 (new users can ignore this) Please be aware that update v1.3 changes the location of kitchen furniture, causing some table and shelf clutter to be out of place in the kitchen only. In order to \\\"clean up\\\" the clutter please do one of the following: Manually remove the clutter, which will not affect items or modifications you\\'ve made to your home. If you do not wish to clean up yourself, do the following: Remove any valuables from the home and make a save outside of the house (a pain, I know, my apologies). Disable the SeabreezeEstate.esp plugin and load the game save from the last step (remember this will delete any custom items in your home) save and quit once again, then enable the plugin and load your game to reset the house interior. Once you load your game you will have to \\\"move\\\" your things back in. [i]My sincere apologies for the inconvenience.[/i] Future versions will not alter furniture layout to avoid this.[/b]\r\n\r\n[b][color=yellow]KNOWN ISSUES & BUGS:\r\nAs some of you may or may not know, there are a number of bugs present with the Creation Kit that seem to be causing a few issues: NavMeshes (which tell NPCs where they can walk) is bugged and can occassionally cause your followers not to follow. As well, large statics (buildings, objects, ect) can sometimes not load correctly in-game. For the most part, these bugs are easy to deal with and hopefully will be fixed in a future CK update. If you encounter these issues, please enter and exit the building, fast travel to another location and back again or try saving and reloading.\r\n\r\nUsers running Skyrim HD 2K Textures may have missing landscapes at the back of the house, I am working on compatibility, but for now, be aware that there may be missing landscapes when using both mods.[/color][/b]\r\n\r\nPlease let me know if you encounter any issues or have ideas for improvements or new features. This is my first public mod, and appreciate the feedback.\r\n\r\nTRANSLATED VERSIONS:\r\nGerman:[url=http://skyrim.nexusmods.com/downloads/file.php?id=11029]Link[/url]",
  "categoryId": "67",
  "version": "1.4.2",
  "author": "MaxMatic",
  "createdUnix": "1329261292",
  "updatedUnix": "1329780575",
  "containsAdultContent": false,
  "uploadedBy": "mgilchuk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31453",
      "name": "Seabreeze Estate v1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "533",
      "fileName": "Seabreeze Estate v1_2-9676.rar",
      "uploadedUnix": "1329302039",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/bd783cee07402940bee73ff371267f2104106a5cf4e8f2f33efeb64e83d5d3b7/analysis/1406683929/",
      "changelogHtml": " Fixed NavMeshes so followers will actually follow you into (and out of) the house <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Seabreeze%20Estate%20v1_2-9676.rar?fid=31453&ttl=1535769434&ri=8192&rs=8192&setec=6c53deb1b1acf72d12bfa9dc79286795"
    },
    {
      "fileId": "32882",
      "name": "Seabreeze Estate v1_3_2",
      "version": "1.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "550",
      "fileName": "Seabreeze Estate v1_3_2-9676.rar",
      "uploadedUnix": "1329529340",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/5593243c6d1af78e35a3b2e5664b4f9cb149ab6d859985adfd69f79aaa260aa0/analysis/1406691502/",
      "changelogHtml": " Fixed a bug which causes the player to spawn in the air when fast-travelling on a horse <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Seabreeze%20Estate%20v1_3_2-9676.rar?fid=32882&ttl=1535769434&ri=8192&rs=8192&setec=efe8eb9a6f95ad9a60ded9a0a13d4311"
    },
    {
      "fileId": "34476",
      "name": "Seabreeze Estate - Latest Version",
      "version": "1.4.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "585",
      "fileName": "Seabreeze Estate - Latest Version-9676-1-4-2.rar",
      "uploadedUnix": "1329780575",
      "modVersion": "1.4.2",
      "virusScanUrl": "https://www.virustotal.com/file/7088d24802b70b6aa34aa4599fca0dfc4372c941d97c4fec78e7fe57a7fa6fce/analysis/1406699767/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Seabreeze%20Estate%20-%20Latest%20Version-9676-1-4-2.rar?fid=34476&ttl=1535769435&ri=8192&rs=8192&setec=c2b166d8a797ed434311ea1d02a4ff8e"
    }
  ]
}