{
  "modId": 9688.0,
  "modName": "Detect Skills spell",
  "summary": "Adds a spell that can detect the skills and stats of an NPC.",
  "descriptionHtml": "Did you ever wonder if you should give your follower one-handed or two-handed weapons? Or if light armor would be better than heavy? Or if Lydia is really that good at sneaking? Then this is for you.\r\n\r\nThis mod adds the spell Detect Skills to the game. It is an alteration spell that allows you to see the stats of NPCs, followers, animals, enemies, dragons and all other kind of niceguys and nasties. I made it so I could check the stats and skills of my followers to give them the gear they would be best skilled to use.\r\n\r\nAny vendor with all spell books should have this for sale when you add this mod. Buy it from Farengar in Whiterun or any of the other court wizards in Skyrim.\r\n\r\nThis is my first mod ever. I hope you enjoy it. Feel free to comment or endorse if you do.\r\n\r\nTROUBLESHOOTING\r\nIf you see the flashy animation, but no NPC stats, it is probably because you downloaded the first version of the mod that I uploaded. Something went wrong with that upload, so try uninstalling the mod, download and reinstall it, that should make it work.",
  "categoryId": "75",
  "version": "0.8",
  "author": "MrSarp",
  "createdUnix": "1329266020",
  "updatedUnix": "1329274038",
  "containsAdultContent": false,
  "uploadedBy": "MrSarp",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31308",
      "name": "Detect Skills - Get NPC info",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Detect Skills - Get NPC info-9688-1.zip",
      "uploadedUnix": "1329274038",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/049fa4c77aa28a85796f92eb6c7a327a446135cccbc5d7f8b3f809b84894b815/analysis/1406683212/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Detect%20Skills%20-%20Get%20NPC%20info-9688-1.zip?fid=31308&ttl=1535769448&ri=8192&rs=8192&setec=ff91b25944dc98f0e46d8697baab5150"
    }
  ]
}