{
  "modId": 9696.0,
  "modName": "BreezeHome_Enhanced_Lite_Upgradeable1_0",
  "summary": "Non cheating breezehome mod that, brightens some textures, adds storage, fixes Lydia spawning in bedroom and adds the ability to add an enchanting table by purchasing it from Proventus in Dragonreach and adds a few lights to brighten up your starter home and make it a little more useful. ",
  "descriptionHtml": "**************************  UPDATE **************************************************\r\nTHIS MOD IS NOW BEING UPDATED AT THE FOLLOWING LINK under my steam Username:\r\n\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=11158\r\n\r\n*************************** END UPDATE  **********************************************\r\n\r\n\r\nThis is a mod for people that want to improve Breezehome but don\\'t want to outright cheat.   The player still starts with nothing when they first buy the home but this mod improves the upgrades in the house and gives the user the ability to also purchase an enchanting table as a part of the in game decorating process.  This mod also fixes Lydia spawning in the player bedroom.  Instead she has her own chair to sit in within her room. \r\n\r\nPrices have been adjusted accordingly for the improved areas of the home to reflect the additional value.  Don\\'t worry it\\'s worth it. \r\n\r\nHere is a full rundown of the changes:\r\n\r\n-- Changed 1st floor wall textures to a light plaster color to brighten up the interior and make it a little more pleasant. \r\n-- Added a \\\"dump chest\\\" to the kitchen so you can unload your stuff while overencumbered as soon as you get in the door. \r\n-- Added 3 plaques to the loft as well as added a few lights to brighten up that area\r\n-- Added a storage chest to Lydia\\'s room so you can keep her gear separate \r\n-- Added 3 storage chests to Bedroom for armor, weapons and one for the wife (should she be a useful follower)\r\n-- Added a Safe to the bedroom (contains a few small housewarming gifts from the Jarl)\r\n-- Added a jewelry strong box to the right side of the bed (again with a few small housewarming gifts)\r\n-- Added the ability to add an enchanting table next to the alchemy table via Proventus the Jarl of whiterun\\'s Steward as a part of the decorating process.  (MUST SCROLL DOWN TO SEE OPTION WHEN TALKING TO PROVENTUS)  Also make sure you talk to Proventus in the throne room cell in order to get the house decoration dialogue. \r\n-- Added a few lights here and there to create a better mood or more light \r\n-- Changed the bed in the bedroom from the ragged bandit style straw mattress to the middle class version \r\n\r\nNOTE:  I use the \\\"Realistic Lighting\\\" mod to make the shadows much darker and such... I\\'ll try to get a version of the photos without that turned on so that people can see what it looks like with Vanilla lighting. \r\n\r\nLast but not least.  This is only the first version of this Mod.  I will be making a FULLY upgradable  Enhanced breezehome with a basement that you will be able to upgrade piece by piece to have a full forge/armory without loading screens between floors. \r\n\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "Sku11M0nkey",
  "createdUnix": "1329272582",
  "updatedUnix": "1329272582",
  "containsAdultContent": false,
  "uploadedBy": "joecci",
  "primaryFile": null,
  "files": []
}