{
  "modId": 9749.0,
  "modName": "Dragon Shout Modifications - Ruminations on the Rotmulaag",
  "summary": "Adds tomes to the world which give you perks to boost or add extra effects to your dragon shouts. Stop time completely with slow time or paralyze your enemies in terror with dismay and much more.",
  "descriptionHtml": "ReadMe Ruminations on the Rotmulaag v.2.3 - Also available on Steam Workshop - v1.3 unavailable on Steam.\r\n\r\nScroll to the bottom for information on RRD - Ruminations for Dawnguard.\r\n\r\nSteam link: http://steamcommunity.com/sharedfiles/filedetails/?id=11619\r\n\r\nVersion 1.3 - The cheat version, places a chest in Riverwood\\'s Sleeping Giant Inn\r\n\r\nVersion 2.3 - This is the treasure hunt version. It spreads the tomes across Skyrim and gives you hints to help you find them. This is for people who want a challenge. As an added incentive to use this version there are currently 8 new bonus tomes that have been added. These are listed below and are labeled as exclusive to V.2.\r\n\r\nLet me get all the usual readme crap out of the way:\r\n\r\nYou can use this mod for anything you want to use it for, but please don\\'t say it\\'s yours, this is my first mod and I\\'ve worked hard on it. Also, shoot\r\nme a message because I\\'d like to know what it is. Not that I\\'ll stop you from anything you want to do that is.\r\n\r\nIf you want to message me with suggestions or whatever you can pm on the Skyrim Nexus or on Steam, my username for both is Magicfork. I won\\'t give my email.\r\n\r\n\r\n\r\nConflicts:\r\n\r\nMight conflict with any mod that alters the base dragon shouts, but I doubt it. If you use a mod that alters the base Clear Skies shout there will be a greater chance for conflict. Also might conflict with any mod that changes The Fire Within. As of version 1.1 conflicts can arise if any other mod alters the activator effects of the vanilla meditations. As of version 2 this mod might have minor conflicts with any mod that alters the locations where I have placed the tomes, but nothing game breaking. \r\n\r\nThings not to do when using this mod:\r\n\r\nDO NOT talk to Paarthurnax about meditations if you are using the first 3 Lost Volumes perks. He will remove them from you! There is no point in doing this anyway as you get them all with the tomes.\r\n\r\nInstallation:\r\n\r\nExtract the contents of the archive to your Skyrim/Data Folder, if it asks you to merge or replace anything just click yes and it should all be good.\r\n\r\nComment or message me if you\\'re having any trouble and I will try to help to the best of my ability.\r\n\r\n\r\n\r\n\r\n\r\n\r\nBonuses:\r\n\r\nHere is a list of all the effects and their names and descriptions.\r\n\r\nAnimal Allegiance\r\n\r\nRaan/Animal - Spirit Bear - Summons a spirit bear to defend you for the duration of the shout.\r\nMir/Allegiance - Unwaivering Allegiance - Wild animals affected by the shout protect you until death\r\nTah/Pack - Strength of the Pack - Summons a pack of spirit wolves to defend you for the duration of the shout.\r\n___________________________________________\r\n\r\nAura Whisper\r\n\r\nLaas/Life - Understanding of Life - While Aura Whisper is active all spells cost 25% less to cast and all power attacks cost 25% less to perform\r\nYah/Seek - Seeking Prey - You cannot be seen or heard during the shout\\'s duration\r\nNir/Hunt - Eye of the Hunter - Your damage with bows increases by 50% for the duration of the shout\r\n___________________________________________\r\n\r\nBecome Ethereal\r\n\r\nFeim/Fade - Eternal Spirit - Vanilla\r\nZii/Spirit - Strength of Spirit - Magicka regenerates 100% faster while ethereal\r\nGron/Bind - Spirit Binding - After exiting spirit form, whether from time or you making an action, your re-etherealize for a short while\r\n___________________________________________\r\n\r\nCall Dragon - Winged Snow Hunter - Exclusive to V.2 - When you use Call Dragon you also call a storm which rains down spears of ice upon your foes.\r\n___________________________________________\r\n\r\nCall of Valor - N/A\r\n___________________________________________\r\n\r\nClear Skies - v.2 Exclusive Perks\r\nLok/Sky - Breaking Sky - Clear Skies rips magical spells off of your enemies, such as armor spells. Will remove wards, but will not pierce through them.\r\nVah/Spring - Blooming Spring - After shouting you are healed by a small amount for the duration and then you recieve a healing burst at the end of the effect\r\nKoor/Summer - Summer Drought - Your Clear Skies shout becomes as hot as a summer drought and prevents enemies from casting spells or performing power attacks if they are struck by it.\r\nNotes: These perks are tiered for balance purposes; rank 1 will only have Lok, rank 2 will have Lok and Vah, and so on.\r\n___________________________________________\r\n\r\nDisarm\r\n\r\nZun/Weapon - Weapon of the Voice - Your voice becomes a weapon causing physical damage to your opponents depending on which rank you use\r\nHaal/Hand - Push of the Hand - Moderately staggers opponents\r\nViik/Defeat - Utter Defeat - Has a chance to cause humanoid opponents (draugr, bandits, etc.) to enter a bleedout - Will eventually be changed to include every enemy with bleedouts\r\n___________________________________________\r\n\r\nDismay\r\n\r\nFaas/Fear - Intimidating Presence - Enemies who are affected have their weapon damage lowered by 25%, does not work on giants or dwarven machines of any kind\r\nRu/Run - Tiring Thoughts - Enemies are winded by your shout and have their stamina damage and their run speed lowered by 25%\r\nMaar/Terror - Supremacy of Terror - Low chance to paralyze enemies in terror for the entire duration of the shout\r\n___________________________________________\r\n\r\nDragonrend - v.2 Exclusive Perks\r\n\r\nJoor/Mortal - Limits of Mortality - Dragonrend lowers affected dragon\\'s resistances to melee and spell damage by 25% for the duration of the shout.\r\nZah/Finite - Infinite Mortality - The effects of Dragonrend last 25% longer.\r\nFrul/Temporary - Temporary Stasis - Removes the dragon\\'s currently equipped shout attack for the duration of Dragonrend, if the dragon does not have a secondary shout they will be unable to shout at all.\r\nNotes: Frul perk is untested on dragons with mod added breath attacks, but it should still work as long as those added attacks are properly labeled as shouts in the CK. If they are labeled as any other type of spell it will NOT work.\r\n___________________________________________\r\n\r\nElemental Fury\r\n\r\nSu/Air - Second Wind - Stamina regenerates 100% faster for the duration of the shout\r\nGrah/Battle - Battle Ready - Weapon damage increased by 25% for the duration of the shout\r\nDun/Grace - Grace of Air - Elemental Fury lasts for 25% longer\r\n___________________________________________\r\n\r\nFire Breath\r\n\r\nYol/Fire - The Fire Within - Modified from vanilla, damage increased by 50%\r\nToor/Inferno - Blazing Inferno - Your fire breath creates walls of flame if it hits ground that damage opponents who walk through for 50 damage\r\nShol/Sun - Light of the Sun - Enemies within a certain radius are blinded (just enraged really) and may attack friendy npcs for 15 seconds\r\nNotes: You may see something that says \\\"Fire Breath isn\\'t strong enough for this enemy.\\\" or something similar at times, just disregard this as it is only tied to the Shol perk but it will still display without it for some reason.\r\n____________________________________________\r\n\r\nFrost Breath\r\n\r\nFo/Frost - Biting Frost - Your frost breath deals 50% more damage (super original, I know)\r\nKrah/Cold - Bitter Cold - Your frost breath lingers or 50% longer, dealing damage over time and slowing opponents\r\nDiin/Freeze - Flash Freeze - High chance to paralyze opponents for 1 to 3 seconds depending on which rank of frost breath you use\r\n____________________________________________\r\n\r\nIce Form\r\n\r\nLiz/Ice - Trapped Under Ice - Ice form traps opponents 25% longer\r\nSlen/Flesh - Frosted Flesh - Ice form deals twice as much damage to entrapped opponents\r\nNus/Statue - Statue of Ice - Enemies entrapped by iceform no longer have damage resistance, enemies also take bonus damage when the ice is shattered.\r\n_____________________________________________\r\n\r\nKyne\\'s Peace\r\n\r\nKaan/Kyne - Kyne\\'s Favor - Has a small chance to make those unlikely to be affected by this shout to be affected\r\nDrem/Peace - Lasting Peace - Kyne\\'s peace lasts 25% longer\r\nOv/Trust - Nature\\'s Trust - Those affected by the shout will aid you for the shout\\'s duration, but they will not follow you\r\n_____________________________________________\r\n\r\nMarked for Death\r\n\r\nKrii/Kill - Murder Death Kill - Has a low chance to instantly kill opponents at or below 50% health\r\nLun/Leech - Nourishing Mark - Restore your health equal to that which is drained from opponents through the initial effect of the shout\r\nAus/Suffer - Poison of Suffering - Applies a heavy lingering poison damage effect for the duration of the shout\r\n_____________________________________________\r\n\r\nSlow Time\r\n\r\nTiid/Time - Halt Time - Has a chance to stop time altogether while still allowing you to move\r\nKlo/Sand - The Sands of Time - Your voice rips open the fabric of space and time, creating a sand storm dealing 20 physical damage per second while it is active\r\nUl/Eternity - Power Over Eternity - There is a high chance that slow time lasts for double the duration\r\n_____________________________________________\r\n\r\nStorm Call\r\n\r\nStrun/Storm - Unending Storm - The storm lasts 25% longer\r\nBah/Wrath - Wrath of the Storm - Lightning bolts from the storm deal 50% more damage\r\nQo/Lightning - Lightning Rain - Storm Call rains down lightning bolts at higher intervals, basically fires a lightning bolt every 2 seconds instead of 3\r\n_____________________________________________\r\n\r\nThrow Voice \r\n\r\nZul/Voice - N/A\r\nMey/Fool - Summon Fool - Exclusive to V.2 - Throw Voice summons a spectral mudcrab where your voice touches the ground. This is invulnerable and serves as a distraction.\r\nGut/Far - N/A\r\n_____________________________________________\r\n\r\nUnrelenting Force\r\n\r\nFus/Force - Force Without Effort - Vanilla\r\nRo/Balance - Balancing Act - Attempt to balance your life forces with your enemies. When either your mana, stamina, or health goes under 50% and you use Unrelenting Force you absorb mana, stamina, or health respectively.\r\nDah/Push - Pure Force - Your third tier Unrelenting Force shout is double as effective (this can do some SERIOUS damage)\r\n_____________________________________________\r\n\r\nWhirlwind Sprint\r\n\r\nWuld/Whirlwind - Momentum - If you use a shout 10 seconds after the cooldown of whirlwind sprint the cooldown of that shout is reduced by half\r\nNah/Fury - Furious Winds - After using whirlwind sprint your base weapon damage is increased by a static measure for a short while.\r\nKest/Tempest - Lightning Tempest - Surrounds the user with a high damage lightning cloak for 15 seconds which disintegrates any opponent whose health falls too low, works regardless of the destruction perk disintegrate.\r\n\r\n__________________________________________________\r\n\r\nRuminations on the Rotmulaag - Dawnguard Add-on - Readme\r\n\r\nAbout:\r\n\r\nThis add-on to Ruminations on the Rotmulaag requires the official Dawnguard plug-in to work properly, if you have version 2\r\nit also fixes a compatibility issue between the two involving the location of the Kest tome.\r\n\r\nAdds new tomes to find for each shout, listed below. To get started, find the prequel tome in either Volkihar Castle or Fort \r\nDawnguard. To find the last tome of each shout you must defeat the dragon necromancer described in this prequel, fair warning:\r\nyou\\'ll want to be pretty powerful before taking him on as he has strong magical and physical attacks that can overwhelm you at\r\neven mid levels.\r\n\r\nNew Shout Effects:\r\n\r\nDrain Vitality:\r\n\r\nGaan/Stamina - Ravaged Vigor - Lowers the enemy\\'s base stamina by 75 points for the duration.\r\n\r\nLah/Magicka - Wracked Mind - Lowers the enemy\\'s base magicka by 75 points for the duration.\r\n\r\nHaas/Health - Weakened Resolve - Lowers the enemy\\'s base health by 75 points for the duration.\r\n\r\nSoul Tear:\r\n\r\nRii/Essence - Life Essence - When you tear out an enemy\\'s soul you are healed for 50 points.\r\n\r\nVaaz/Tear - Scarred Soul - Enemies struck by soul tear take another 300 points of damage over 30 seconds.\r\n\r\nZol/Zombie - Zombie Thrall - Reanimated enemies do not time out.\r\n* May be changed to this: Zombie Horde - Enemies killed by zombies will reanimate to fight for you.\r\nI currently can\\'t get this to work as I can\\'t view any of the Dawnguard scripts.\r\n\r\nSummon Durnehviir:\r\n\r\nDur/Curse - Curse of the Cairn - Opens a rift to the soul cairn, raining down bolts of energy which cause helpful bonemen to form when they strike the ground\r\n* \\\"What a horrible night to have a curse.\\\" Sadly does not pop up after casting this.\r\n\r\nNeh/Never - Never Sated - Durnehviir drains the life of enemies in his proximity, similar to the soul crystals in the soul cairn this effect will not actually kill any enemies\r\n* Currently will damage the player and any allies within Durnehviir\\'s proximity as well as enemies unless you use a soul husk.\r\nIf I can ever get access to the Dawnguard scripts then I will fix this, it can\\'t kill you at least.\r\n\r\nViir/Dying - Dying Breath - While Durnehviir is in the field enemies who are killed release a soul wisp to fight for you\r\n______________________________________\r\n\r\nChanges and fixes:\r\n\r\nVersion 1.1 - Fixes a bug that causes you to massively regenerate health. This was caused by an oversight of the activator effects, both vanilla and mod added. I\\'ve changed the vanilla mediation activator effects and the mod added activator effects so that there should be no problem. SHOULD be. Sorry if I broke anyone\\'s game with my dumbassery, and I hope you don\\'t have to have a clean save to get it working right again.\r\n\r\nVersion 1.2 - Fixes a bug that causes Fire Breath to affect the rate at which your destruction skill levels, and also changes the shader of the Aus effect to be more subtle.\r\n\r\nVersion 1.3 - Fixes the Klo effect increasing your destruction skill.\r\n\r\nVersion 2.1 - Same fixes and changes as 1.2, just for version 2.\r\n\r\nVersion 2.2 - Fixes the Klo and Viing effects also increasing your destruction skill.\r\n\r\nv2.3 \r\n- Buffs to Shol perk, affects higher level enemies.\r\n- Viik perk now works on Draugr and Skeleton based enemies\r\n- Added an extra effect to Nus perk\r\n- Added new perks along with their respective tomes: Lok, Vah, Koor, Zah, and Frul.\r\n- Changes to the base Clear Skies shout to allow it to be used in-doors so you can get more use out of its perks. I\\'m not entirely sure if there will be any repercutions or not for this.\r\n\r\nTBA: A hard version for when people have found every tome on one play-through and want another experience. This version will make all perks tiered with their respective words and will place every tome in a completely different location and hints will work differently.\r\n\r\n\r\n\r\nThanks if you decide to download my mod! I hope you enjoy it and continue to check back for updates.\r\n\r\n-Magic Fork ",
  "categoryId": "75",
  "version": "v2.3.2",
  "author": "Magicfork",
  "createdUnix": "1329307116",
  "updatedUnix": "1351877792",
  "containsAdultContent": false,
  "uploadedBy": "MagicFork",
  "primaryFile": null,
  "files": [
    {
      "fileId": "34877",
      "name": "Ruminations on the Rotmulaag v1-3",
      "version": "v1.3",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "34",
      "fileName": "Ruminations on the Rotmulaag v1-3-9749.rar",
      "uploadedUnix": "1329849157",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/2c3aa51b1c257d4fdd60d68fcae5283b17fe48457fc97751d2472f9632cd9015/analysis/1406702297/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ruminations%20on%20the%20Rotmulaag%20v1-3-9749.rar?fid=34877&ttl=1535769554&ri=8192&rs=8192&setec=b6b1e17c6ba51d193f9c7ed60a84465f"
    },
    {
      "fileId": "44121",
      "name": "Ruminations on the Rotmulaag v2-3",
      "version": "v2.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "187",
      "fileName": "Ruminations on the Rotmulaag v2-3-9749.zip",
      "uploadedUnix": "1331993039",
      "modVersion": "v2.3",
      "virusScanUrl": "https://www.virustotal.com/file/256f744b6edb89a6adfccba421431316d69318d4cb63f1bbc50c03eed2b14bd5/analysis/1406753048/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ruminations%20on%20the%20Rotmulaag%20v2-3-9749.zip?fid=44121&ttl=1535769555&ri=8192&rs=8192&setec=ef317ce5c875bba2eaded6a4b4142f58"
    },
    {
      "fileId": "64682",
      "name": "Ruminations on the Rotmulaag v2-3-1",
      "version": "v2.3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "166",
      "fileName": "Ruminations on the Rotmulaag v2-3-1-9749-v2-3-1.rar",
      "uploadedUnix": "1338422023",
      "modVersion": "v2.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/d73c0d5160f307d74186b88d76aaa098dc47227077a9b809235b70db3aeb7877/analysis/1406926623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ruminations%20on%20the%20Rotmulaag%20v2-3-1-9749-v2-3-1.rar?fid=64682&ttl=1535769555&ri=8192&rs=8192&setec=985aee7b763763fe4b1e92e458430da5"
    },
    {
      "fileId": "64683",
      "name": "Ruminations on the Rotmulaag v1-3-1",
      "version": "v1.3.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "38",
      "fileName": "Ruminations on the Rotmulaag v1-3-1-9749-v1-3-1.rar",
      "uploadedUnix": "1338422703",
      "modVersion": "v1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/09c5df49564f6ad091b604346f9df2fb41c0ba312934eaf3976859c0ef9e5a87/analysis/1406926624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ruminations%20on%20the%20Rotmulaag%20v1-3-1-9749-v1-3-1.rar?fid=64683&ttl=1535769556&ri=8192&rs=8192&setec=45b2cded6b3595a643ddf0a569582440"
    },
    {
      "fileId": "89590",
      "name": "Ruminations on the Rotmulaag v2-3-2 Fixed",
      "version": "rv2.3.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "183",
      "fileName": "Ruminations on the Rotmulaag v2-3-2 Fixed-9749-rv2-3-2.rar",
      "uploadedUnix": "1348182543",
      "modVersion": "rv2.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/bed57834c04b7b8b04379e749405066b6b47c33edcffe2b66480b47ab4d00ea2/analysis/1407178444/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ruminations%20on%20the%20Rotmulaag%20v2-3-2%20Fixed-9749-rv2-3-2.rar?fid=89590&ttl=1535769556&ri=8192&rs=8192&setec=872a0a0b9415aa04b65938c9f01920c2"
    },
    {
      "fileId": "97137",
      "name": "RRD - Dawnguard Ruminations",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "104",
      "fileName": "RRD - Dawnguard Ruminations-9749-v1.rar",
      "uploadedUnix": "1351877792",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/d91e85de864beceb761d2bdaf09b2227d199948fde2d7c81af39af10308e39ef/analysis/1407246203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RRD%20-%20Dawnguard%20Ruminations-9749-v1.rar?fid=97137&ttl=1535769557&ri=8192&rs=8192&setec=658b049e3afee59acb3ad784ca48fb21"
    }
  ]
}