{
  "modId": 9761.0,
  "modName": "Fletching",
  "summary": "Make use of firewood; craft it into bows and arrows!",
  "descriptionHtml": "This mod allows the player to craft arrows. Lower level arrows require a new item: Chicken Feathers. Higher level arrows use Hawk Feathers. To craft arrows you must have the respective perk (i.e. Steel Arrows req. Steel Smithing perk, Elven Arrows req. Elven Smithing perk etc.) Using firewood, feathers and ingots the player can make arrows.\r\nThis mod also adds Elven Gilded Arrows. These new arrows are more powerful than standard Elven Arrows, however they require a quicksilver ingot to craft, too.\r\n\r\nCraftable Items:\r\nLong Bow: 2 Firewood - No perks\r\nHunting Bow: 3 Firewood - No perks\r\nIron Arrow(12): 1 Iron Ingot, 3 Chicken Feather, 1 Firewood - No perks\r\nSteel Arrow(12): 1 Steel Ingot, 3 Chicken Feather, 1 Firewood - Steel Smithing Perk\r\nOrcish Arrow(12): 1 Orichalcum Ingot, 1 Iron Ingot, 3 Chicken Feather, 1 Firewood - Orcish Smithing Perk\r\nDwarven Arrow(12): 1 Dwarven Ingot, 1 Hawk Feathers, 1 Firewood - Dwarven Smithing Perk\r\nElven Arrow(12): 1 Refined Moonstone, 1 Hawk Feathers, 1 Firewood - Elven Smithing Perk\r\nGilded Elven Arrow(12): 1 Refined Moonstone, 1 Quicksilver Ingot, 1 Hawk Feathers, 1 Firewood - Elven Smithing Perk\r\nGlass Arrow(12): 1 Malachite Ingot, 1 Refined Moonstone, 1 Hawk Feathers, 1 Firewood - Glass Smithing Perk\r\nEbony Arrow(12): 1 Ebony Ingot, 1 Hawk Feathers, 1 Firewood - Ebony Smithing Perk\r\nDaedric Arrow(12): 12 Ebony Arrow, 1 Daedra Heart - Daedric Smithing Perk\r\n\r\nAs Hawk Feathers are quite hard to find I have also made them slightly more common than before.\r\nChicken Feathers can be found on chickens or sometimes in loot.\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "27",
  "version": "1.0",
  "author": "Oblivious12123",
  "createdUnix": "1329317072",
  "updatedUnix": "1329596263",
  "containsAdultContent": false,
  "uploadedBy": "oblivious12123",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33308",
      "name": "Fletching",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Fletching-9761-1-0.zip",
      "uploadedUnix": "1329596263",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/60c97f284675408db0c997e29bc780237e127af845bbe232fb431d3bff00040c/analysis/1406693673/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fletching-9761-1-0.zip?fid=33308&ttl=1535769596&ri=8192&rs=8192&setec=90976bd8c06bb367a8f8b548e8cd1ca6"
    }
  ]
}