{
  "modId": 9804.0,
  "modName": "NapalmPerkOverhaul",
  "summary": "Alters several perks and restructures many of the skill trees to get rid of most of the perk sinks like five ranks talents and poor perk progression like in smithing while maintaining the same power and balance as the vanilla game. This will not make your character any more or less powerful but simply give you more flexibility in perk allocation.",
  "descriptionHtml": "[b]The vanilla perk trees Bethesda gave us were a bit lacking in certain aspects. We all know the plight of the light armor smith or the guy that doesn\\'t like helmets. This mod aims to remedy most of these issues.[/b]\r\n\r\n[b]This mod as of the time of uploading is more of a way to balance the absurd point sinks in the perk trees but with feedback I plan to also turn it into a balancing mod for the perks that will be updated as needed. If you have any suggestions for changes to perks or the structure of the trees by all means leave it in the comments.[/b]\r\n\r\n[b]As always any modification to the perk trees can affect already existing characters in uncertain ways. This is designed with new characters in mind. If you decide to use an existing character back up your saves before hand as it saves us both a headache.[/b]\r\n\r\n[u]General Changes[/u]\r\n\r\n- All perks with 5 ranks to them have been dropped down to 3 so you don\\'t feel like you have to dump half your points into them keeping you from the juicy stuff. They have been modified to provide as much if not more power at rank 3 than the vanilla ones did at rank 5 so the feel should be the same with just more spare points for yourself. An example is vanilla Juggernaut\\'s ranks went as such (0skill +20%armor/ 20skill +40%armor/ 40skill +60%armor/ 60skill +80%armor/ 80skill +100%armor). With this mod installed Juggernaut\\'s ranks would go as such (0skill +25%armor/ 35skill +50%armor/ 70skill +100%armor). Several other perks with 2 or 3 ranks have been lowered and rebalanced to require less perks for the same amount of power the old ones did.\r\n\r\n- You can now backtrack along trees without having to work up a whole other branch for a single perk. An example is smiths that favor light armor can drop back down to Daedric Smithing from Dragon Armor to get the weapons with out having to make their way up the entire heavy armor side. This can be done on any tree with a connected loop like Archery, Smithing, Illusion, etc. [u]Only Available in version 1. Proved slightly buggy and may cause, while not game breaking, very strange interface glitches. So it was removed in later versions.[/u]\r\n\r\n- Talents that required all 4 pieces of armor like Custom Fit or Matching Set no longer require you to wear a helmet. Many of us either do not like the art work of certain helmets or like to see our characters faces. Now as long as you have the cuirass, boots, and gauntlets you will get the bonus from these types of talents.\r\n\r\n- A few perk trees have been restructured where it made sense. An example is there is now a link between the Arcane Blacksmith and the Advanced Armor and Daedric Smithing perks in the Smithing tree. This way heavy armor smiths do not have to take Elven Smithing to get the plate that Advanced Armors provides and light armor smiths can get the Daedric weapons without having to take the all the heavy armor smithing perks.\r\n\r\n[u]Specific Changes[/u]\r\n\r\n[i]Archery[/i]\r\n- Overdraw has been dropped to 3 ranks.\r\n- Steady Hand has been dropped to one rank. (new in version 2)\r\n- Critical Shot has been dropped to 2 ranks, had the critical damage buff removed, and had the critical chance boosted to 15% and 30% respectively for the 2 ranks. (new in version 2)\r\n- A new perk has been added called Shredder Shot that doubles the damage of critical hits from the Critical Shot perk. (new in version 2)\r\n\r\n[i]Heavy Armor[/i]\r\n- Juggernaut has been dropped to 3 ranks.\r\n- Cushioned, Well Fitted, Matching Set, and Reflect Blows no longer require the player to wear a helmet.\r\n\r\n[i]Block[/i]\r\n- Shield Wall has been dropped to 3 ranks.\r\n- There is no longer a link between Shield Charge and Disarming Bash. This way the left side of the tree becomes shield exclusive while the whole right side can benefit two handed fighters or shield users.\r\n\r\n[i]Two Handed[/i]\r\n- Barbarian has been dropped to 3 ranks.\r\n\r\n[i]One Handed[/i]\r\n- Armsman has been dropped to 3 ranks.\r\n- Bladesman no longer boost critical damage at higher ranks but the overall critical chance has been boosted to 10%, 20%, and 30% respectively for the 3 ranks. (new in version 2)\r\n- Dual Flurry rank 2 has been boosted to 40% attack speed increase while dual wielding. (new in version 2)\r\n\r\n[i]Smithing[/i]\r\n- Arcane Smithing perk is now linked to Advanced Armors and Daedric Smithing. This is to allow light armor smiths to get the Daedric weapons and heavy armor smiths to get the advanced plate without wasting perks in the smithing perks that do not pertain to them.\r\n\r\n[i]Light Armor[/i]\r\n- Agile Defender has been dropped down to 3 ranks.\r\n- Custom Fit, Matching Set, Wind Walker, and Deft Movement no longer require the player to wear a helmet.\r\n\r\n[i]Sneak[/i]\r\n- Stealth has been dropped down to 3 ranks.\r\n\r\n[i]Lockpicking[/i]\r\n- No changes.\r\n\r\n[i]Pick Pocket[/i]\r\n- Light Fingers has been dropped down to 3 ranks.\r\n\r\n[i]Speech[/i]\r\n- Haggling has been dropped down to 3 ranks.\r\n\r\n[i]Alchemy[/i]\r\n- Alchemist has been dropped down to 3 ranks.\r\n- Concentrated Poison will now last for 3 charges rather than 2.\r\n- Experimenter has been dropped down to 1 rank.\r\n- Poisoner is now linked to Alchemist for alchemist not interested in beneficial potions but only poisons. (new in version 2)\r\n- Green Thumb is now linked to Purity so those who wish to avoid the Snakeblood perk can do so as it proves redundant to certain characters. (new in version 2)\r\n\r\n[i]Illusion[/i]\r\n- No changes.\r\n\r\n[i]Conjuration[/i]\r\n- Atromancy no longer requires the Summoner perk to obtain since Summoner has been moved to its own branch. (new in version 2)\r\n- Summoner has been dropped to 1 rank and has its own branch so it is no longer necessary for Atronach users. (new in version 2)\r\n\r\n[i]Destruction[/i]\r\n- No changes.\r\n\r\n[i]Restoration[/i]\r\n- No changes.\r\n\r\n[i]Alteration[/i]\r\n- Magic Resistance has been dropped down to 2 ranks. (new in version 2)\r\n\r\n[i]Enchanting[/i]\r\n- Enchanter has been dropped down to 3 ranks.\r\n- Fire Enchanter, Frost Enchanter, and Storm Enchanter are now linked individually to Corpus Enchanter.\r\n- Extra Effect now has an additional rank that allows you to place 3 enchantments on the same item. (Removed in version 3 due to bugs.)\r\n\r\n[b]Special Note[/b]\r\nThis is my very first mod I am publishing to the Nexus so any feedback positive or negative is welcome as I seek to improve myself. If you find any bugs or issue leave them in the comments or send me a personal message here on the Nexus. Also feel free to use this mod, alter it, upload it elsewhere in any way you see fit. I only ask you throw me in the credits with a link if possible to this original upload if you decide to spread this elsewhere.\r\n\r\n\r\n\r\n",
  "categoryId": "73",
  "version": "3",
  "author": "NAPALM13092",
  "createdUnix": "1329333603",
  "updatedUnix": "1330115711",
  "containsAdultContent": false,
  "uploadedBy": "NAPALM13092",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31636",
      "name": "Napalm_Perk_Overhaul_V1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "Napalm_Perk_Overhaul_V1-9804.zip",
      "uploadedUnix": "1329333695",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a623d0392bf40062f15d5c38c1a2eb114cf8bc9900be1419b28a29bb18f077ae/analysis/1406684969/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Napalm_Perk_Overhaul_V1-9804.zip?fid=31636&ttl=1535769674&ri=8192&rs=8192&setec=d4531c4fa09f4ed426674e9f0bd76e05"
    },
    {
      "fileId": "33862",
      "name": "Napalm_Perk_Overhaul_V2",
      "version": "2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Napalm_Perk_Overhaul_V2-9804.zip",
      "uploadedUnix": "1329688449",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/6bcc802e344cdeaf1660cbe974e523f803d5c101161a28745814e94e44202d64/analysis/1406696532/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Napalm_Perk_Overhaul_V2-9804.zip?fid=33862&ttl=1535769675&ri=8192&rs=8192&setec=362546c185060897146e970332a050eb"
    },
    {
      "fileId": "36332",
      "name": "Napalm_Perk_Overhaul_V3",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Napalm_Perk_Overhaul_V3-9804-3.zip",
      "uploadedUnix": "1330115711",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/2ddd899e028bb5c10653e3078ae991c0dfd0e85816ff2dd354355ca7bb1ec440/analysis/1406710702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Napalm_Perk_Overhaul_V3-9804-3.zip?fid=36332&ttl=1535769675&ri=8192&rs=8192&setec=4c854354ad7ffd79b88d862732b8162f"
    }
  ]
}