{
  "modId": 9815.0,
  "modName": "Sepheroses Dragon Auras",
  "summary": "A small shader modification that adds something to the Dragons of Skyrim.",
  "descriptionHtml": "Attention: UNDER NO CIRCUMSTANCES WILL THIS BE UPLOADED TO STEAM WORKSHOP AND NO ONE REQUESTING PERMISSION TO DO SO WILL RECEIVE IT. THIS STATEMENT OVERRIDES ANYTHING IN THE PERMISSIONS POPUP THAT IS AVAILABLE ON NEXUS THAT CONFLICTS WITH THIS STATEMENT.\r\n\r\nNew Update: Apparently this mod is now recognized by BOSS when sorting, but there is an issue: the guys working on BOSS took it to heart when I suggested loading it before DD, so the dragons won\\'t have auras typically. It\\'s easy enough to fix though, just remember to drag my mod back down if you want the auras with DD, but keep in mind that Alduin might end up a tad weaker than the rest of the dragons in DD. I\\'m going to update my ESP so that Alduin has the same stats in my mod as in DD (if there is a difference), which should correct that one problem even if you load mine later.\r\n\r\nUpdate: I found out on accident that some DD Dragons are in fact given auras by this mod in it\\'s current form. (see the most recent screen). This isn\\'t to say that there isn\\'t a different,  unforseen conflict, but at least some of the DD dragons will have auras.\r\n\r\nI made this mod out of frustration. I got tired of having a dragon circle for three or four minutes (I know, exaggeration) before using it\\'s breath weapon, revealing to me what element I needed to defend against and what to attack with. So I made this mod, the fire dragons now have a red, wispy, flame like aura. The frost dragons now have a chilly looking aura about them as well.\r\n\r\nNo longer will you need to guess at which is which while you sneak up and see them from a distance. You will always be able to prepare your weapons, spells and armor so long as you take a moment to look.\r\n\r\nAs an added bonus, I also made a shader just for Alduin, but I had to do it a tad differently than the other two, for this reason I could potentially see a conflict with mods like Deadly Dragons. On the upside though if this mod loads as early as possible, DD can overwrite the alduin changes but the other two dragon types will retain their shaders effect.\r\n\r\nEnjoy!\r\n\r\n\r\nInstallation:\r\n\r\nEasy as pie, just drag the ESP into your data folder, tick it in NMM, move it around a bit in your load order and you are good to go with the shadery goodness.\r\n\r\n-OR-\r\n\r\nJust DL and install with NMM.\r\n\r\nAlso, check out http://skyrim.nexusmods.com/downloads/file.php?id=9888 , my Dragon Reskins if you get the chance. :)\r\n\r\nMy Orcish armor color fix: http://skyrim.nexusmods.com/downloads/file.php?id=10720\r\nMy Rain retex: http://skyrim.nexusmods.com/downloads/file.php?id=11063\r\nSnow Retex: http://skyrim.nexusmods.com/downloads/file.php?id=11063",
  "categoryId": "83",
  "version": "1.0",
  "author": "Sepherose",
  "createdUnix": "1329336859",
  "updatedUnix": "1329336933",
  "containsAdultContent": false,
  "uploadedBy": "Sepherose",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31667",
      "name": "V1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "V1-9815.rar",
      "uploadedUnix": "1329336933",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bd394ad0c8313258c40dde9626802a150636cbe0ae58a1b7ec361f7babe7aa59/analysis/1406685184/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/V1-9815.rar?fid=31667&ttl=1535769694&ri=8192&rs=8192&setec=8d67e8c1e78bacf7e7bbb06549331660"
    }
  ]
}