{
  "modId": 9839.0,
  "modName": "DArchons - two Breton mage followers - male and female",
  "summary": "Creates two new Breton mages, a male and female, for use as followers. Places them in the Sleeping Giant Inn, in the town of Riverwood. They are balanced, lore-friendly followers. Their abilities as mages fall somewhere between Aranea and Marcurio. They has the \\\"Light Foot\\\" perk, are unaggressive, and are set to level with the player all the way ",
  "descriptionHtml": "D\\'Archons, two lore-friendly, balanced, Breton mage followers.\r\nVersion 1.33\r\n\r\nDESCRIPTION:\r\n\r\nThis mod creates a two new Breton mages, a brother (Jacil) and sister (Selmina), contained in the included .ESM files. They are for use as followers. The included .ESPs place them in the Sleeping Giant Inn, in the town of Riverwood. They are balanced, lore-friendly followers, with minimal dialogue, for no-nonsense, straightforward, and uncomplicated companions.\r\n\r\nBoth are very similar in abilities. The primary difference is that Selmina is an elemental mage, able to summon atronachs (fire, ice, and storm), and has perks appropriate to this role. Jacil is a necromancer, thus he conjures undead minions, is effective at turning enemy undead, and has perks appropriate to this role. The only other differences between them is that they are different sexes, have different names, and obviously look different. Each of their abilities as mages fall somewhere between Aranea and Marcurio. So each is slightly stronger than the former and slightly weaker (in Destruction magic) than the latter (thanks to Marcurio\\'s Augmented Shock perk). However, they are more versatile, since not only are they well versed in all three elements of destruction magic, they are also capable conjurers of their respective domain. Additionally, they each have more robust options for self-healing and protection spells. Finally, they don\\'t charge 500 gold each time you hire them. Besides Augmented Shock and those mentioned above, they each have similar perk sets as Marcurio.\r\n\r\nIn addition, I have given them the \\\"Light Foot\\\" perk, which prevents them from setting off traps (just to circumvent annoyance) and set their aggressiveness such that they should not attack everything in sight, but instead defend themselves and their allies only when attacked. Both of the latter features should make them more suitable for sneaky types that don\\'t want their followers charging ahead and waking up half the dungeon on you. They are not sneak-thieves though, they are mages; thus they do not have high sneak skills. However, their boots will help (see below).\r\n\r\nThey have been set to level with the player all the way up to maximum level, just like J\\'zargo in the vanilla game.\r\n\r\nThey are also able to join the Blades.\r\n\r\nIf married, each will become a general merchant to buy your loot, and this behavior carries over into the field. Be sure to open his/her trade dialog to confirm s/he has gold before inviting him/her to rejoin you as a follower, after the wedding.\r\n\r\nHis/her default robes and boots have the following enchantments: Fortify Health + Fortify Magicka (Robes), Muffle + Waterbreathing (boots). The Muffle enchantment should make thief player types happy, since s/he will be less likely to give you away. S/he will wear these unless given a chest/body item or footwear with a higher armor rating.\r\n\r\nFinally, each is marked as \\\"protected,\\\" which means that in most circumstances, only the player should be able to kill him/her (just the same as the default followers in vanilla Skyrim). If you wish him/her to be essential, simply open the console (default \\\"~\\\" key), type \\\"help Selmina 0\\\" or \\\"help Jacil 0\\\" and hit enter, record the <base ID> that matches his/her name under the \\\"NPC_\\\" category (this will be an eight character alphanumeric code, such as \\\"4d000d62\\\"), then type in \\\"setessential <base ID> 1\\\" and hit enter.\r\n\r\nI have created alternate versions of this mod, packaged in a BAIN-friendly archive. These are available only on TES Nexus and Planet Elder Scrolls (because Steam Workshop does not have a mechanism to handle alternate versions within the same listing). The links to both of these download sites are below. A \\\"BAIN-friendly archive\\\" only has meaning to those who use Wrye Smash for Skyrim. For all others, it just means that the different options have been separated into different directories.\r\n\r\n\r\nINSTALLATION:\r\n\r\n\tUPGRADE WARNING! If you are upgrading from a previous version of this mod, you must first empty out Selmina\\'s inventory, then dismiss her as a follower. Save, exit, then uninstall the previous version. Once you have the new version installed (see below) play the game as usual. The follower(s) will be in the Sleeping Giant Inn, in the town of Riverwood. You should \\\"refresh\\\" them before recruiting (yes, another game bug), by opening the console, selecting the NPC in question, type \\\"disable\\\", close the console, reopen the console, then type \\\"enable\\\". Sorry about all of this, but it is necessary to circumvent the bug where the game neglects to increase follower stats with level. You may need to do this once more when you level with them as a follower, in order for their stats to update correctly. I know, I know...\r\n\r\nIn order to place the NPC in the world, you first must load ONE of the .ESPs in the \\\"0 Required\\\" folder. The required options are: \\\"1 Default, with robes and boots\\\", and \\\"1 Alternate, no clothing.\\\"\r\n\r\nThe various options and folders are as follows:\r\n\r\n0 ESM Default, both with robes and boots - choose this .ESM if you want to use Selmina with long hair or Jacil (or both), each with default clothing (enchanted robes and boots).\r\n\r\n0 ESM Alternate, both with no clothing - choose this .ESM if you want to use Selmina with long hair or Jacil (or both), each with no clothing (see \\\"no clothing\\\" note below).\r\n\r\n0 ESM Alternate, Selmina with short hair - choose this .ESM if you want to use Selmina with short hair or Jacil (or both), each with default clothing (enchanted robes and boots).\r\n\r\n0 ESM Alternate, Selmina with short hair and no clothing - choose this .ESM if you want to use Selmina with short hair or Jacil (or both), each with no clothing (see \\\"no clothing\\\" note below).\r\n\r\n1 ESP, Selmina - choose SelminaDArchon.esp if you want to place Selmina in the Sleeping Giant Inn, in the town of Riverwood.\r\n\r\n1 ESP, Jacil - choose JacilDArchon.esp if you want to place Jacil in the Sleeping Giant Inn, in the town of Riverwood.\r\n\r\n1 ESP, Selmina and Jacil - choose SelminaJacilDArchon.esp if you want to place both Selmina and Jacil in the Sleeping Giant Inn, in the town of Riverwood.\r\n\r\nYOU MUST CHOOSE ONE (ONLY ONE!) OF THESE .ESMs, PLUS ONE (ONLY ONE!) OF THESE .ESPs, and place them in your ..\\\\Skyrim\\\\data directory, then select them in the launcher. If you prefer not to place them in the world by not installing an .ESP, you can still summon them to your location via the console (see \\\"placeatme\\\" usage at http://www.uesp.net/wiki/Skyrim:Console#Targeted_Commands ). The no clothing options are for people who would prefer to dress them in clothes other than the mage robes and boots I originally gave them. If using the no clothing option, be warned: until you give him/her clothes, s/he will be in his/her underwear or nude (if you installed a nude mod). ONLY USE ONE OF THE INCLUDED .ESM FILES, AND ONE OF THE .ESP FILES. You should therefore have DArchon.esm, plus either SelminaDArchon.esp, JacilDArchon.esp, or SelminaJacilDArchon.esp in your ..\\\\Skyrim\\\\data directory.\r\n\r\nThe \\\"--Screenshots\\\" folder is there only for you to view the images. You do not need to install them to your game directory. In case anyone asks, the armor that Selmina is weaing in \\\"--Selmina becoming a Blade.jpg\\\" is \\\"Somewhat Skimpy DragonScale Armour with CBBEv2 version\\\" ( http://skyrim.nexusmods.com/downloads/file.php?id=5411 ). Her Dragonscale crown helmet is from \\\"Crown Helmets\\\" ( http://skyrim.nexusmods.com/downloads/file.php?id=5803 ).\r\n\r\nMirrored at Skyrim Nexus ( http://skyrim.nexusmods.com/downloads/file.php?id=9839 ) and Planet Elder Scrolls ( http://planetelderscrolls.gamespy.com/View.php?view=SkyrimMods.Detail&id=37 ).\r\n\r\n\r\nTROUBLESHOOTING NOTES:\r\n\r\nMarriage: If you have a problem relating to marrying Selmina/Jacil, particularly with him/her leaving the altar the minute the ceremony is concluded, this is a problem with all stock Bethesda followers. There is a mod called \\\"Marriage Mod WIP\\\" ( http://steamcommunity.com/sharedfiles/filedetails/?id=11579 ) that seeks to correct this problem, if you are interested.\r\n\r\nFollowing: If you find that Selmina/Jacil cannot keep up with you very well, this is yet another problem with all stock Bethesda followers. I know of a mod that seeks to resolve this issue as well, and should be compatible with my mod. You can find it here: \\\"Followers Keep Up\\\" ( http://steamcommunity.com/sharedfiles/filedetails/?id=10172 )\r\n\r\nDark/gray/discolored head: There is a well-known bug in the official Creation Kit (which I used to create this mod) that produces dark/gray heads, which do not match up with the body coloration. I have done all I could on my end, so if you find yourself encountering this bug, it unfortunately falls to you to do something about it. Simply open the console (default tilde ~ key), click on the NPC of concern, type \\\"setnpcweight 100\\\" (no quotes) close the console, reopen the console, then type \\\"setnpcweight 50\\\". If this doesn\\'t fix your problem, then I\\'m afraid you\\'re stuck with it until Bethesda fixes the bug.\r\n\r\nBoth of these followers use the very same mechanisms as stock Bethesda followers in the vanilla game. Thus, if you have crashes or other serious problems, it is highly likely that another mod you have installed is the culprit, or is simply a bug in the game itself. This mod does not touch sensitive areas of the game, and in fact is kept deliberately very simple so as to avoid problems. Bearing that in mind, if you still believe there is a problem you have encountered directly relating to the follower in this mod, please let me know so that I can address it.\r\n\r\nFINAL NOTE (all followers):\r\n\r\nNot all magical item enchantments work on NPCs. For information on what enchanted equipment is effective to give NPC followers, see the article on UESP Wiki: http://www.uesp.net/wiki/Skyrim:Followers#Enchanted_Follower_Equipment\r\n\r\nThanks for reading!\r\n\r\n\r\nCHANGE LOG:\r\n\r\nVersion 1.33\r\n\r\n    Updated the mod with the new changes from the Creation Kit update. Hopefully, this will solve the problem with the dark/gray faces.\r\n\r\nVersion 1.32\r\n\r\n    Modified Jacil to be a necromancer instead of an elemental mage (Selmina already is an elemental mage, so this was done to add a little variety). They are otherwise the same in abilities.\r\n\tMade both NPCs not affect the stealth meter when the player is sneaking.\r\n\r\nVersion 1.31\r\n\r\n    Fixed a minor oversight I made, where Jacil adopted Selmina\\'s name. Oops, Sorry! Nothing else has changed, so no worries on upgrading.\r\n\r\nVersion 1.3\r\n\r\n    Added Jacil\r\n    Gave both NPCs custom default robes and boots.\r\n    Reorganized structure of the mod, including the use of an ESM for NPC data. This will help alleviate problems for future upgrades.\r\n\r\nVersion 1.2\r\n\r\n    Converted to a BAIN-friendly archive with alternate versions: for Selmina with short hair, no clothing, or both.\r\n\r\nVersion 1.1\r\n\r\n    Fixed NPC\\'s perks and stats.",
  "categoryId": "66",
  "version": "1.33",
  "author": "Valtarien",
  "createdUnix": "1329343202",
  "updatedUnix": "1333736971",
  "containsAdultContent": false,
  "uploadedBy": "RiddlingLynx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32851",
      "name": "Selmina DArchon - a Breton female mage follower",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "962",
      "fileName": "Selmina DArchon - a Breton female mage follower-9839.rar",
      "uploadedUnix": "1329522637",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/628009b7fe41595af105fdc1d97974cda3d39180ff1cfcadccf1161522f19469/analysis/1406691304/",
      "changelogHtml": " Converted to a BAIN-friendly archive with alternate versions: for Selmina with short hair, no clothing, or both. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Selmina%20DArchon%20-%20a%20Breton%20female%20mage%20follower-9839.rar?fid=32851&ttl=1535769727&ri=8192&rs=8192&setec=e9f7e357247a769dea508ec4aec5adcf"
    },
    {
      "fileId": "35900",
      "name": "DArchon Breton mage followers - male and female 131",
      "version": "1.31",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1529",
      "fileName": "DArchon Breton mage followers - male and female 131-9839.rar",
      "uploadedUnix": "1330028672",
      "modVersion": "1.31",
      "virusScanUrl": "https://www.virustotal.com/file/10be76b4c87b4121a4c87ca79492cff4710cdcb9233d59744b21c9ac1c2df7a3/analysis/1406708415/",
      "changelogHtml": " Fixed a minor oversight I made, where Jacil adopted Selmina\\'s name. Oops, Sorry! Nothing else has changed, so no worries on upgrading. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DArchon%20Breton%20mage%20followers%20-%20male%20and%20female%20131-9839.rar?fid=35900&ttl=1535769727&ri=8192&rs=8192&setec=c3f3de11ee524e66767f1ffc0c6c4bf9"
    },
    {
      "fileId": "35928",
      "name": "DArchon Followers EXPERIMENTAL fix for Skyrim dark faces bug",
      "version": "0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "36",
      "fileName": "DArchon Followers EXPERIMENTAL fix for Skyrim dark faces bug-9839.rar",
      "uploadedUnix": "1330031967",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/454eb364d2890a90f66ebe471cae73ab07be2f098618a7069d47b2d3225159f0/analysis/1406708602/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DArchon%20Followers%20EXPERIMENTAL%20fix%20for%20Skyrim%20dark%20faces%20bug-9839.rar?fid=35928&ttl=1535769728&ri=8192&rs=8192&setec=a69fd98125f4cfdb7d7fc8fa72d29019"
    },
    {
      "fileId": "36363",
      "name": "DArchon Breton mage followers - male and female 132",
      "version": "1.32",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1529",
      "fileName": "DArchon Breton mage followers - male and female 132-9839.rar",
      "uploadedUnix": "1330121247",
      "modVersion": "1.32",
      "virusScanUrl": "https://www.virustotal.com/file/1046bcdd28273afae852d9e5b6bc2894b8ab9fefc1e73313879fd0545ed65c23/analysis/1406710927/",
      "changelogHtml": " Modified Jacil to be a necromancer instead of an elemental mage (Selmina already is an elemental mage, so this was done to add a little variety). They are otherwise the same in abilities. <br/> \n Made both NPCs not affect the stealth meter when the player is sneaking. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DArchon%20Breton%20mage%20followers%20-%20male%20and%20female%20132-9839.rar?fid=36363&ttl=1535769729&ri=8192&rs=8192&setec=6a9e14ba63feb58cc835ed52d05d8793"
    },
    {
      "fileId": "36544",
      "name": "Selmina DArchon - alternate with darker hair",
      "version": "1.32",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "Selmina DArchon - alternate with darker hair-9839.rar",
      "uploadedUnix": "1330150847",
      "modVersion": "1.32",
      "virusScanUrl": "https://www.virustotal.com/file/7c17ccd02d581757e886c90258b7d8f685b971e347a3f0e540974122714b0e04/analysis/1406711871/",
      "changelogHtml": " Modified Jacil to be a necromancer instead of an elemental mage (Selmina already is an elemental mage, so this was done to add a little variety). They are otherwise the same in abilities. <br/> \n Made both NPCs not affect the stealth meter when the player is sneaking. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Selmina%20DArchon%20-%20alternate%20with%20darker%20hair-9839.rar?fid=36544&ttl=1535769729&ri=8192&rs=8192&setec=b008ea90152fcdfe7a131e61a9877321"
    },
    {
      "fileId": "50693",
      "name": "DArchon Breton mage followers - male and female 133",
      "version": "1.33",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1728",
      "fileName": "DArchon Breton mage followers - male and female 133-9839-1-33.rar",
      "uploadedUnix": "1333736971",
      "modVersion": "1.33",
      "virusScanUrl": "https://www.virustotal.com/file/0bb25e5794d2d8c5ec9b1f77ccff054aac0286d2cb78e643f20f1f074def46f7/analysis/1406800948/",
      "changelogHtml": " Updated the mod with the new changes from the Creation Kit update. Hopefully, this will solve the problem with the dark/gray faces. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DArchon%20Breton%20mage%20followers%20-%20male%20and%20female%20133-9839-1-33.rar?fid=50693&ttl=1535769730&ri=8192&rs=8192&setec=276faa2910663a80d33db3eaf1d9a6ee"
    }
  ]
}