{
  "modId": 9844.0,
  "modName": "Ring of Hircine - No Disease Werewolf AND Totem Selection",
  "summary": "Modifies the ring of hircine so that it grants the power of Beast Form whatever or not you actualy have the werewolf disease and adds a menu to chose your howl while in beast form.",
  "descriptionHtml": "Description:\r\n-----------------\r\nModifies the ring of hircine so that it grants the power of Beast Form whatever or not you actualy have the werewolf disease with the optional Totem selection menu on equip.\r\n\r\nFully compatible with werewolfs gameplay changing mods!\r\n\r\nVersion Choices: \r\n-----------------------\r\n\r\n(Chose only one!)\r\nRing Of Hircine - No Disease and Totems -> normal mod, let\\'s you chose the werewolf Totem you want.\r\n\r\nRing Of Hircine - No Disease and Totems - NoEquipeSlot -> same as above, but once transformation ends you remain with the ring equipped and can equip other rings (as of the way the script works if you have the werewolf disease, you will still need to unequippe and equip the ring after transformations so the Beast Form power ignores the daily usage limit)\r\n\r\n\r\nREQUIRES SKYRIM 1.6 MINIMUM!\r\n\r\nWhat it does:\r\n------------------\r\n-Allows to be vampire and werewolf at the same time, as long as you transform with the ring (transformations do not remove vampirism, as what does that in game is the werewolf disease witch is not used!) *A new bug was found that makes your character lose your head if she is a vampire, if it affects your vampire character the only solution is using the \\\"showracemenu\\\" command, more detail in the SPECIAL NOTES section*\r\n-To transform simply equipe the ring, and use the \\\"Beast Form\\\" power.\r\n-Does not grant unlimited time as a werewolf, you still need to feed.\r\n-Transform how many times you want, simply equipe the ring again.\r\n-Intruduces a new howl called \\\"Adrenaline\\\", it functions the same as the slow time shout, only beeing the werewolf version.\r\n-Optional Totem selection menu.\r\n-This mod does not change any quest or gamplay, it simply changes the ring\\'s script.\r\n\r\nHow to use:\r\n--------------\r\n\r\nSimply get the ring from the quest as normal, but once you use it, one of two things will happen if you are a true werewolf, it will act as the normal ring, just as if there was no mod.\r\nIf you are not a werewolf then it gets good, for as long as the ring is equiped, the ability to transform into a werewolf is available (under the power section, named Beast Form).\r\n\r\n\\\"Well it\\'s all nice and good, but why remove the old file! I liked it fine without totem selection! Plus I hate that menu, it does not fit my imersion requirements!\\\" you might say, and to that fine sir, I tell you, so shall be your will!\r\n\r\nIf you don\\'t like the totem selection menu for whatever reason it might be, simply change the \\\"RoHconfig\\\" variable, how? easy, in the console type:\r\n\\\"set RoHconfig to 1\\\" and the menu will disapear, the ring will simply add and remove the \\\"Beast Form\\\" power as was before.\r\n\\\"set RoHconfig to 0\\\" and the menu will be back! (This is the default)\r\n\r\nUpdating:\r\n-------------\r\nIf you don\\'t have the ring, simply update the file, otherwise:\r\n-Get rid of the ring you have.\r\n- Add the ring via console \\\"player.additem 0002AC60 1\\\"\r\nThis will give you a ring with the updated script.\r\n\r\nSPECIAL NOTES:\r\n---------------------\r\n-> Vampire Bug:\r\n\r\nIf you are afflicted by bug mentioned read all of this!\r\n\r\nI myself hate this solution it is cheep and bound to get you into more trouble if you do more than the following, and NEVER leave the new race, always go back to the one you chose in the start of the game, never change gender, or retype a new name! that will set your skill progress to ZERO a big ZERO!\r\nIf you don\\'t feel comfortable with this and are afflicted by the bug, and still want to be a vampire/werewolf, find another mod, and I am not demanding, I\\'m advising you to do so!\r\n\r\n\\\"Solution\\\":\r\n-Type \\\"showracemenu\\\" on the console\r\n-Chose another race and then your\\'s back again\r\n-Chose the hair style\r\n-Finish and input your characters name again",
  "categoryId": "24",
  "version": "1.6",
  "author": "Gutyiort",
  "createdUnix": "1329345248",
  "updatedUnix": "1350844309",
  "containsAdultContent": false,
  "uploadedBy": "Gutyiort",
  "primaryFile": null,
  "files": [
    {
      "fileId": "86690",
      "name": "Ring Of Hircine - No Disease and Totems",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Ring Of Hircine - No Disease and Totems-9844-1-6.rar",
      "uploadedUnix": "1346887938",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/543bbdf2ba583d161958003a8c899870c03face0b5f0cfe99164e51ac7711cc8/analysis/1407148086/",
      "changelogHtml": " Added optional configuration of Totem Selection <br/> \n Refined Script in general, making it fully compatible in theory <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ring%20Of%20Hircine%20-%20No%20Disease%20and%20Totems-9844-1-6.rar?fid=86690&ttl=1535769741&ri=8192&rs=8192&setec=349c8addbea112947f9e682506405edc"
    },
    {
      "fileId": "86691",
      "name": "Ring Of Hircine - No Disease and Totems - NoEquipeSlot",
      "version": "1.6",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Ring Of Hircine - No Disease and Totems - NoEquipeSlot-9844-1-6.zip",
      "uploadedUnix": "1346887966",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/ebfe31c6e4fda4fed0390beced8a94c23d9d6dc947cc822f81306488f0b68a91/analysis/1407148147/",
      "changelogHtml": " Added optional configuration of Totem Selection <br/> \n Refined Script in general, making it fully compatible in theory <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ring%20Of%20Hircine%20-%20No%20Disease%20and%20Totems%20-%20NoEquipeSlot-9844-1-6.zip?fid=86691&ttl=1535769741&ri=8192&rs=8192&setec=e22b74577b0cf40128b5c7aea9615a78"
    },
    {
      "fileId": "95035",
      "name": "Ring Of Hircine - No Disease and Totems - FIX",
      "version": "1.7b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Ring Of Hircine - No Disease and Totems - FIX-9844-1-7b.zip",
      "uploadedUnix": "1350844309",
      "modVersion": "1.7b",
      "virusScanUrl": "https://www.virustotal.com/file/7f9c882bbce70aad71b336778816476191ddc880a5b821cff9f4e0ce3cc089b6/analysis/1407231313/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ring%20Of%20Hircine%20-%20No%20Disease%20and%20Totems%20-%20FIX-9844-1-7b.zip?fid=95035&ttl=1535769741&ri=8192&rs=8192&setec=409a21660ef21bf8519781fae55a62fb"
    }
  ]
}