{
  "modId": 9857.0,
  "modName": "Skyrim Scaling Stopper",
  "summary": "This mod is a leveled list overhaul to make it so weapons and armor of higher quality than steel are rare, treasure is not leveled, and most enemies aren\\'t leveled.",
  "descriptionHtml": "[center]\r\n[img]http://static.skyrim.nexusmods.com/images/1139939-1347925385.jpg[/img]\r\n[/center]\r\n[color=#FFFACD]\r\n[size=5]MOD SUMMARY:[/size][/color]\r\n\r\n\t   This mod is a leveled list overhaul to make it so weapons and armor of higher quality than steel are rare, treasure is not leveled, and most enemies are not leveled.\r\n\r\n           Secondary aim:  By using optional patches, this mod allows you to use some popular mods that add new content along with the Skyrim Scaling Stopper system so that the new material has level scaling removed, and so the conflicts with the other mods in the system are resolved.  All these mods can be used together without suffering conflicts, having some of their content get lost, or having to carefully build a bashed patch.\r\n\r\n\r\n[color=#F5DEB3][size=5]THE PROBLEM:[/size][/color]\r\n\r\n\t   I think that leveling is pretty lame.  Why should the whole world revolve around you?  I have this trouble with suspension of disbelief.  I look at something that is ridiculous for awhile and put up with it, but then the point comes where I cry out, \\\"The emperor has no clothes!\\\"\r\n\r\n\t   Think about this:  When you start a new character, you fight a lot of wolves and skeevers.  The bandits all have iron and steel weapons.  The shopkeepers will sell you iron ingots.  But you keep on playing and the world starts getting weird.  Wolves and skeevers are going extinct and there is this plague of cave bears on the land.  The bandits suddenly have all these really awesome weapons made of valuable materials.  The merchants are trying to sell you ebony ingots \r\ninstead of iron.  Lame! Lame! Lame!\r\n\r\n\t   I want a more static world.  I want leveling up to be meaningful.  In vanilla Skyrim,you can actually become weaker in battle and have a harder time surviving as you level up.  This happens if you use your perks on non-combat skills such as alchemy or blacksmithing.  (Especially if we are talking about skills like speech and lockpicking.)  I want there to be an incentive to level up.  Some players purposely do not level up because they can find situations in which they are more powerful when they are lower level and weaker.  (Being more powerful when you are weaker?  something is seriously wrong with this picture!)\r\n\r\n\r\n[color=#F5DEB3][size=5]THE SOLUTION:[/size][/color]\r\n\r\n\t   Stop the level scaling!  \r\n\r\n\t   Edit the frequency of occurrence of various enemies, weapons, armors, loot items, and vendor goods.  Anything can spawn at any time, but certain things need to be rarer than others.\r\n\r\n[center]\r\n[img]http://imageshack.us/a/img191/9500/skyrimmonstermod.jpg[/img]\r\nSupported mod:  [url=http://skyrim.nexusmods.com/mods/9694]Skyrim Monster Mod[/url]\r\n[/center]\r\n\t\r\n[color=#F5DEB3][size=5]LEVELS OF ENEMIES:  [/size][/color]\r\n\r\n\t   So with this overhaul, the world around you remains constant.(But very erratic and highly variable.)  You start out pathetically weak, and gradually become a mighty hero that fears nothing and can kill anything.  You have a very strong incentive to level up, because you don\\'t want to be dying all the time.\r\n\r\n\t   The leveled lists are not leveled.  Everything on a list spawns at level 1 or higher.  The leveled lists were adjusted to be more like the bell curve.  There are a few wimpy enemies, and a few extremely powerful enemies, but most of them are in the middle of the range.\r\n\r\n\t   The actor mix is always the same. Both weak and strong variants of the different enemies will spawn all throughout the career of your character.\r\n\r\n\t   Bosses are generally set to be at the high half of the range.  Like instead of being level 1-45 with an average of 15-20 they might be level 18-45 with an average of 18-20. \r\n\r\n\t   This makes a more realistic and believable world.  But it ends up being a very deadly world.  The game is really hard at low levels.  You have to be very cautious, and you spend a lot of time fleeing, sneaking, sniping, and looking into the distance trying to see enemies before they see you.  It kind of gets the adrenaline flowing when you know that the next enemy you meet might possibly be 45 levels higher than you.\r\n\r\nThe world is currently split up into three difficulty zones:\r\n\r\n\r\n[color=#98FB98](1) EASY DUNGEONS:[/color]  Eight easy dungeons near Whiterun. Enemies level 1-10 only.\r\n\r\n\tThese are the dungeons closest to Whiterun.  The enemies in those dungeons are more often level 1-10, rather than the normal level 15-20 with a 3% chance of meeting a level 21+ enemy.  The explanation lore for why these dungeons are easier than the others is that the Whiterun guards do a better job of maintaining order and protecting the people than do the guards in other holds.  The enemies in range of the Whiterun guard tend to get killed or incarcerated before they have time to level up a whole bunch of levels and become really frightening.  If you are having trouble leveling up, you might go visit these dungeons:\r\n\r\n[color=#DDA0DD]White River Watch\r\nGraywinter Watch\r\nShimmermist Cave\r\nBleak Falls Barrow\r\nHalted Stream Camp\r\nSilent Moons Camp\r\nRedoran\\'s Retreat\r\nFort Graymoor[/color]\r\n\r\n\r\n[color=#98FB98](2) EASY PAVED ROADS: [/color]All the paved roads in Skyrim. Enemies level 1-20 except dragons.\r\n\r\n\tThe mod changes the spawnpoints on the roads to only spawn average enemies and not the toughest ones.  When traveling on a main road, you should not meet any level 21 or higher enemies unless they are dragons.  This makes it safer for lower-level characters to travel, but it is still quite dangerous if they get off the main road or go into a dungeon.\r\n\r\n\r\n[color=#98FB98](3) MAIN ZONE:[/color] Everywhere else. Enemies Level 1-50. Average Level 15-20. 3% Chance Level 21+. \r\n\r\n\tThe average enemy you meet has been carefully set to be level 15-20.  So more than three fourths of the full range enemies you meet are likely to be between level 15 and 20.  (This excludes things like mudcrabs and skeevers which do not have any variants that are as tough as level 15.)  This mod does not usually edit the strength of vanilla Skyrim actors, it just mostly changes how frequently you meet particular ones and may edit their gear.\r\n\r\n\tIn the main zone, the toughest enemies, level 21 and up, have around a 3% chance of being what spawns.  The weakest category of enemies, usually level 1-14, usually have a 10-20% chance of being what spawns.  The medium-strength enemies, usually level 15-20. have around a 77-87% chance of being what spawns.  \r\n\r\n[center]\r\n[img]http://imageshack.us/a/img18/3590/deadlydragons.jpg[/img]\r\nSupported mod:  [url=http://skyrim.nexusmods.com/mods/3829]Deadly Dragons[/url]\r\n[/center]\r\n\r\n[color=#F5DEB3][size=5]SUMMARY OF HOW ENEMY DISTRIBUTION EFFECTS GAMEPLAY:\t [/size][/color]\r\n\r\n\t   So when you are playing this mod, you can meet all the possible strengths of the enemies included in the game when you are at any level.  The enemies you meet will usually be level 15-20.  You will meet wimpy things like skeevers and mudcrabs.  You will also meet horrible hard things such \tas level 36 Dwemer centurions, level 44 Falmer, level 46 warlocks, and level 50 dragons.  But the very toughest enemies can spawn no more frequently than around 3% of the time, or once for every 33 enemies you meet. (And many of the tough enemies are somewhere between average and the very toughest, and are not the very toughest.)\r\n\r\nAn example with one type of enemy:\r\n\r\n[color=#AFEEEE]20%  LV 1-14   Wimpy          \r\n77%  LV 15-20  Average               \r\n3%   LV 21-50  Tough  [/color]  \r\n\r\n[center]\r\n[img]http://imageshack.us/a/img255/4431/weaponsk.jpg[/img]\r\nSupported mods:  [url=http://skyrim.nexusmods.com/mods/1002]JaySuS Swords[/url], [url=http://skyrim.nexusmods.com/mods/10902]Weapon Variants Expansion[/url],  [url=http://skyrim.nexusmods.com/mods/17250]Regent Armory[/url], [url=http://skyrim.nexusmods.com/mods/3871]Weapons of the Third Era[/url], [url=http://skyrim.nexusmods.com/mods/21120]Heavy Armory - New Weapons[/url] \r\n[/center]\r\n\r\n[color=#F5DEB3][size=5]LEVEL OF ENEMY WEAPONS AND ARMOR:  [/size][/color]\r\n\r\n\t   NPCs always carry the same mix of gear.  They usually just have things made of iron, steel, hide, and leather.  Gear made of better materials is rare.  But the removal of leveling also makes it so that rare items are potentially more common early in the game.  The best items are carried by bosses, placed as clutter by vanilla Skyrim, or found in treasure chests in dungeons.  You could potentially find a daedric weapon at level 1, but this is offset by the fact that you encounter level 36 enemies fairly often, and you would have to look very hard for a very long time to collect a complete suit of Orcish armor.\r\n\r\n\t   If you want really good gear, maybe you should take up blacksmithing.\r\n\r\n\r\n[center]\r\n[img]http://imageshack.us/a/img18/7572/cloaksofskyrimwinterisc.jpg[/img]\r\nSupported mods:  [url=http://skyrim.nexusmods.com/mods/12092]Cloaks of Skyrim[/url], [url=http://skyrim.nexusmods.com/mods/13486]Winter is Coming - Cloaks[/url] \r\n[/center]\r\n\r\n[color=#F5DEB3][size=5]LEVEL OF LOOT OTHER THAN WEAPONS AND ARMOR:  [/size][/color]\r\n\r\n\t   Loot is always the same mix of stuff.  It is pretty much the full range of loot from highly valuable to practically worthless.  Not like in the base game where you find crumby loot at the beginning of the game and awesome loot when you are level 30.  You could make a lot of gold early on if you venture into a dungeon and survive and find some good items.  Likewise, you could be disappointed by the cheapness of the junky loot you find in a dungeon when you are a mighty hero.  It is all a matter of chance.  But it is more realistic than playing along and noticing that the loot just keeps getting better and better the more powerful you become.  Even if you visit the same dungeon twice!\r\n\r\n\r\n[center]\r\n[img]http://imageshack.us/a/img341/6963/bandolierbagsandpouches.jpg[/img]\r\nSupported mod:  [url=http://skyrim.nexusmods.com/mods/16438]Bandolier - Bags and Pouches[/url]\r\n[/center]\r\n\r\n[color=#F5DEB3][size=5]LEVEL OF GOODS THAT MERCHANTS SELL:  [/size][/color]\r\n\r\n\t   The merchants always sell the same mix of stuff, no matter what level you are at.  It is pretty much the full range of merchandise from very good to hardly worth carrying on an adventure with you.  \r\n\r\n\t   Merchants sell mostly iron, steel, hide, and leather armor.  But this includes, on a random basis, very nice leather and steel gear such as scale armor or full steel plate.  Enchanted armor pieces of rare materials spawn in vendor inventories frequently enough that vendors often have one or two for sale.\r\n\r\n  \t   The weapons that are available for sale are mostly made of iron and steel.  Enchanted weapons made of materials better than steel appear in merchant inventories often enough that there is usually one on hand.\r\n\r\n\t   Merchants generally have iron and steel arrows for sale.  You will have to find better ones as loot if you want them.\r\n\r\n\t   Merchants carry the full range of potions, scrolls, and soul gems, both filled and unfilled.  So the really weak potions and scrolls are always available just as the really strong ones are.  Filled soul gems are fairly common because warrior characters ought to be able use enchanted weapons too, even if they don\\'t have the skill to cast Soul Trap.\r\n\r\n\t   The full range of spell books is always available on a random basis.  You can even buy spell books for spells that your character is not smart enough to cast yet.  Be careful not to waste your gold buying things you can\\'t use.\r\n\r\n\t   Pretty much the full range of ores and ingots are always available, but the best ones are rather rare.  The type of materials the blacksmiths sell for your crafting is not influenced by what level you are.  It is possible to buy materials that you don\\'t have the skill to make things out of.  \r\n\r\n[center]\r\n[img]http://imageshack.us/a/img43/6189/immersivearmors.jpg[/img]\r\nSupported mod:  [url=http://skyrim.nexusmods.com/mods/19733]Immersive Armors[/url]\r\n[/center]\r\n\r\n[color=#F5DEB3][size=5]SKYRIM SCALING STOPPER - MISC EDITS.ESP[/size][/color]\r\n\r\n\t   This .esp makes a few edits to things besides leveled lists and does not edit leveled lists.  If you do not want these edits, you can choose not to use this .esp and just use \\\"Skyrim Scaling Stopper.esp\\\" which does nothing but edit leveled lists.\r\n\r\n[color=#F5DEB3]The miscellaneous edits:[/color]\r\n[color=#AFEEEE][List=1]\r\n[*]\\\"Salt Pile\\\" is renamed to \\\"Salt.\\\"\r\n[*]Borders are removed.\r\n[*]\\\"Unusual Gems\\\" are no longer quest items and can be set down.\r\n[*]Riverwood fake love letters are no longer quest items and can be set down if you don\\'t want to do the quest.\r\n[*]Attunement Spheres are no longer quest items and may be set down.\r\n[*]The Curious Silver Mold is no longer a quest item and can be set down.\r\n[*]The book \\\"King Olaf\\'s Verse\\\" is no longer a quest item and may be set down if you don\\'t want to be a bard.\r\n[*]Sinderion\\'s Field Journal is no longer a quest item and may be set down if you don\\'t care much forNirn Roots.\r\n[*]Gauldur\\'s Amulet Fragment is no longer a quest item and may be set down.\r\n[*]The book \\\"Uderfrykte\\\" is added to the game.\r\n[*]The book \\\"Nine Commands: Eight Divines\\\" is added to the game.\r\n[*]Some dragon claw door keys are no longer quest items and can be set down.  \r\n[/List][/color]\r\n\r\n[color=#F5DEB3][size=5]MODULARITY [/size][/color]\r\n\r\nThis mod is being developed with the idea that different people want to use different mods.  People want new content added to the non-levelscaled system, but they do not necessarily want every bit of it.  Like there might be one particular mod a person hates or one mod that conflicts with their favorite mod.  So the idea is that people should not be forced to accept the entire bundle.  They should be able to pick and choose which types of content to add.  So the base Skyrim Scaling Stopper file does not add any new content.  It just changes leveled lists and things required to make those leveled list changes work.  All the new weapons and armor and monsters and things are added by various patches you can download.  There are many many possible combinations, so many patches have not been built or updated for the newest file version.  At this point it is mainly like you can choose to use a category or not.  Like you can choose to add cloaks and armor or not.  The choices for patches that add certain armor or cloaks and not others are limited.  Keep in mind that if you use little single mod patches within a category such as cloaks and armor, they will probably all conflict and mess each other up.  Within a category, it would be best if you found a patch that includes all the content you want, and excludes content you do not want.  (If that patch exists.)  So if you can\\'t stand one of the mods in a category, you may have to forgo using content from the entire category.  If you want a particular patch made that uses some content and excludes some other, go to the requests thread and make sure that request has been made.  Either make the new request no one has made yet, or vote for the existing request.  If it gets enough votes the patch will be made.  \r\n\r\n\r\n[color=#F5DEB3][size=5]THE CONTINUING DEVELOPMENT OF THE MOD:[/size][/color]\r\n\r\n\t   This mod is still under development.  Compatibility work is being done so that additional mods can be used with Skyrim Scaling Stopper with level scaling removed and with proper addition to the leveled lists.  If you are interested in a particular popular mod being added to this mod system, go to the special discussion thread for requests.  If the suggestion is already there, vote for it and increase the reputation of that comment.  The mods that I do compatibility work for are the ones that get the most votes.  If the suggestion is not already there, make a comment to add the suggestion so that other people can vote for it. \r\n\r\n\t   Feedback is welcome, and your input could change the way this mod is balanced, but keep in mind that this mod is designed to stop level scaling.  So any suggestions wanting me to use level scaling to level things a certain way will be summarily ignored.\r\n\r\n          This mod may look rather complicated to install.  It does not have to be.  You could just install the base file and nothing else if you wanted.  You could even use the version that doesn\\'t require Dawnguard.  You can install as much or as little of this mod system as you want.  There are many detailed load orders listed in the instructions.  You can just find one that has what you want and carefully follow it like a recipe.   \r\n\r\n          This is the sort of mod that needs long slow play-testing under many conditions.  Errors will be fixed as they are found and files will be updated.\r\n\r\n\t   If you are a hardcore Skyrim player who wants the challenge of never knowing what will be around the next corner, and whether or not you are tough enough to face it, this might be a good mod for you. \r\n\r\n[center]\r\n[img]http://imageshack.us/a/img833/783/mecrclassicnordshields.jpg[/img]\r\nSupported mod:  [url=http://skyrim.nexusmods.com/mods/12689]MECR Classic Nord Shields[/url]\r\n[/center]\r\n\r\n\r\n[color=#F5DEB3][size=5]CREDITS:\t[/size][/color]\r\n\r\n[color=#ADD8E6]Dogtown1 for Skyrim Monster Mod:[/color]  http://skyrim.nexusmods.com/mods/9694\t\t       \r\n\t\t\t[list][*]\\\"StarX\\\" for draugr, falmer, giants, trolls, durzog\r\n\t\t\t[*]digital lion for the fatalis texture, the drake, Ice Naga, and revnant\r\n\t\t\t[*]chocolambot for a hagraven texture\r\n\t\t\t[*]killer keos for the ebony mesh\r\n\t\t\t[*]muppetpuppet for a very sexy tiger and hyena texture, and raptor and therium mesh and tex\r\n\t\t\t[*]Mr. Siika for the durzog, minotaur head and hooves, triceratops mesh and baby mammoth\r\n\t\t\t[*]and thanks to Ghogiel for the triceratops texture\r\n\t\t\t[*]Alexander Wolf for the demon wing mesh\r\n\t\t\t[*]GSC Game World for the stalker stuff\r\n\t\t\t[*]CDProjeckt for the amazing witcher mesh and textures\r\n\t\t\t[*]mdogger for the guar\r\n\t\t\t[*]mdogger and grimdeath for the hunger\r\n\t\t\t[*]cryonaut for werecroc mesh and tex\r\n\t\t\t[*]artifex0 for snow devil torso mesh and tex\r\n\t\t\t[*]newermind43 for brown werecat texture and ripper sword\r\n\t\t\t[*]big thanks to Th3w1ck3d1 for the help[/list]\r\n\r\n[color=#ADD8E6]Jackstarr for Skyrim Monster Mod Replacers - Lore Friendly and Others:[/color]   http://skyrim.nexusmods.com/mods/16411\r\n\t\t\t[list][*]Nothing from his .esps were used, but many of the edits listed in his change log were entered into the CK from scratch for this mod.[/list]\r\n\r\n[color=#ADD8E6]JaySuS for JaySuS Swords: [/color] http://skyrim.nexusmods.com/mods/1002\r\n\t\t\t[list][*]The Nifskope team for their outstanding work without which there would be no new mods with models for Bethesda games\r\n\t\t\t[*]Ghogiel for a tiny tip that saved my day\r\n\t\t\t[*]Dave Humphrey for SkyEdit (take that Bethesda and your \\\"we will release a CK soon\\\" ...talk... :P lazy bunch)\r\n\t\t\t[*]Timeslip for TESSNip and BSABrowser\r\n\t\t\t[*]Dave Humphrey for SkyEdit\r\n\t\t\t[*]La Confrérie des Traducteurs et Corax pour la traduction francaise\r\n\t\t\t[*]DarkRuler 2500 for the german translation\r\n\t\t\t[*]Aohige for the japanese translation\r\n\t\t\t[*]Shadowjin for \\\"Dovah Luv\\'s\\\" name\r\n\t\t\t[*]Mister M for lending me his dragon figurines\r\n\t\t\t[*]AurianaValoria1 for \\\"Blade Of Dibella\\'s\\\" name\r\n\t\t\t[*]The Outlander for his outstanding user-tech-support and troubleshooting assistance[/list]\r\n\r\n[color=#ADD8E6]MECR for MECR Classic Nord Shields [/color]  http://skyrim.nexusmods.com/mods/12689\r\n\t\t\t[list][*]The TESA School for hosting InsanitySorrow\\'s texturing classes. \r\n\t\t\t[*]BlueMoth for some insight and nice ideas \r\n\t\t\t[*]JonoPhoenix for the idea of making the shields collectables.\r\n\t\t\t[*]The NifSkope programmers.\r\n\t\t\t[*]Blender, the \\'Blender 3D: Noob to Pro\\' wikibook on en.wikibooks.org and the Blender \r\n\t\t\t[*]NIF Import - Export Tutorial by Jen and 2pac4eva7.[/list]\r\n\r\n[color=#ADD8E6]hothtrooper44 – Immersive Armors[/color]   http://skyrim.nexusmods.com/mods/19733\r\n\t\t\t[list][*]Rahman530 - the armors that came from the “Lore Friendly Armor Pack”  http://skyrim.nexusmods.com/mods/6684\t\t\r\n\t\t\t[*]Omesean - Einherjar Armor\r\n\t\t\t[*]Northborn - Fur Hoods HD\r\n\t\t\t[*]GuitunScarfin - Apotheus Light Armor\r\n\t\t\t[*]frankdema - Nordic Hunter Light Armor\r\n\t\t\t[*]lumps - Heroic Stormcloak Armor\r\n\t\t\t[*]Telthalion - Witchplate Armor\r\n\t\t\t[*]exeter - mesh alterations to support the UNP body mesh\r\n\t\t\t[*]Oogee - teaching me about guard\\'s armor dialogues\t\r\n\t\t\t[*]Parts of these armor\\'s meshes and textures are owned and copyrighted by CD Projekt and used here with permission. The Witcher is a trademark of CD Projekt. All rights reserved.   http://www.cdprojekt.com/ \r\n\t\t\t[*]Special thanks to Stenar1000, Omesean, 83Willow, spearrx and many others in the Nexus community for their help and inspiration.\r\n\t\t\t[*]All the encouraging users of my mods – you are the reason I keep going, thanks![/list]\r\n\r\n[color=#ADD8E6]747823 for Weapons of the Third Era[/color]   http://skyrim.nexusmods.com/mods/3871\r\n\t\t\r\n[color=#ADD8E6]PrivateEye for Shortswords for Skyrim[/color]   http://skyrim.nexusmods.com/mods/18585 and\r\n\t          [list][*]Heavy Armory - New Weapons  http://skyrim.nexusmods.com/mods/21120[/list]\r\n\r\n[color=#ADD8E6]Noodles for Cloaks of Skyrim [/color]  http://skyrim.nexusmods.com/mods/12092\r\n\t\t\t[list][*]Backsteppo and Zenl for creating the excellent cloak/cape meshes.\r\n\t\t\t[*]Hemingwey for permissions to use and play around with his excellent textures.[/list]\r\n\r\n[color=#ADD8E6]Is This Display Name Taken for Weapon Variants Expansion[/color]    http://skyrim.nexusmods.com/mods/10902\r\n\r\n[color=#ADD8E6]3JIou for Deadly Dragons[/color]   http://skyrim.nexusmods.com/mods/3829\t\t\t\r\n\t\t\t[list][*]Dragon textures: Luddermann (Swamp, Storm, Wyrm, Nether and Aspect of Alduin dragons) \r\n\t\t\t[*]DigitalLion (Black dragon, Dracolich, and Bone dragon)\r\n\t\t\t[*]Description: I2edShift & xaturas\r\n\t\t\t[*]Readme: I2edShift\r\n\t\t\t[*]Deadly Dragons logo: SilversParlor[/list]\r\n\r\n[color=#ADD8E6]Nivea for Winter is Coming - Cloaks[/color]  http://skyrim.nexusmods.com/mods/13486\r\n\r\n[color=#ADD8E6]Kjell Granlund for Addons Textures - Dragons[/color]  http://skyrim.nexusmods.com/mods/6120\r\n\r\n[color=#ADD8E6]backstept for Regent Armory[/color]   http://skyrim.nexusmods.com/mods/17250\r\n\r\n[color=#ADD8E6]Teh-Husky for Morrowind Armor for Skyrim[/color]   http://skyrim.nexusmods.com/mods/22793\r\n\t\t\t[list][*] Iceburg - falmer armor mesh from Skyrim Modesty Mod\r\n\t\t\t[*] Lautasantenni - stalhrim greatsword & sword scabbards\r\n\t\t\t[*] Devils86 - stalhrim dagger model & textures\r\n\t\t\t[*] PrivateEye - stalhrim mace model & textures\r\n\t\t\t[*] Bingles - glass spike models\r\n\t\t\t[*]Pandapaw - bonemold & dreugh skinning[/list]\r\n\r\n[color=#ADD8E6]DJjojo for Crossbows Basic Collection[/color]   http://skyrim.nexusmods.com/mods/23876\r\n\r\n[color=#ADD8E6]ciedeeh for Crossbows Revamped[/color]   http://skyrim.nexusmods.com/mods/21666\r\n\r\n[color=#ADD8E6]Howiego08 for Better Bows[/color]   http://skyrim.nexusmods.com/mods/13317\r\n\r\n[color=#ADD8E6]KearSage for Staves of Skyrim[/color]   http://skyrim.nexusmods.com/mods/22691\r\n\r\n[color=#ADD8E6]Bethesda for making Skyrim in an open format anyone can mod.[/color]\r\n\r\n\t\t\r\n[color=#F5DEB3][size=5]COPY STATUS: [/size]  [/color] \r\n\r\nYou may not distribute any part of this mod without getting proper permission first.  Many of the assets that this mod depends on have protected status and the authors do not allow distribution without permission.\r\n\r\n\r\n[color=#F5DEB3][size=5]INSTALLATION INSTRUCTIONS AND OTHER INFORMATION:[/size][/color]\r\n\r\nClick on the icon to view the readme file for Skyrim Scaling Stopper.  It has installation instructions, load orders, details about more topics, the most current information,  explanations of differences between the main file number series such as 5_X and 1_8_X, known issues, change log, and compatibility information.  Readme files are also included with all Skyrim Scaling Stopper files that are downloaded.",
  "categoryId": "79",
  "version": "5.10",
  "author": "David Brasher",
  "createdUnix": "1329351897",
  "updatedUnix": "1352263734",
  "containsAdultContent": false,
  "uploadedBy": "David Brasher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "70903",
      "name": "SSS Men Not Usually Warlike Patch 1_0",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1128",
      "fileName": "SSS Men Not Usually Warlike Patch 1_0-9857-1-0.7z",
      "uploadedUnix": "1340935063",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/feb1bb698a6b59cbd9c15ea30a15b1ff08511f1e1ab0d64da52a97581ba11bf8/analysis/1406989332/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20Men%20Not%20Usually%20Warlike%20Patch%201_0-9857-1-0.7z?fid=70903&ttl=1535769758&ri=8192&rs=8192&setec=77fa068db4efee2dd8b4b0fb4b76f54a"
    },
    {
      "fileId": "70904",
      "name": "SSS Women Not Usually Warlike Patch 1_0",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "7",
      "fileName": "SSS Women Not Usually Warlike Patch 1_0-9857-1-0.7z",
      "uploadedUnix": "1340935166",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/18d184f02d2407a3618a8cb7b12f4bb05f397d7674a457cc694323edb54b0655/analysis/1406989332/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20Women%20Not%20Usually%20Warlike%20Patch%201_0-9857-1-0.7z?fid=70904&ttl=1535769758&ri=8192&rs=8192&setec=547c96125f9eca3dbbc79763e0a2d5a4"
    },
    {
      "fileId": "73399",
      "name": "Skyrim Scaling Stopper bsa File Only 3_0",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "84925",
      "fileName": "Skyrim Scaling Stopper bsa File Only 3_0-9857-3-0.7z",
      "uploadedUnix": "1341926835",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/f90620c967d5b05d990211d9b08bf396e8e1bc16f5183af8343e0109b1e6c515/analysis/1407013884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Scaling%20Stopper%20bsa%20File%20Only%203_0-9857-3-0.7z?fid=73399&ttl=1535769759&ri=8192&rs=8192&setec=2831f4d37367f79d251eeb9fe84e8819"
    },
    {
      "fileId": "84063",
      "name": "Skyrim Scaling Stopper OLD 2_X - 3_X - 4_X V1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "784",
      "fileName": "Skyrim Scaling Stopper OLD 2_X - 3_X - 4_X V1_0-9857-1-0.7z",
      "uploadedUnix": "1345869533",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/270c19dbed6efb8f41d04c1b50f27fec17e632598e789c06c2a42f2bd238b3f9/analysis/1407120126/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Scaling%20Stopper%20OLD%202_X%20-%203_X%20-%204_X%20V1_0-9857-1-0.7z?fid=84063&ttl=1535769759&ri=8192&rs=8192&setec=a0a25c06e9372798a37a93b9812d29bc"
    },
    {
      "fileId": "84135",
      "name": "Skyrim Scaling Stopper bsa File Only 4_1",
      "version": "4.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "99776",
      "fileName": "Skyrim Scaling Stopper bsa File Only 4_1-9857-4-1.7z",
      "uploadedUnix": "1345902907",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/d21624c8d9d5ee247b19ab48b955a09511a7f77643063a45cec416c1972e7ca4/analysis/1407120986/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Scaling%20Stopper%20bsa%20File%20Only%204_1-9857-4-1.7z?fid=84135&ttl=1535769760&ri=8192&rs=8192&setec=e17f7994501fc409f98195f050a5d04f"
    },
    {
      "fileId": "85680",
      "name": "SSS Leveling Up Lethargically 1_1",
      "version": "1.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "7",
      "fileName": "SSS Leveling Up Lethargically 1_1-9857-1-1.7z",
      "uploadedUnix": "1346483658",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/82712c7e481c63131a097cf7234eae99fc29d3793ceefbc1b35cddd157b9350b/analysis/1407137283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20Leveling%20Up%20Lethargically%201_1-9857-1-1.7z?fid=85680&ttl=1535769760&ri=8192&rs=8192&setec=30c14f86573394be3089d1875229dc7b"
    },
    {
      "fileId": "88534",
      "name": "SSS Morrowloot Patches 1_0_2",
      "version": "1.0.2",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "251",
      "fileName": "SSS Morrowloot Patches 1_0_2-9857-1-0-2.7z",
      "uploadedUnix": "1347687278",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/c152339db5f821deef9bc3d4886df57e7cc5a9c03d506cbe9aaedcdf281de409/analysis/1407166323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20Morrowloot%20Patches%201_0_2-9857-1-0-2.7z?fid=88534&ttl=1535769760&ri=8192&rs=8192&setec=4e0ce51bcd51f1482dbf99add1f0a08d"
    },
    {
      "fileId": "89458",
      "name": "SSS Bandolier Patches 1_0_1 ",
      "version": "1.0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "227",
      "fileName": "SSS Bandolier Patches 1_0_1 -9857-1-0-1.7z",
      "uploadedUnix": "1348110803",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/6358365f9e254af670a2620a7541fb424b34e8055b75d7ef046e6edc65856cb7/analysis/1407176245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20Bandolier%20Patches%201_0_1%20-9857-1-0-1.7z?fid=89458&ttl=1535769761&ri=8192&rs=8192&setec=ff3978538862cf39a01aeab6a518f90a"
    },
    {
      "fileId": "94879",
      "name": "SSS Skyrim Monster Mod Patches 9_5 ",
      "version": "9.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "524",
      "fileName": "SSS Skyrim Monster Mod Patches 9_5 -9857-9-5.7z",
      "uploadedUnix": "1350775329",
      "modVersion": "9.5",
      "virusScanUrl": "https://www.virustotal.com/file/e694ba5f5d06729f7b68b5159a256ef40f211a5a4ab52c9a9a338fedde7bf3b5/analysis/1407230290/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20Skyrim%20Monster%20Mod%20Patches%209_5%20-9857-9-5.7z?fid=94879&ttl=1535769762&ri=8192&rs=8192&setec=6a2f22df0c152dab0a8ae7e09fa875a9"
    },
    {
      "fileId": "94881",
      "name": "SSS Bows and Crossbows Patch 1_3",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "457",
      "fileName": "SSS Bows and Crossbows Patch 1_3-9857-1-3.7z",
      "uploadedUnix": "1350775462",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/ec4fd22574628004347fa5572a77a382e2a32b898271dfb80cd1b0c42d21f9aa/analysis/1407230291/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20Bows%20and%20Crossbows%20Patch%201_3-9857-1-3.7z?fid=94881&ttl=1535769762&ri=8192&rs=8192&setec=8d88bcef68bbf649998682e7d2bdea46"
    },
    {
      "fileId": "94937",
      "name": "SSS ACE Archery Patches 1_0_B",
      "version": "1.0.B",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "449",
      "fileName": "SSS ACE Archery Patches 1_0_B-9857-1-0-B.7z",
      "uploadedUnix": "1350800500",
      "modVersion": "1.0.B",
      "virusScanUrl": "https://www.virustotal.com/file/b85059c554f91b93ba9e5fcfac1d78c0f27546cfd29efe4cbbb28d41b70f51e6/analysis/1407230663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20ACE%20Archery%20Patches%201_0_B-9857-1-0-B.7z?fid=94937&ttl=1535769763&ri=8192&rs=8192&setec=c288ab4f247ddbce3ec9601e178d1c11"
    },
    {
      "fileId": "96096",
      "name": "Cloaks and Armor Patches 5_4",
      "version": "5.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "701",
      "fileName": "Cloaks and Armor Patches 5_4-9857-5-4.7z",
      "uploadedUnix": "1351364254",
      "modVersion": "5.4",
      "virusScanUrl": "https://www.virustotal.com/file/d99ade972d5d21586711a367dff0f63e1c5679607a553cbfc8b48247326a4778/analysis/1407238206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cloaks%20and%20Armor%20Patches%205_4-9857-5-4.7z?fid=96096&ttl=1535769763&ri=8192&rs=8192&setec=3b72033ba57159a6f94e9bcd84dd6fc3"
    },
    {
      "fileId": "96097",
      "name": "SSS SkyRe Patches 1_3",
      "version": "1.3",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "691",
      "fileName": "SSS SkyRe Patches 1_3-9857-1-3.7z",
      "uploadedUnix": "1351364374",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/e924f3d2a2adc588b291075b4d3653cb5eeda8a197d1143159a808029406d36e/analysis/1407238207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20SkyRe%20Patches%201_3-9857-1-3.7z?fid=96097&ttl=1535769763&ri=8192&rs=8192&setec=475344c6b74e68ebfd948403623020ba"
    },
    {
      "fileId": "96099",
      "name": "Skyrim Scaling Stopper 5_10 and 1_8_4",
      "version": "5.10.1.8.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1036",
      "fileName": "Skyrim Scaling Stopper 5_10 and 1_8_4-9857-5-10-1-8-4.7z",
      "uploadedUnix": "1351364549",
      "modVersion": "5.10.1.8.4",
      "virusScanUrl": "https://www.virustotal.com/file/17149f24765f4f1cb31b4e273ca0dee6a2e29c7e17165028f4b3a933beda6837/analysis/1407238209/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Scaling%20Stopper%205_10%20and%201_8_4-9857-5-10-1-8-4.7z?fid=96099&ttl=1535769764&ri=8192&rs=8192&setec=4e01ffbd240d53fd5fe742359840f369"
    },
    {
      "fileId": "96599",
      "name": "SSS Staves of Skyrim Patches 1_1_B",
      "version": "1.1.B",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2400",
      "fileName": "SSS Staves of Skyrim Patches 1_1_B-9857-1-1-B.7z",
      "uploadedUnix": "1351559771",
      "modVersion": "1.1.B",
      "virusScanUrl": "https://www.virustotal.com/file/5020b7ea73204072c8185024c112315d7deae3407121d00af458530964b19489/analysis/1407241525/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20Staves%20of%20Skyrim%20Patches%201_1_B-9857-1-1-B.7z?fid=96599&ttl=1535769764&ri=8192&rs=8192&setec=2cdc4bfa51af778ec0386b95061ee3a4"
    },
    {
      "fileId": "96601",
      "name": "SSS Weapons and Shields Patches 3_4_1",
      "version": "3.4.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "580",
      "fileName": "SSS Weapons and Shields Patches 3_4_1-9857-3-4-1.7z",
      "uploadedUnix": "1351560061",
      "modVersion": "3.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/5c37beedebb9187cc82a53893c602db745fc6db081dfa4bf988b71f3fd80f3a9/analysis/1407241527/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20Weapons%20and%20Shields%20Patches%203_4_1-9857-3-4-1.7z?fid=96601&ttl=1535769765&ri=8192&rs=8192&setec=02e404eed0355d581e1769a624943770"
    },
    {
      "fileId": "97881",
      "name": "SSS Deadly Dragons Patches 1_3",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "770",
      "fileName": "SSS Deadly Dragons Patches 1_3-9857-1-3.7z",
      "uploadedUnix": "1352263734",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/2ca1163558b0668b52430ea28df0b539771efdc0a6e7e4e27a3b011a003d4a43/analysis/1407252723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSS%20Deadly%20Dragons%20Patches%201_3-9857-1-3.7z?fid=97881&ttl=1535769765&ri=8192&rs=8192&setec=2b594162d6592ee2ea3a9c574eb5701c"
    }
  ]
}