{
  "modId": 9869.0,
  "modName": "Ancient Guardian Summons",
  "summary": "Adds 3 summon-able guardians to the game as thralls or 1 min summons.",
  "descriptionHtml": "Dreighton\\'s\r\nAncient Guardian Summons\r\n\r\nAn elven mage trying to summon an elder race back into being happened on a few very powerful summons. This mod allows you to summon 3 ancient Ebony-clad guardians to fight for you. It also adds an un-summon spell for out-of combat summons.\r\n\r\nThis is a Simple mod that adds 6 spells for conjurers in the game. All summons are tested and act differently in battle, but together are suitable for any situation. They are balanced, and do not leave ashes or goo piles to clutter your saves when killed/un-summoned. They have Ehlnofey names for immersion, but ingame descriptions specify which is which till you get used to reading a little Ehlnofex. For those wishing to play a support role in combat, these summons can be healed with healing spells in combat.\r\n\r\nThe 3 Guardians are below;\r\n\r\nBuro Av Agea - \\\"Vassal of Wisdom\\\"\r\nA powerful battlemage that fights with accurate ranged shock spells and a Powerful shock-enchanted Mace. This guardian is not as tough as the other two, but can deal great damage at range or melee.\r\n\r\nBuro Av Altadoon - \\\"Vassal of Weapons\\\"\r\nA flurry of blades on the field this lithe guardian fights with twin Enchanted Axes. A great combination of damage and defense this vassal sits between the others in health.\r\n\r\nBuro Av Vvarden - \\\"Vassal of The Strong Shield\\\"\r\nThis Guardian will outlast others on the field. Unable to match the damage of the other two, this valiant defender can shrug off magical or physical attacks with relative ease.\r\n\r\nAll guardian vassals are available as standard 1 minute summons (lvl 75 conj ~350 Magicka), or as thralls (lvl 100 Conjuration, 400 Magicka, 3 sec cast time).\r\n\r\nThey are about at strong as Dremora lords, and cost the same to summon.\r\n\r\nFind the tomes in Drelas Cottage (see screen for location of the cottage) in a safe under the stairs. Tested with Drelas Cottage home mod and it works, adding the safe as secure storage. A journal is included with a cliché little story to make things seem more authentic.\r\n\r\nAll Credits go to me, Dreighton, as well as Bethesda, for the game and CK.",
  "categoryId": "75",
  "version": "1.0",
  "author": "Dreighton",
  "createdUnix": "1329356177",
  "updatedUnix": "1329361812",
  "containsAdultContent": false,
  "uploadedBy": "Dreighton",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31876",
      "name": "Ancient Guardian Summons",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Ancient Guardian Summons-9869-1-1.zip",
      "uploadedUnix": "1329361812",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4cb51ce0916a475e63056125f8069c85f070be82c55ee00e5703faebf52eabc0/analysis/1406686290/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ancient%20Guardian%20Summons-9869-1-1.zip?fid=31876&ttl=1535769790&ri=8192&rs=8192&setec=6b2dfd05e28a66c8e10606096f1bd85d"
    }
  ]
}