{
  "modId": 9885.0,
  "modName": "Better Honeyside",
  "summary": "This mod changes the player home in Riften, Honeyside.\r\n",
  "descriptionHtml": "When playing my thief in Skyrim I fell in love with the player home in Riften, Honeyside. There were a few things that bothered me about the home though. The biggest being that outside the home in Riften there is open space below the door, yet inside below the entrance there is the enchanting area that couldn\\'t fit there.\r\n\r\nSo the mod started out as a fix for that and a way for me to get a feel for the new CK. As I made it I thought of more things I would like to change so it became a mod that alters nearly everything in Honeyside. The exterior is not altered.\r\n\r\nThere aren\\'t any weapon racks, bookcases or mannequins added. Sorry this seems to be the cause of all the crashing problems with the new version so I had to remove them.\r\n\r\nThe location of almost every room has changed, but the upgrades function as normal and you will still need to buy them. The decorating guide in game hasn\\'t been altered.\r\n\r\nAlchemy Lab is now the Enchanting and new additional Smithing room.\r\nKitchen is now the Alchemy Lab.\r\nMaster bedroom is now the Kitchen.\r\nThe Master bedroom is in a new location.\r\nEnchanting room is now the Bathroom. (Upgraded with bed room.)\r\nThe Guest bedroom is in the same location. (Upgrades when you become Thane of Riften.)\r\n\r\nAll the added containers in the home are \\\"safe\\\" and won\\'t respawn. This mod is compatible with the Dovahkiin hideout, but it will have the trap door in the middle of your basement.\r\n\r\nImportant! If you are already Thane of Riften you should remove all items from the weapon racks and any other important items you might have laying around the house. You can find any missing containers by opening the console and entering TCL. In the Bathroom walk between the twin lamps and through the blue banner. There you will find all the old containers that have been moved out of the house and your items should still be inside them. If you had items placed around your house they will likely be scattered about, if there are any that you can\\'t find walk around the outer edge of the wall and they should be on the floor. Also If you have already been inside Honeyside before you will likely find the dead rabbit, bird and fish still hanging in your new alchemy lab. Just open your console click the ugly dead thing and type disable.\r\n\r\n**Important!** If you were using the old version of Better Honeyside you will see that the mannequins and bookcases are missing! Once you have gotten your items from them you can safely upgrade to this new version. And simply use the console code TCL to look for any items that you can\\'t find from the Master or guest bedrooms since I have swaped their locations in this new version.\r\n\r\nIf you are moving from another home to honeyside you can use the console to making moving easier. The console command is player.setav carryweight followed by a number. Before doing that you should check your carry weight and write down the value so you can be sure you\\'ve restored it to normal later. To add 1000 carry weight would look like \\\"player.setav carryweight 1000\\\" without quotation marks, to remove it would look like \\\"player.setav carryweight -1000\\\" again without quotations.\r\n\r\nInstall\r\n=======\r\n1. Copy the Better Honeyside.esp file to Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\r\n2. Start Skyrim Launcher, click \\'Data Files\\', place a checkmark beside the .esp file.\r\n\r\nUninstall\r\n=========\r\n1. Start the Skyrim Launcher, click Data Files, uncheck the Better Honeyside.esp file.\r\n2. Delete the .esp file from Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\r\n3. Delete Readme Better Honeyside.txt\r\n\r\n\r\nIncompatibility\r\n===============\r\nThis mod is compatible with Dovahkiin Hideout, but the trap door will be in the middle of your basement. This mod will be incompatible with most other mods that alter the interior of Honeyside. The Exterior hasn\\'t been changed.\r\nAs with any mod, backing up your save game before use is a good idea.",
  "categoryId": "67",
  "version": "2.1",
  "author": "Mercami",
  "createdUnix": "1329369839",
  "updatedUnix": "1329801314",
  "containsAdultContent": false,
  "uploadedBy": "Mercami",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31921",
      "name": "Better Honeyside v1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "27",
      "fileName": "Better Honeyside v1-9885.zip",
      "uploadedUnix": "1329371052",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2c4d01b5f4af1118a3d5263982fa9b8b3a4c23e28ff4865ed70d61b5b453f4be/analysis/1406686450/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Honeyside%20v1-9885.zip?fid=31921&ttl=1535769817&ri=8192&rs=8192&setec=b42153109f2fac242e7ac0bc833f6e70"
    },
    {
      "fileId": "33467",
      "name": "Better Honeyside v2_test",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "56",
      "fileName": "Better Honeyside v2_test-9885.zip",
      "uploadedUnix": "1329618318",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/25b176499e797bc551f55fe4fc4b81706dbe6c547b70f3db0d0a1d738630ea8c/analysis/1406694380/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Honeyside%20v2_test-9885.zip?fid=33467&ttl=1535769817&ri=8192&rs=8192&setec=07a5a6d18ec7566d14f60b9f14a46559"
    },
    {
      "fileId": "34623",
      "name": "Better Honeyside v2_1",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "55",
      "fileName": "Better Honeyside v2_1-9885-2-1.zip",
      "uploadedUnix": "1329801314",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/a95d04e0be67d9b1284ff5d3d6f3177d1ef09b89fb442dc93271561b7c4f8746/analysis/1406700559/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Honeyside%20v2_1-9885-2-1.zip?fid=34623&ttl=1535769818&ri=8192&rs=8192&setec=71a31fac3fda787201bbd7ed97fec9f9"
    }
  ]
}