{
  "modId": 9900.0,
  "modName": "MD Wolfes SER Market Fix",
  "summary": "A simple concept that has and will continue to expand to cover the entire economy of Skyrim.\r\n\r\nThis mod does a number of things from fixing item prices, real estate, inns, carriages, horses, animals, hirelings, adjusting book names for alphabetical sorting, as well as adding skill/quest/marked tags to be visible in game on each.  This also adds al",
  "descriptionHtml": "A simple concept that has and will continue to expand to cover the entire economy of Skyrim.\r\n\r\nThis mod does a number of things including:\r\n-Increased Vendor gold\r\n-Book price fixs\r\n-Book alphabetical names with skill/quest/marker tags after\r\n-Decreased all book weights to .25lb\r\n-Fixed real estate, horses, carriages, and inn prices.\r\n-Fixed spell tome prices\r\n-Added skills to select books that contained actual plausable information.\r\n-Added Quiver lists to populate more arrows into vendors, quivers are sets of 24 in these lists.\r\n-Added playability and vendor listing to Weapon: Fork, Knive, Shiv, Scimitar, Giantclub, Executioner Axe, and more!\r\n-Added uncommon armor, clothing, and weapons lists to vendors to find the spoils of others adventures!\r\n\r\nAnd much more to come!\r\n\r\nQuoting my own post here for future referance and details:\r\n\\\"Great feedback and suggestions, I have had several others also express a desire for a dynamic gold value, and I do plan on implementing one in future updates. The reason I have not done so in this initial update is the complication of having too go back and modify the script with future updates while we iron out the kinks in the economy system.\r\n\r\nYou see my economy model is based off the price of wood cuttings in game, using this as a basis that any peasant or adventurer can partake in to earn a living for a hard days work. As such I have been painstaking calculating and recalculating the price of each item in game, with a number of criteria such as availability, use, preparation/production where it applies, and overall demand in the simulated economy.\r\n\r\nWhat I would like to do, and fully intend to do with this series is establish a true base value system for each and every item in game that accurately reflects its place in a \\\"real\\\" skyrim economy, and from that point I will take it further to enable dynamic gold values, more dynamic item availability, including the ability to conscript orders from blacksmiths, alchemist, and enchanters for specific items that they would logically know, and a future method to allow you the player to increase their range of contracted goods.\r\n\r\nOn top of this my upcoming SBB (Skyrim Battle Balances) Will include populating npcs with higher grade versions of each weapon and armor as you level so as to allow the depth and immersion of fighting similarly clad bandits and such at all levels, while still maintaining a proper level of difficulty against them. Also it will be adding NPC adventurers that will raid bandit camps, caves, mines, and ruins without the players interaction, and then return to merchants to sell those goods, further increasing the immersion of the Skyrim economy and world.\r\n\r\nWell now that I have laid out my overall plans for both mod Series I hope you will all enjoy my current work, of course feedback is not only appreciated but encouraged! Furthermore if you believe you\\'d like too join in on the work here, please feel free to shoot me a pm with you\\'re modding strengths and what part you are interested in working on! \\\"\r\nCheck out all my mods!\r\n\r\nSkyrim\r\n\r\nSliders timescale fix: http://skyrim.nexusmods.com/downloads/file.php?id=8289\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=8151\r\n\r\nSkyrim Economics Rebalanced (SER)\r\nMaster mod: SER Market fix: http://skyrim.nexusmods.com/downloads/file.php?id=9900\r\nor on steam: http://steamcommunity.com/sharedfiles/filedetails/?id=11850\r\n\r\nand the upcoming lantern light mod along with further SER and SBB developments!\r\n\r\nFallout:New Vegas\r\n\r\nVanilla Hat Fix: http://newvegas.nexusmods.com/downloads/file.php?id=44319\r\n\r\nTKR Throwing Knife replenishment: http://newvegas.nexusmods.com/downloads/file.php?id=44704\r\n\r\nLast Mag: http://newvegas.nexusmods.com/downloads/file.php?id=44327 \r\n\r\nAnd the upcoming Riverside mod world with quests!",
  "categoryId": "78",
  "version": "1.0",
  "author": "MD Wolfe",
  "createdUnix": "1329378917",
  "updatedUnix": "1329379094",
  "containsAdultContent": false,
  "uploadedBy": "minngarm",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31958",
      "name": "SER Market fix 1v0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "625",
      "fileName": "SER Market fix 1v0-9900-1-0.7z",
      "uploadedUnix": "1329379094",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/61ec6c398fc8050fc3eb82bbf7cd2043a5da1702ecebd10a3747d4416a59997a/analysis/1406686744/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SER%20Market%20fix%201v0-9900-1-0.7z?fid=31958&ttl=1535769855&ri=8192&rs=8192&setec=1b02a44ce2f00200a8a78b3c33de6e5a"
    }
  ]
}