{
  "modId": 9901.0,
  "modName": "Dovakiin Mead Hall Dragonslayer throne fixed",
  "summary": "Mead Hall from Sovngarde as Player Home!\r\nAdded many Mannequins (every Race and Gender!)\r\nAlchemy table, Enchantment table, fully functional Forge, every Shrine, an alchemist merchant/trainer, tamed animals",
  "descriptionHtml": "First of all: Sorry for my bad English!\r\n\r\nWelcome to the Dovakiin Mead Hall!\r\nLoved the Mead Hall in Sovngarde, the problem was, the player sees it only once in the Main story only for a few minutes, before the player must leave.\r\nA real Dovakiin doeas not know any impossibilities, so he decided to dig out a new Mead Hall under his small house in Whiterun, Breezehome. \r\nHe missed the lack of mannequins in his other houses, so the almighty Dovakiin created humanoids from all races and genders, to let them wear his collection of mighty Armors!\r\n\r\n-Added a lot of Mannequins (every Race and Gender!)\r\n-a lot of Weaponracks\r\n-chests\r\n-Alchemy table, \r\n-Enchantment table, \r\n-fully functional Forge, \r\n-book shelves (should be functional soon)\r\n-every Shrine resized, \r\n-alchemist merchant/trainer, \r\n-Tamed animals (dont attack them, you will regret it...if u attack them, you cannot kill them and they will deal with you pretty fast;)\r\n-Resized Banners\r\n-added \\\"Throne of the Dragonslayer (Throne of Ulfric Stormcloak, decorated with shrines, some equipmesh, some Dragon skulls and placed two Bowls with skulls next to it)\r\n-Sabrecat is now always next to the throne\r\n-table with worldmap\r\n-some Daggers\r\n\r\ncoming soon: \r\nVendors and trainers\r\nEverlasting Fights between Creatures in the Mead room\r\nEventually Arena Fights in the Mead Hall-Arena!\r\n(i need to see if i can realize this)\r\n\r\nThis is my first bigger Mod and i was very impressed how complex and yet easy to use this creation kit was. I definetly want to learn more about this great editor, so you can expect a lot of mods in the future:)\r\n\r\n\r\nhow to get to the Dovakiin Mead Hall:\r\nSearch for a trapdoor in breezehome, look to the right on the floor next to the wall, right in front of the fire (when you come in).\r\n\r\nMod is compatible with Mods like Dovakiin hideout.\r\nI am not sure about Breezehome Redesign-Mods. \r\nTell me if there are any difficulties.\r\n\r\nInstall: Delete any previous Version of Dovakiin before u use a new version. Before that, you need to get all of your items to safety if you have placed them in the Hall, or else they will disappear with the newer version.  \r\nI am new to modding so i am still learning. I LOVE this Editor and i will definetly experiment a LOT more with it. This is my first \\\"bigger\\\" mod, so dont expect a bug free mod. I will do my best to fix all bugs that maybe occur but you need to help me finding them.\r\nStay tuned, i will release many unnecessary mods, maybe you will like one or another:)\r\nPlease comment and use constructive critics;)\r\nHave fun.\r\n\r\nFixed:\r\n-Sabrecat is now only in the mead hall tame, every other cat in the world is as aggressive as always. bears should be fixed now, too.\r\n-Middle Dragonskull resized a bit to a smaller size, because when sitting on the throne you can see its cheekbone, not very beautiful, now it should be better, although not tested yet.\r\n-Every altered object now has an own ID. I have totally forgot\r\nPlz report any bug you find, i will try to fix it as soon as possible. \r\n\r\nStill trying to get those shelfes to work, working on it:)",
  "categoryId": "22",
  "version": "1.11.1",
  "author": "Madbane",
  "createdUnix": "1329380064",
  "updatedUnix": "1329380064",
  "containsAdultContent": false,
  "uploadedBy": "madbane",
  "primaryFile": null,
  "files": []
}