{
  "modId": 9914.0,
  "modName": "Shars Rebalanced Perks",
  "summary": "Two-Handed sneak attacks and very sharp daggers!",
  "descriptionHtml": "================\r\n[b]Description[/b]\r\n================\r\n\r\nEver wanted to leap out of the shadows with your orcish warhammer and crush the bones of unsuspecting prey? How about charge into battle alongside your heroic brethren, wielding two daggers as deadly as any sword? Now, these things are feasible!The second of my absurdly simple mods, this will allow the One-Handed Weapon\\'s \\\"Bladesman\\\" perk to affect daggers, as well as swords. Also, the \\\"Backstab\\\" perk in the Sneaking tree will affect two-handed weapons, allowing four times more skull-crushing goodness!\r\n\r\nI hope to expand this mod in the future, as overlooked details of the original game present themselves. If you have an idea, please leave a comment! Just keep in mind that the true beauty of my work is in it\\'s elegant simplicity, and also that I\\'m not exactly pro at modding (yet)!\r\n\r\nSince I doubt everyone will like every change I make to the game\\'s perks, I\\'ve decided (for now) to create each new mod as a seperate esp file. When there are more of them, I\\'ll probably start making combinations, but for now this seems like the best route. :3\r\nAll the esps will be contained in a single archive, for the sake of simplicity.\r\n\r\n================\r\n[b]Official-Looking Notes Section![/b]\r\n================\r\n\r\n[b]V1.1[/b]\r\n[b]Shars Perks - DW Savagery.esp[/b]\r\n\r\nPerk \\\"Dual Savagery\\\" no longer provides flat damage bonus, instead causing bleed damage similar to 3 ranks of Hack-and-Slash.\r\n\r\n-------\r\n[b]V1.0[/b]\r\n[b]Shars Perks - 2HandSneak and DagCrit.esp[/b]\r\n\r\nPerk \\\"Backstab\\\" applies to two-handed weapons, granting a 4x damage bonus on successful sneak attacks.\r\n\r\nPerk \\\"Bladesman (One-Handed)\\\" applies to daggers, in addition to swords.\r\n\r\n\r\n-As always comments, compliments, endorsements will be met with squeals of joy! :3",
  "categoryId": "73",
  "version": "1.1",
  "author": "Shar181",
  "createdUnix": "1329393560",
  "updatedUnix": "1332695279",
  "containsAdultContent": false,
  "uploadedBy": "shar181",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46754",
      "name": "Rebalanced Perks V1-1",
      "version": "V1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Rebalanced Perks V1-1-9914-V1-1.rar",
      "uploadedUnix": "1332695279",
      "modVersion": "V1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6324203282bda1f027d1ae650267714fa9e18273ca620e4f47462035fe9a4e24/analysis/1406779207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rebalanced%20Perks%20V1-1-9914-V1-1.rar?fid=46754&ttl=1535769874&ri=8192&rs=8192&setec=ae0fdadbba74a2aa623cf5fafcb7a47b"
    }
  ]
}