{
  "modId": 9935.0,
  "modName": "Portable Campsite",
  "summary": "Adds portable bedrolls, campfires that cast real lights, real lights candles, tents, fences, etc to Skyrim, enabling your character to set up camp wherever you want, the mod includes also a portable tanning rack for the hunting fans!, 2 versions Full and Lite.",
  "descriptionHtml": "================================================================================\r\nCurrent Version 3.00   |  **IMPORTANT DO READ THE HOW TO USE BELOW**\r\n================================================================================\r\n\r\nAdds portable bedrolls, campfires, candles, tents, cooking spit and more to Skyrim, enabling your character to set up camp wherever you want, the mod includes also a portable tanning rack for the hunting fans! Now compatible with Hypothermia mod from Nitor\r\n\r\nChoose one of 2 versions of the mod, Full and Lite (v2.5).\r\n\r\nPlease leave a comment if you want something implemented, if you like the mod take the time to endorse the file, thanks!\r\n\r\nA video contributed by Arsenalrobert showcasing some instructions and items, check it out.\r\n\r\n[youtube]cJIK4zWnX1I[/youtube]\r\n\r\nThanks Arsenalrobert!\r\n\r\nHeres a video by Dalm showcasing the mod\r\n\r\n[youtube]_RVk4SdZPVE[/youtube]\r\n\r\nThanks Dalm!\r\n\r\n===========\r\nInstallation \r\n===========\r\n\r\n- Put the files in your Skyrim/Data folder and run the game launcher.\r\n- In the game launcher select Data and check the box beside the Portable Campsite mod to activate it.\r\n- Play the game.\r\n\r\n===========\r\nUpdate\r\n===========\r\n\r\n- Disable the mod on the Skyrim data loader, go ingame and save (ignore the warning about content not available)\r\n- Delete any old version you might have in the data folder.\r\n- Put the new version of the mod on Skyrim/Data folder overwriting all old files\r\n- Re-enable the mod in the Skyrim data loader\r\n- Load the game you saved on step 1 and play!\r\n\r\n(Tough this method is not required it will prevent some bugs with the items dissapearing when you try to recover them, this is due to the merchant reset)\r\n\r\n====================\r\nHow to Use\r\n====================\r\n\r\n!IMPORTANT! Choose a version and install only that version, both versions cant run togheter!\r\n\r\nFull Version:\r\n--------------------------\r\n\r\nYou can purchase the Portable Campsite items from the Experienced Hunter in Riverwood Sleeping Giant Inn under the Misc. items tab (more merchants will be added later), to install any of the portable items drop the item to the floor, once the item is on the location you want go into \\\"sneak\\\" mode and activate the item, doing this will activate the item and the item will be placed on the spot, to retrieve the item just activate it again while on \\\"sneak\\\" mode.\r\n\r\nOR\r\n\r\nYou can craft all the Portable Campsite items from any Tanning Rack or Smithing Forge, depending on the item, installing the items is the same.\r\n\r\nLight Version:\r\n------------------------\r\n\r\nThis version works exactly the same but adds just basic items to the list of things you can buy or craft, due to the simple nature this version it will remain at v2.5.\r\n\r\n============\r\nIMPORTANT! \r\n============\r\n\r\nDue on how the system works currently you can properly use one instance of all items! tough you might be able to setup 2 bedrolls for example, to be on the safe side of things just make/use/buy one copy of the item.\r\n\r\nDue to how Skyrim works with lights if you place too many lights near each other some will turn off on their own, this is confirmed to be a problem with the Skyrim engine.\r\n\r\n========================\r\nConflicts with other mods\r\n========================\r\n\r\nFollowers mods where you can make your follower relax will not conflict but be annoying because the follower will activate the items, make sure you order your follower to wait untill you are done setting up camp, do not have a follower \\\"relax\\\" while you are in sneaking mode because this will cause the item to get stored in your inv.\r\n\r\nMost likelly the mod will conflict with any mod that uses the smithing forge and/or tanning rack (make sure to load this mod last with NMM to avoid this) and or adds npcs to Riverwood Sleeping Giant Inn interior (use the CK and move the npc to where you want, its impossible for me to fit each individual needs).\r\n\r\nThis mod will conflict with any mod that alters the ammount of items all merchants sell globally (since only one copy of the item can be on the merchant at any given time), this will make you crash to desktop, there is no way around it but disable the mod that alters the ammount of items on merchants.\r\n\r\n========================\r\nProblems and how to\r\n========================\r\n\r\nIf you crash to desktop make 100% sure \\\"update.esm\\\" is checked on the data files of the Skyrim loader or Nexus Mod Manager, this is required since it is a master file, this file is present on all purchased Skyrim copies so you should have it, if you dont i recommend you actually buy the game \\\"har har\\\".\r\n\r\nThis mod does not set (and prolly will never) a map marker to any items, this would clog the save data and generate a lot of issues, use the map custom marker to remember where you are setting up camp, works like a charm.\r\n\r\nIf you cant find the merchant in riverwood make sure you are running the game loader as administrator otherwise no mods will load, make sure your game is up to date, make sure the mod is enabled on the \\\"data files\\\" section of Skyrim loader, make sure the mod loads last with NMM.\r\n\r\nFor now with version 3 the items are placed like this, the spot where you drop the item initially is the general (X/Y) position where the item will appear, your character feets height is the height (Z) where the item will appear, so for exmaple if you want to put a candle on a table you have to get up to the table with your character, sneak so the item wont go flying when you drop it, drop the item, activate it while on sneak mode, this will spawn the candle on top of the table.\r\n\r\nIf your character cant reach the spot you want for your item or you put an item that went tru the ground and cant recover it (this happens a lot with stones/stone roads) just type TCL in the console so you can go into no collision mode and get to that spot and place your item, type TCL again in the console to go back to normal (make sure your not too high or you will die)\r\n\r\nIf you lost your items and the new one you make or buy is not working follow this:\r\n\r\n- Disable the mod on the Skyrim data loader, go ingame and save (ignore the warning about content not available)\r\n- Re-enable the mod in the Skyrim data loader\r\n- Load the game you saved on step 1 all items will be reset\r\nYou will have to make/buy what you lost again.\r\n\r\nIf the Wood Chopping block is not giving you wood make sure you have a woodcuters axe equiped, otherwise you wont get wood and the animations will end.\r\n\r\n====================\r\nVersion History\r\n====================\r\n\r\nVersion 3.00\r\n\r\n- Added compatibility for Nitro Hypothermia mod, campfires will now give warm, if its not working for you try to remake/re-purchase the item.\r\n\r\n- Added new sounds to campfires.\r\n\r\n- Added a portable target that will inform you if its hit, time to practice those \\\"far\\\" trick shoots.\r\n\r\n- Added blacksmith items, including a very expensive skyforge replica you can install in your camp.\r\n\r\n- Added more misc items, Hunter now sells more arrows.\r\n\r\nVersion 2.50\r\n\r\n- Unified both versions, is now your choise how you want to have the items, you can craft or buy.\r\n- Added Lite Version, same as original but with just the basics, please do not ask me to add individual items, it is lite for a reason, ONLY basic stuff, if personally you need more use the full version and make wathever you want/can carry.\r\n- Added Traps.\r\n- Added Alarms that reset on setup (yes im a paranoid parrot).\r\n- Added a Readme to the file\r\n\r\nVersion 2.00\r\n\r\n- Added real lights! now all light sources of all items will emit photorealistic lights.\r\n- Added Portable Candles, Lanterns and Candelabra.\r\n- Added portable death sticks for the evil/badass vikings characters to display the heads and dismembered body parts.\r\n- Updated the script to avoid save game bloating further.\r\n- Added extra ammounts of some items (like 2 campfires that you can take instead of 1)\r\n\r\nVersion 1.30\r\n\r\n- Added portable fences (leather and wood spikes)\r\n- Added safe to use copies of bedrolls and chairs so your companion can also have a place to sleep.\r\n- Added for popular demand a new hand made item to the game, the small cooking pot (comes with fire and all no need to worry about placing the fire anymore, it is also usable to make food).\r\n- Added a table that comes with a bench so you can enjoy your outdoor meals on some surface other than the floor.\r\n- Tweaked some of the craftable version recipes, some things now need mor ematerials and make more sense.\r\n- Tweaked the Merchant version experienced hunter, she now fights properly and is one of the most deadly NPCs on this game, avoid pissing her off.\r\n\r\nVersion 1.20\r\n\r\n- Added optional craftable items version\r\n- Added new items that you can carry with you:\r\n\r\nHay Bed\r\nFishing poles collection\r\nWooden Stool (the animation for this one is buggy if you use 3rd person, i will reeskin it later to fix this)\r\n\r\nVersion 1.10\r\n\r\n- Removed buggy small woodfire\r\n- Added merchant NPC for the mod in Riverwood named Experienced Hunter\r\n- Added Wood Chopping block to the list of items you can transport\r\n\r\nVersion 1\r\n\r\n- Added the first few items to the campfire set",
  "categoryId": "67",
  "version": "3.00",
  "author": "Mcxar",
  "createdUnix": "1329411879",
  "updatedUnix": "1340528980",
  "containsAdultContent": false,
  "uploadedBy": "mcxar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "35732",
      "name": "Optional Data Files",
      "version": "2.50",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1801",
      "fileName": "Optional Data Files-9935-2-50.zip",
      "uploadedUnix": "1330007282",
      "modVersion": "2.50",
      "virusScanUrl": "https://www.virustotal.com/file/b5e2d5b574af8aa0d74c585d2ec73bc266b85a2f352af938f4ce261d3e2579a8/analysis/1406707701/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20Data%20Files-9935-2-50.zip?fid=35732&ttl=1535769900&ri=8192&rs=8192&setec=ae7b70b835f523f50512601a6ea72da5"
    },
    {
      "fileId": "35734",
      "name": "Portable Campsite Lite",
      "version": "2.50",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1297",
      "fileName": "Portable Campsite Lite-9935.zip",
      "uploadedUnix": "1330007358",
      "modVersion": "2.50",
      "virusScanUrl": "https://www.virustotal.com/file/60233576804dfddfb5d15ab239c051f66894766ae93d909fea62c102b7d0297a/analysis/1406707704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Portable%20Campsite%20Lite-9935.zip?fid=35734&ttl=1535769900&ri=8192&rs=8192&setec=25c1224601d27127c9463586b50751e0"
    },
    {
      "fileId": "35739",
      "name": "Portable Campsite Full",
      "version": "2.50",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1298",
      "fileName": "Portable Campsite Full-9935-2-50.zip",
      "uploadedUnix": "1330007444",
      "modVersion": "2.50",
      "virusScanUrl": "https://www.virustotal.com/file/7b9655d9e9222517f8c8e4d4f660f2a57f9b2b470aa5659eb0fab0b33ca2b926/analysis/1406707706/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Portable%20Campsite%20Full-9935-2-50.zip?fid=35739&ttl=1535769901&ri=8192&rs=8192&setec=25bb7acdfea1957422fca562ee54a595"
    },
    {
      "fileId": "69985",
      "name": "Portable Campsite Full v3",
      "version": "3.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1333",
      "fileName": "Portable Campsite Full v3-9935-3-00.zip",
      "uploadedUnix": "1340528980",
      "modVersion": "3.00",
      "virusScanUrl": "https://www.virustotal.com/file/96eec128685a9e19cda27f68d5fef8ce3ea6650a72f2dbe70f77027cd153e9be/analysis/1406979783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Portable%20Campsite%20Full%20v3-9935-3-00.zip?fid=69985&ttl=1535769901&ri=8192&rs=8192&setec=5d60fb174b08988132be7951617739e7"
    }
  ]
}