{
  "modId": 9959.0,
  "modName": "Lorecraft - acquire learn manage crafting recipes",
  "summary": "Instead of having your weapons and armor (and any craftable beyond smithing) delivered straight to your craft lists, you&#39;ll loot, buy or trade for books that teach you how to craft them. Features its own loot and merchant system. Supports content plugins (modder support). Books come with custom page art. ",
  "descriptionHtml": "[center][b][size=8][img=center]http://skyrim.nexusmods.com/downloads/images/9959-2-1337986604.png[/img][/size][/b]\r<br />\r<br />[b][size=4]by ArcaneSmith[/b][/size]\r<br />\r<br />\r<br />[size=4]\r<br />Lorecraft supports content plugins that add more craftables\r<br />[url=http://skyrim.nexusmods.com/mods/searchresults/?name=lorecraft] SEARCH FOR RELEASED CONTENT PLUGINS HERE[/url]\r<br />[/size]\r<br />\r<br />\r<br />[size=3] [b]\r<br />\r<br />Lorecraft is no longer supported or updated. \r<br />\r<br />\r<br />\r<br />[/center]\r<br />\r<br />[line]\r<br />\r<br />\r<br />\r<br />[list]\r<br />[b][size=6] PERMISSIONS[/b][/size]\r<br />\r<br />\r<br />\r<br />\r<br />[color=green][size=4]YOU CAN[/size]\r<br />\r<br />[*] Merge Lorecraft to any mod \r<br />[*] Merge any of its files to any mod \r<br />[*] Use any assets\r<br />[*] Make and upload content plugins that use lorecraftESM.esm as master\r<br />[*] Make and upload plugins that change features on lorecraftESM.esm \r<br />[*] Make and upload book art replacements\r<br />\r<br />All you need to do is give credit and link back to this page.  Essentially, you can do whatever you want with this mod without asking me, just let me know. You still can&#39;t profit from it.\r<br />\r<br />[/color]\r<br />[/list]\r<br />\r<br />\r<br />[b][size=6]OVERVIEW[/b][/size]\r<br />[list]\r<br />\r<br />[*] You acquire books that teach you to craft your gear.\r<br />[*] You choose what to show on your crafting list* \r<br />[*] Modders can add more books for weapons, armors and other craftables to the system via plugins\r<br />[*] Lorecraft handles all books from its plugins, sending them to the merchant, loot and barter systems\r<br />\r<br />*If you use the Vanilla plugin it will wipe your crafting list clean.\r<br />\r<br />[/list]\r<br />\r<br />\r<br />\r<br />[size=6][b]BENEFITS[/b][/size]\r<br /> \r<br />[list]\r<br /> \r<br />[size=4][b]FOR USERS[/b][/size]\r<br /> \r<br />[*] No more cluttered crafting lists: faster and organized crafting\r<br />[*] Roleplaying and immersion\r<br />[*] Crafting is not about finding the uber sword in a list of trash anymore\r<br />[*] Gives you a reason to keep exploring and playing\r<br />[*] Makes clearing dungeons andd killing dragons rewarding\r<br />[*] You don&#39;t need to worry about incompatibilities or merging leveled lists because Lorecraft uses its own - and already compatible - loot/merchant system\r<br /> \r<br /> \r<br />[size=4][b]FOR MODDERS[/b][/size]\r<br /> \r<br />[*] Your mod will be more fun because your items won&#39;t be delivered directly to the player&#39;s crafting list, which is pretty boring (and messy)\r<br />[*] You can control where the player acquires your books and how rare they are (to a degree)\r<br />[*] You can make your item more interesting by adding lore to its book or customizing it*\r<br />[*] Adding your item to the world is simple and compatible to other mods - and you don&#39;t have to fill boring leveled lists over and over\r<br />[*] I can create other interesting ways to reward your craftables in the future without touching your mod\r<br /> \r<br />*If you don&#39;t want to worry about art or layouts, there&#39;s a series of templates you can just duplicate and rename\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=6]COMPATIBILITY[/b][/size]\r<br />\r<br />[*] Lorecraft&#39;s loot and merchant systems are [b]Compatible[/b] to mods that change vanilla leveled lists for creatures and vendors. This is NOT a list-based loot/vendor system. \r<br />[*] The Arcane Smith npc is NOT added directly to the Skyforge area, so Lorecraft shouldn&#39;t interfere with any mods that change it.\r<br />[color=yellow][*] You can convert existing mods that contain craftables to the Lorecraft system. If you want to create a content plugin, there&#39;s a tutorial with pics in the zip.[/color] \r<br />\r<br />\r<br /> \r<br /> \r<br />\r<br /> \r<br />\r<br /> \r<br />\r<br />[b][size=10] FEATURES[/b][/size]\r<br />\r<br /> \r<br />\r<br /> \r<br />[b][size=6] CONTENT PLUGINS [/b][/size]\r<br /> \r<br />Lorecraft is made of its core systems for managing, loot, merchant and barter,the book database. All the craftable stuff and their books are added by plugins that are slave to LorecraftESM.esm. Every installed plugin (4.0+) will add its books to the Database, then they are drawn by Lorecraft&#39;s  merchant, loot and barter systems. Without at least 1 plugin, Lorecraft is pointless.\r<br /> \r<br />The greatest thing about this setup and the database is that everyone gets to work on the same system but individually, on their own plugins, without worrying about compatibility or leveled lists. This way, Lorecraft can be as big as its plugin constellation and is only limited by how many people take interest in modding for it.\r<br />\r<br />This zip already includes a content plugin, Lorecraft - Vanilla, which adds to Lorecraft the vanilla stuff that is already craftable - you don&#39;t have to use this if you don&#39;t want to, though.  All additional content plugins made by me and other modders have their own pages with ‘Lorecraft&#39; in the title.\r<br />[size=3] \r<br />[url=http://skyrim.nexusmods.com/downloads/search.php?name=lorecraft&scid=&author=&mname=&desc=&size1=&size2=&downloads1=&downloads2=&udate1_day=&udate1_month=&udate1_year=&udate2_day=&udate2_month=&udate2_year=&ldate1_day=&ldate1_month=&ldate1_year=&ldate2_day=&ldate2_month=&ldate2_year=&endorsements=&images=&readme=&adultonly=&opensource=&page=1] RELEASED CONTENT PLUGINS[/url]\r<br />[/size] \r<br />[color=yellow]Guide to plugin-making in the zip.[/color]\r<br />\r<br /> \r<br /> \r<br />\r<br />[b][size=6]RECIPE LEARNING AND MANAGEMENT[/b][/size]\r<br />\r<br />[youtube]Bigs2PtUDaM[/youtube]\r<br /> \r<br />\r<br />[*] When you open a book for the first time, you learn the recipe(s) it contains\r<br />[*] Once read and learned, they won&#39;t open normally anymore. \r<br />[*] When out of your inventory, pressing E (or your custom activate key) will toggle the books &#34;on&#34; and &#34;off&#34; showing or hiding the recipe at the forge (or any other station)\r<br />[*] Active books will be highlighted - only when you&#39;re near them\r<br />[*] Pressing and holding E will open the book after the first read (opening the book will do nothing then)\r<br />[*] When open, you can either press E to pick the book up or Tab to close it, normally\r<br />\r<br />\r<br /> \r<br /> \r<br />\r<br />[b][size=6] BOOK RARITY [/b][/size]\r<br />\r<br />When creating books  for their craftables, modders can set their rarity. They can be:\r<br />\r<br />Common: Will be readily available at lower levels at the specified Loot and Merchant chances.\r<br />[color= blue] Rare:[/color] Lower chance to find.* \r<br />[color= red]Special:[/color] Even lower chance to find.* \r<br />\r<br />*Chance increases with your level (or the level of the enemy you kill) and they&#39;re tied to the loot chance you specify. In other words, it will always be a fraction of it.\r<br /> \r<br /> \r<br />\r<br />[b][size=6] BOOK TYPES AND ART [/b][/size]\r<br /> \r<br />Lorecraft has different types of books. That does not only means shape and art variety but it also dictates who sells which books, what enemies carries them and where. \r<br /> \r<br />\r<br />All book types have (or will have) their own custom art. Some I drew myself from scratch like Falmer and Ancient Falmer books, others were real-life crafting manuals I adapted. Some look great, some half-decent. Nevertheless, I&#39;ve made each and every single image. This is a long, time-consuming process that is not finished yet, but at the end of it, every book will look at least good and related to the type of gear it teaches.\r<br /> \r<br />\r<br />Modders are not limited to the art I make - they can add their own, mixmatch pages to create something fresh, or even make an entirely new book from scratch if they want to.\r<br />\r<br /> \r<br />\r<br />[b][size=6] DYNAMIC AND COMPATIBLE LOOT SYSTEM [/b][/size]\r<br /> \r<br /> \r<br />\r<br />[*] Books from any content plugins will drop from enemy npcs (beasts, obviously, won&#39;t drop them)\r<br />[*] Doesn&#39;t use any leveled lists so it wont break mods that use them. \r<br />[*] Books can drop even from npcs in other mods. (given they&#39;re in vanilla factions, races etc)\r<br />[*] Different types of books drop from correspondent enemies. Book art corresponds to book type and to where it drops (WIP) \r<br />[*] Loot glow: When an enemy drops a book, its body will glow faintly. The glow is color coded.* \r<br />[*] The chance of finding books on enemies can be tweaked*\r<br /> \r<br />\r<br />[img=left] http://skyrim.nexusmods.com/downloads/images/9959-1-1337986603.jpg [/img]\r<br /> \r<br />\r<br />Rairity: All enemies drop common and rare books, only bosses drop Special books. The higher the level of the enemy killed more likely they will drop Rare and Special books.\r<br />(In vanilla, bosses are usually found at the end of dungeons, but other mods may have added actors tagged as boss to other places)\r<br />\r<br /> \r<br /> \r<br />[b][size=6] DYNAMIC AND COMPATIBLE MERCHANT SYSTEM [/b][/size]\r<br /> \r<br />\r<br />[*] Picks random and specific merchants to sell Lorecraft books, which are tapped from the Database. \r<br />[*] Doesn&#39;t use leveled lists\r<br />[*] The chance of finding books for sale can be tweaked*\r<br /> \r<br />\r<br />Who sells what:\r<br /> \r<br />\r<br />[*] The Arcane Smith npc (Skyforge) - most book types, chance to have something rarer\r<br />[*] Markarth smith -  Books for silver gear\r<br />[*] Solitude smith - Books for Imperial gear\r<br />[*] Windhelm smith - Books for Stormcloak gear\r<br />[*] Random smiths - any generic and common book for smithing\r<br />[*] Random common merchants - Cook and jewelry books\r<br />[*] Random fences - Books for thief gear\r<br />[*] Most faction merchants will sell faction-specific books. You need to be in the faction or have access to their building to get these, you can still get them from other means, though. (With my More Craftables plugin, for instance, Eorlund will sell the book for Wolf Armor)\r<br />(might expand on this)\r<br /> \r<br />\r<br />Rarity: Random merchants hardly, if ever, sell any Special or Rare book. Faction merchants and The Arcane Smith npc have a higher chance to sell them.\r<br /> \r<br /> \r<br />\r<br />[b][size=6] BARTER SYSTEM [/b][/size]\r<br /> \r<br />\r<br />Harbard, The Arcane Smith (Skyforge) will gladly take your dragon souls in return for Rare and Special books.\r<br />[*] Special books: 20 souls*\r<br />[*] Rare books: 5 souls*\r<br />\r<br />  \r<br /> \r<br />\r<br />[b][size=6] TWEAKING AND TESTING FEATURES [/b][/size]\r<br />\r<br />You can tweak drop chance, book availability on merchants and much more using console commands. Also, you can test the mod, cheat, access all books in the database and more by using Lorecraft&#39;s testing hall.*\r<br />\r<br /> \r<br />\r<br />*[color=yellow]See readme for more in-depth information[/color]\r<br />\r<br />\r<br />[/list]\r<br />\r<br />\r<br />_________________________________________________________________________________________\r<br />\r<br />\r<br />\r<br />[b][size=6]LORECRAFT - VANILLA CONTENT PLUGIN [/b][/size] \r<br />[b][size=4](Lorecraft - Vanilla.esp - bundled with Lorecraft core, but entirely optional) [/b][/size] \r<br />\r<br />[b]CRAFTING MATERIALS AND REQUIREMENTS[/b]\r<br />\r<br />Same old requirements still apply. So, to craft, say, a set of Ebony Armor, you still need to have Ebony Smithing, and have read the crafting book for Ebony Armor (and have that book toggled on). Jewelry still has no material requirements and should never have. All you need to do is learn the recipes.\r<br />\r<br />[b]FEATURES[/b]\r<br />[list]\r<br />[*] Adds all vanilla weapons, armor and jewelry that were already craftable to Lorecraft\r<br />[*] Makes Ancient Nord weapons and armors craftable via books that drop from draugr, Companions quest no required anymore.\r<br />[*] Makes arrows craftable (learned with the book for bows)\r<br />[*] [color=yellow] leather and hide armors are crafted at the [size=3]TANNING RACK[/size].[/color]\r<br />[/list]\r<br />\r<br />\r<br />[size=3][b]KNOWN ISSUES[/b][/size]\r<br />\r<br />- The Lorecraft - Vanilla.esp plugin breaks the noobie smithing quest. No eta on fix. A workaround is to disable the plugin, finish the quest, reenable it. You won&#39;t lose any books.\r<br />\r<br />- You won&#39;t skill up in smithing by making leather stuff at the tanning rack. It&#39;s not a global thing, it&#39;s limited to plugins that move leather recipes to tanning rack only. It makes sense but wasn&#39;t intentional and might get a global fix sooner or later.\r<br />\r<br />[b][size=3]COMPATIBILITY[/b][/size]\r<br />[list]\r<br />[*] The Lorecraft - Vanilla.esp plugin is NOT compatible to anything that changes vanilla constructible object recipes\r<br />[*] Compatible with anything that changes vanilla gear attributes such as speed, damage etc.\r<br />[/list]\r<br />\r<br />\r<br />\r<br />_________________________________________________________________________________________\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=6][b]THANKS[/b][/size]\r<br />\r<br />- Everyone spreading the word to other modders, who have tested, given feedback, endorsed and donated.\r<br />\r<br />- Chesko for sharing great info on Beth forums and fg109 for pointing me to it\r<br />- PlayerTw0 for making videos for Lorecraft\r<br />- ScarabMonkey for helping me cleaning and splitting files for 3.0 and always giving great feedback.\r<br />- Xenius for featuring Lorecraft on  [url=http://www.skyrimforge.com/announcements/mod-interview-with-arcane-smith-lorecraft]Skyrim Forge[/url]\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=6]READ BEFORE POSTING COMMENTS[/b][/size]\r<br />\r<br />You&#39;re very welcome to post comments, REQUEST features/plugins/mods and especially report bugs. Go hunt some bugs&#33;\r<br />I&#39;m usually busy but I&#39;ll try my best to answer individually. Have this in mind so your post counts and gets answered:\r<br />[list]\r<br />[*] Be specific about bugs/issues \r<br />[*] Isolate the plugin causing the problem\r<br />[*] Posts about plugins I didn&#39;t make will be ignored unless there&#39;s an issue on my mod&#39;s end\r<br />[*] Questions answered in FAQs or Known Issues, main pages or readmes will be ignored\r<br />[*] Posters with attitude or lacking basic manners will be ignored or politely invited to gtfo =D\r<br />[/list]\r<br />\r<br />[line]\r<br />_________________________________________________________________________________________\r<br />[b][size=6]VIDEOS[/b][/size]\r<br />\r<br />Feature overview by PlayerTw0\r<br />[youtube]_PV7GerpYyk[/youtube]\r<br />\r<br />\r<br />\r<br />\r<br />",
  "categoryId": "24",
  "version": "4.1",
  "author": "ArcaneSmith",
  "createdUnix": "1329426082",
  "updatedUnix": "1338923637",
  "containsAdultContent": false,
  "uploadedBy": "ArcaneSmith",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42454",
      "name": "Lorecraft 1 4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "150281",
      "fileName": "Lorecraft 1 4-9959.zip",
      "uploadedUnix": "1331503539",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/d20c0f533062f6cb720f84c875b287322a4f8704236dd5fe4edffd609e7fbea8/analysis/1406744155/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lorecraft%201%204-9959.zip?fid=42454&ttl=1535769971&ri=8192&rs=8192&setec=ebda06e6b4d5ac680d9ed0474a0f53e2"
    },
    {
      "fileId": "66122",
      "name": "Lorecraft 41",
      "version": "4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34616",
      "fileName": "Lorecraft 41-9959-4-1.zip",
      "uploadedUnix": "1338923637",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/9a8247962d107f70d200bf43d2567f30d116315f687b7b9d5305b8234fd1a357/analysis/1406940630/",
      "changelogHtml": " New barter system <br/> \n Merchants have more books to sell at a time <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lorecraft%2041-9959-4-1.zip?fid=66122&ttl=1535769972&ri=8192&rs=8192&setec=1f29239b98724b9df4abae4b29677989"
    }
  ]
}