{
  "modId": 9960.0,
  "modName": "Improved Skill Books",
  "summary": "Appends the skill improved to the name of every skill book, and loots skill books to your inventory without reading so you can save them for later.",
  "descriptionHtml": "Description\r\n---------------\r\nThis mod appends the skill improved to the name of every skill book, and loots skill books to your inventory without reading so you can save them for later.\r\n\r\nIn Skyrim, I always try to minimize leveling of skills I am not using. To that end, this is an ease-of-use addon which will append to the end of ALL skill book titles the name of the skill improved in parentheses. \\\"The Refugees\\\" becomes \\\"The Refugees (Light Armor)\\\", \\\"Night Falls on Sentinel\\\" becomes \\\"Night Falls on Sentinel (One-handed)\\\" etc.\r\nI imagine it will be similarly useful if you are the type to avoid books for skills until you get to the 90-95 range to make those last few grueling points that much easier.\r\n\r\nI added a script to every skill book that allows you to loot it without reading. You can still read the book in your inventory for the requisite skill boost. If your save is already in a cell that contains a skill book, you need to go outside and come back in for the script to take effect.\r\n\r\nPlease note that this mod is English only. The script and such should still function in other languages but all the skill books will have English titles and contents.\r\nIf you have any other mods which edit the same books they will likely also conflict, only the last loaded will probably function.\r\n\r\nThis mod is also available on Steam Workshop:\r\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=8607",
  "categoryId": "27",
  "version": "1.1",
  "author": "elGrecoLoco",
  "createdUnix": "1329426420",
  "updatedUnix": "1329426460",
  "containsAdultContent": false,
  "uploadedBy": "elGrecoLoco",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32204",
      "name": "Improved Skill Books",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "240",
      "fileName": "Improved Skill Books-9960-1-1.zip",
      "uploadedUnix": "1329426460",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/be633b3aec5b5b5b6ba85fb3c486960cb22dc384fd35b367718b1119ef15cd43/analysis/1406688063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Skill%20Books-9960-1-1.zip?fid=32204&ttl=1535769973&ri=8192&rs=8192&setec=ce2a4c6046738023594007e8e1416904"
    }
  ]
}