{
  "modId": 9966.0,
  "modName": "Enhanced Shouting",
  "summary": "Makes shouts somewhat stronger and decreases cooldown period.",
  "descriptionHtml": "I made this mod mainly for myself but I thought people might appreciate it if I would upload it.\r\nThis mod basically makes shouts more usefull by increasing their power and decreasing the cooldown period. I made this mod for play on Master or harder so things are probably not going to be balanced on Expert or lower. I haven\\'t really thought much about the numbers and just changed the shouts to something that would seem right. Also haven\\'t tested it fully yet so if you encounter any OP things or w/e let me know in the comments.\r\n\r\nI might start working on adding other effects to certain shouts that would seem fit, things like adding a damage armor effect to Dragonrend (because right now it\\'s pretty lame honestly), etc. etc.\r\n\r\nSee image for complete list of changes. If I didn\\'t mention an effect in the magnitudes list I left it unchanged (like duration for Dismay etc). I left aura whisper unedited even though the image says otherwise because somehow it would change the Area of the spell to 0 when I would modify the duration, and it was impossible (I didn\\'t try very hard though) to change it back.\r\n\r\nRemember:\r\n\r\nThe Voice is worship\r\n\r\nFollow the Inner path\r\n\r\nSpeak only in True Need",
  "categoryId": "24",
  "version": "1.00",
  "author": "Sappie22",
  "createdUnix": "1329428739",
  "updatedUnix": "1329428840",
  "containsAdultContent": false,
  "uploadedBy": "Sappie22",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32215",
      "name": "Enhanced Shouting",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Enhanced Shouting-9966-v1.rar",
      "uploadedUnix": "1329428840",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/fb806cab217bc9253291cf21c20d295c2c28a4c50dab0e807060073272f99794/analysis/1406688071/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enhanced%20Shouting-9966-v1.rar?fid=32215&ttl=1535769983&ri=8192&rs=8192&setec=4d1630d535b2d01014bdf90f7b768eb5"
    }
  ]
}