{
  "modId": 9987.0,
  "modName": "Survival and Woodcraft Mod",
  "summary": "WOODCRAFT & SURVIVAL MOD 0.1 by joe3:16 \r\n\r\n\r\nInstall update: Just replace the old .esp file with the new one manually or via mod-manager.\r\n\r\nUpdate:\r\n====================\r\n1.1\r\n   - Added new spells (Summon Diego/Barkface, Command Wolf/Bear/Sabertooth, Become one with Nature)\r\n   - Added enchantments to the Legendary Hunting Armor and Hood (Less A",
  "descriptionHtml": "WOODCRAFT & SURVIVAL MOD 0.1 by joe3:16 \r\n\r\nIF YOU LIKE IT, PLEASE ENDORSE IT.\r\n\r\nAlso check out my \\'Black Alchemy\\' mod:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10329\r\n\r\nInstall update: Just replace the old .esp file with the new one manually or via mod-manager.\r\n\r\nUpdate:\r\n====================\r\n1.1\r\n   - Added new spells (Summon Diego/Barkface, Command Wolf/Bear/Sabertooth, Become one with Nature)\r\n   - Added enchantments to the Legendary Hunting Armor and Hood (Less Animal Dam, streght of the Bear)\r\n   - Added new venoms (actual wood venom as made fun of in the comments, now you can show those ents...)\r\n   - Added new recipes\r\n\r\n\r\nThis mod is a WIP that aims to create a survival immersion in Skyrim. It makes hunting, cooking and collecting nessesary and rewarding.\r\nYou need to eat, sleep and drink (water, not only booze). You can create new woodcraft weapons, armor, food, venom, pelts, recipes...\r\nThe tools to craft the new items are the tanning rack and cooking pot, so your charakter can stay outdoors.\r\nAll recipes rely on different stages of the 5 Alchemist perks.\r\n\r\nWARNING: THIS MAKES THE GAME HARDER! Best experienced in combination with \\'Deadly Dragons\\' and some No-Fasttravel-Mod...\r\n\r\nThis mod is not compatible with other mods that change food effects.\r\n\r\nRegeneration is toggled via console: \\'bat regenoff\\' / \\'bat regenon\\'  \r\nRecomended timescale is set via: \\'bat ts6\\'  (back to vanilla \\'bat ts20\\')\r\nThis only has to be done once.\r\n\r\nI highly recomend using \\'Portable Campsite\\' by Mcxar.\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=9935\r\n\r\n\r\nCHANGES:\r\nThe biggest change is the need to SLEEP, DRINK and EAT for your base values to recover. (New coocking recipes and perks!)\r\nThe mod is balanced so that every type of character has to do all three things more or less.\r\nCooked Food and drinks have new effects and recipes to match a realistic consume need. Replaced Alto Wine by Water.\r\nOf course you can still get your recovery-rates up with enchantments, potions an perks if you don\\'t have food or a bed.\r\n\r\n\r\nThe second change is a new woodcraft system that allows you to build caveman-style weapons and armor with cool new enchantments at the tanning rack.\r\nThe idea is that your character doesn\\'t have to go to town to craft stuff and wouldn\\'t wear fancy elven armor while hunting.\r\nTo build this equipment you will need the 5 different stages of the basic ALCHEMIST PERK, making it the \\'somehow-survival-skill\\'.\r\nNew crafting materials like firestone and ivory ingots, tanned pelts and a lot of firewood are needed to creat the stuff.\r\nAll weapons and armor can be upgraded, but only at the wheel, ingots can only be smelted at the ...wait for it... smelter.\r\n\r\nDon\\'t forget: different levels of the Alchemist perk are needed to build or improve stuff!!!\r\n\r\nTo be continued...\r\n\r\n\r\nInstall:\r\n- Extract files to data folder or load the entire Woodcraft.zip file in the mod manager.\r\n- Activate the Woodcraft.esp in the launcher or mod manager.\r\n- Open console in game, type \\'bat regenoff\\' to stop auto-regeneration, type \\'ts 6\\' for slower timescaling, fitting the need for food. type \\'bat regenon\\' and \\'ts 20\\' to ret\r\n\r\nUninstall:\r\n- Delete the files from the data folder or deaktivate in mod manager.\r\n- Open console in game, type \\'bat regenon\\' and \\'ts 20\\' to return to default settings.\r\n\r\n\r\n\r\nIn Detail:\r\n\r\n- SURVIVAL-MODE: Health, magicka and stamina will not recover. (\\'bat regenoff\\' = value -100)\r\n                \r\n\r\n  - Health:  Drinking and sleeping improve your health-recovery for some time. Added Water (by replacing one sort of alto-wine)\r\n             Alcohol boost your health.\r\n             (If you are rested and hydrated your recovery rate is like vanilla)\r\n\r\n  - Stamina and Magicka are restored only by soups and stews. Magicka by fish soups, Stamina by meat stews. Coocking is now important.\r\n             More recipes will be availabe by Alchemyst perks.\r\n             Coocked Fish ad Meat boost Magica or Stamina.\r\n             Sweets and cheese boost magicka or stamina.\r\n             \r\n\r\n- WOODCRAFT: Build caveman-style weapons and armor from wood, animal-parts and ingredients. \r\n\r\n\r\n  - \\'Raw\\' Pelts can be improved into a tanned version at the rack by using salt and charcoal, making them more valueable\r\n    as Pelts are in reality. Hunters can make a living like this.\r\n\r\n  - Charcoal can be created from firewood and Flour from wheat at the smelter.\r\n\r\n  - New Woddcraft Weapons and Armor can be created at the tanning rack. You\\'ll need different types of marterial to craft them like\r\n    flintstone, ivory, firewood, and ingredients or pelts:\r\n        \r\n         - Hunting Gear (build at tanning rack, alchemist perk 2)\r\n         - Woodcraft Weapons (enchanted, disenchantable, build at tanning rack, achemist perks 1)\r\n         - Druid Gear (build at tanning rack, alchemist perk 4)\r\n         - Deluxe Hunting Weapons (enchanted, disenchantable, build at tanning rack, alchemist perk 5)\r\n\r\n  - Woodcutters Axe and Pickaxe are made craftable at tanning rack, made lighter and given a basic enchantment.\r\n\r\n  - New Spell tomes are creatable at the tanning rack (alchemyst perk 2 and 3)\r\n\r\n  - New coocking recipes! (different alchemist perk levels)\r\n\r\n         - Fish soups\r\n         - Bread and Sweets\r\n\r\n  - New enchantments!\r\n\r\n         - Hunter powers against animals\r\n         - Druid magic\r\n\r\n  - Lore friendly! \r\n\r\n\r\n\r\n\r\nIMPORTANT: The basic-need system is based on \\'Vinis Legit Food and Rest\\' by Vinifera7 who allowed to use his grest mechanism.\r\nCheck out his mod if you want a different basic-need-simulation without the caveman-stuff.\r\n           \r\n           http://skyrim.nexusmods.com/downloads/file.php?id=7511\r\n\r\n\r\nI have a lot of ideas but am not skilled enough to realise most of them, soif \r\nyou have ideas for improvements or want to use this mod as a base for your own work, feel free to do so.\r\n  \r\nI hope you enjoy...\r\n\r\n",
  "categoryId": "24",
  "version": "1.1",
  "author": "Joe316",
  "createdUnix": "1329436153",
  "updatedUnix": "1329486195",
  "containsAdultContent": false,
  "uploadedBy": "Joe316",
  "primaryFile": null,
  "files": [
    {
      "fileId": "32290",
      "name": "Survival and Woodcraft",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18",
      "fileName": "Survival and Woodcraft-9987.zip",
      "uploadedUnix": "1329436249",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f055ffe080b6f2a6ed6dfc789589e648e5c3139847114840350fb3261a825906/analysis/1406688435/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Survival%20and%20Woodcraft-9987.zip?fid=32290&ttl=1535770016&ri=8192&rs=8192&setec=7e63ac7e6381290330d7772e63fa6d26"
    },
    {
      "fileId": "32580",
      "name": "Survial and Woodcraft",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "Survial and Woodcraft-9987.zip",
      "uploadedUnix": "1329486195",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/dcc72e5eaa7ecb9068ce06d5002b5f578de2ddcc795cdc950e55eafb6f56a014/analysis/1406689878/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Survial%20and%20Woodcraft-9987.zip?fid=32580&ttl=1535770017&ri=8192&rs=8192&setec=ee9b394dea5620a90ad15528d70c0d5d"
    }
  ]
}